{
    "id": "h.-ibrahim-son-of-prophet-(saww)",
    "title": "H. Ibrahim son of Prophet (saww)",
    "language": "transliteration",
    "text": [
        "DESC: Ibrahim, the Prophet's (saww) son from his wife Maria Qittiya passed away in childhood, which was a very sad event for the Messenger of Allah (saww) so much so that with tearful eyes he said: Although the heart is restless in his sorrow we do not say anything that may enrage Allah. This beloved son of the Prophet (saww) is buried in Baqee cemetery. One must stand by his grave and recite his Ziarat as follows:",
        "assalaamo a'laa rasoolil laahe assalaamo a'laa nabiyyil laahe",
        "assalaamo a'laa habeebil laahe assalaamo a'laa safiyyil laahe",
        "assalaamo a'laa najiyyil laahe assalaamo a'laa mohammadibne",
        "a'bdil laahe sayyedil ambeyaaa-e wa khatamil mursaleena",
        "wa kheyaratil laahe min khalqehi fee arzehi wa samaaa-ehi",
        "assalaamo a'laa jamee-e' ambeyaaa-ehi wa rosolehi",
        "assalaamo alas shohadae was soadae was saaleheena",
        "assalaamo alayena wa a'laa e'baadil laahis saaleheena",
        "assalaamo a'layka ayyatohar roohuz zaakeyato",
        "assalaamo a'layka ayyatohan nafsush shareefato",
        "assalaamo a'layka ayyatohas solaalatut taaherato",
        "assalaamo a'layka ayyatohan nasamatuz zakiyyato",
        "assalaamo a'layka yabna khayril waraa",
        "assalaamo a'layka yabnan nabiyyil mujtabaa",
        "assalaamo a'layka yabnal mab-o'ose elaa kaaaf- fatil waraa",
        "assalaamo a'layka yabnal basheerin nazeere",
        "assalaamo a'layka yabnas seraajil moneeri",
        "assalaamo a'layka yabnal moayyate bil-qur-aaane",
        "assalaamo a'layka yabnal mursale elal inse wal jaaan-ne",
        "assalaamo a'layka yabna saahebir raayate wal-a'laamate",
        "assalaamo a'layka yabnash sha-fee-e' yawmal qeyaamate",
        "assalaamo a'layka yabna man habaahul laaho bil-karaamate",
        "assalaamo a'layka wa rahmatul laahe wa barakaatohu",
        "ash-hado annaka qadikh taaral laaho laka daara in-a'amehi qabla",
        "ayn yaktoba a'layka ahkaamahu aw yokallefaka halaalahu wa haraamahu",
        "fa-naqalaka elayhe tayyeban zaakeyan marziyyan taaheran",
        "min kulle najasin moqaddasan min kulle danasin",
        "wa bawwa-a-ka jannatal maawaa wa ra-fa-a'ka elad darajaatil o'laa",
        "wa sallal laaho a'layka salaatan taqarrobehaa a'yno rasoolehi",
        "wa toballeghohu akbara maa-moolehi",
        "allaahummaj-a'l afzala salawaateka wa azkaahaa",
        "wa anmaa barakaateka wa awfaahaa a'laa rasooleka wa nabiyyeka",
        "wa kheyarateka min khalqeka mohammadin khaatamin nabiyyeena",
        "wa a'laa man nasala min awlaadehit tayyebeena",
        "wa a'laa man khallafa min i'tratehit taahereena",
        "be rahmateka yaa arhamar raahemeena",
        "allaahumma innee as-aloka be-haqqe mohammadin safiyyeka",
        "wa ibraaheema najle nabiyyeka an taj-a'la sa'yee behim mashkooran",
        "wa zambee behim maghfooran wa hayaatee behim sa-e'edatan",
        "wa aaqebate behim hameedan wa hawaeje behim maqzeeyan",
        "wa afaale behim marziyatan wa omooree behim mas-o'odatan",
        "wa sho-oonee behim mahmoodatan",
        "allaahumma wa-ahsin leyat tawfeeqa",
        "wa naffis a'nnee kulla hammin wa zeeqin",
        "allaahumma jannibnee e'qaabaka",
        "wam-nahnee sawaabaka wa as-kinnee j enaanaka",
        "war-zuqnee rizwaanaka wa amaanaka",
        "wa ashrik lee fee saalehe do-a'aa-ee waaledayya wa wuldee",
        "wa jamee-a'l moa-meneena wal-moa-menaatil",
        "ahyaaa-a minhum wal-amwaata",
        "innaka waliyyul baaqeyaatis saalehaate",
        "aameena rabbal a'alameena."
    ]
}