{
    "id": "syeda-zainab-binte-ali-(sa)---2",
    "language": "transliteration",
    "text": [
        "As-salamu alayki ya bint sayyidi al-anbiya",
        "As-salamu alayki ya bint sahibi al-hawdi wal-liwa",
        "As-salamu alayki ya bint man urija bihi ila as-sama wa wasala ila maqami qabi qawsayn aw adna",
        "As-salamu alayki ya bint nabiyyi al-huda wa sayyidi al-wara wa munqithi al-ibad mina al-rada",
        "As-salamu alayki ya bint sahibi al-khulqi al-azimi wa ash-sharafi al-amimi wal-ayati wadh-dhikri al-hakim",
        "As-salamu alayki ya bint sahibi al-maqami al-mahmudi wal-hawdi al-mawrudi wal-liwa al-mashhud",
        "As-salamu alayki ya bint manhaji deeni al-islami wa sahibi al-qiblati wal-qurani wa alami as-sidqi wal-haqqi wal-ihsan",
        "As-salamu alayki ya bint safwati al-anbiya wa alami al-atqiya wa mashhuri adh-dhikri fi al-ardi was-sama wa rahmatullahi wa barakatuh",
        "As-salamu alayki ya bint khayri khalqillahi wa sayyidi khalqihi wa awwali al-adadi qabla ijadi ardihi wa samawatihi wa akhiri al-abadi ba'da fana'i ad-dunya wa ahliha alladhi ruhuhu nuskhatu al-lahuti wa suratuhu nuskhatu al-mulki wal-malakuti wa qalbuhu khizanatu al-hayyi alladhi la yamut wa rahmatullahi wa barakatuh",
        "As-salamu alayki ya bint al-muzallali bil-ghamami sayyidi al-kawnayni wa mawla ath-thaqalayni wa shafi'i al-ummati yawma al-mahshar wa rahmatullahi wa barakatuh",
        "As-salamu alayki ya bint sayyidi al-awsiya",
        "As-salamu alayki ya bint imami al-atqiya",
        "As-salamu alayki ya bint rukni al-awliya",
        "As-salamu alayki ya bint imadi al-asfiya",
        "As-salamu alayki ya bint ya'subi ad-deen",
        "As-salamu alayki ya bint amiri al-mu'minin",
        "As-salamu alayki ya bint sayyidi al-wasiyyin",
        "As-salamu alayki ya bint qa'idi al-barra",
        "As-salamu alayki ya bint qami'i al-kafara wal-fujara",
        "As-salamu alayki ya bint warithi an-nabiyyin",
        "As-salamu alayki ya bint khalifati sayyidi al-mursalin",
        "As-salamu alayki ya bint diya'i ad-deen",
        "As-salamu alayki ya bint an-naba'i al-azimi ala al-yaqeen",
        "As-salamu alayki ya bint man hisabu an-nasi alayhi wal-kawtharu bayna yadayhi wan-nassu yawma al-ghadeeri alayhi wa rahmatullahi wa barakatuh",
        "As-salamu alayki ya bint man qada ziman naqatiha jibra'ilu wa sharakaha fi musabiha israfilu wa ghadhiba bi-sababiha ar-rabbu al-jalilu wa baka li-musabiha ibrahimu al-khalilu wa nuhun wa musa al-kalimu fi karbala",
        "As-salamu alayki ya bint al-buduri as-sawati",
        "As-salamu alayki ya bint ash-shumusi at-tawali wa rahmatullahi wa barakatuh",
        "As-salamu alayki ya bint zamzama was-safa",
        "As-salamu alayki ya bint makkata wa mina",
        "As-salamu alayki ya bint man humila ala al-buraqi fi al-hawa",
        "As-salamu alayki ya bint man hamala az-zakata bi-atrafi ar-rida wa badhalahu ala al-fuqara",
        "As-salamu alayki ya bint man usriya bihi min al-masjidi al-harami ila al-masjidi al-aqsa",
        "As-salamu alayki ya bint man daraba bis-sayfayn",
        "As-salamu alayki ya bint man salla al-qiblatayn",
        "As-salamu alayki ya bint muhammadin al-mustafa",
        "As-salamu alayki ya bint aliyyin al-murtada",
        "As-salamu alayki ya bint fatimata az-zahra",
        "As-salamu alayki ya bint khadijata al-kubra",
        "As-salamu alayki wa ala jaddiki muhammadin al-mukhtar",
        "As-salamu alayki wa ala abiki haydara al-karrar",
        "As-salamu alayki wa ala as-sadati al-at-hari al-akhyar wa hum hujajullahi ala al-aqtar wa sadatu al-ardi was-sama alladhina hubbuhum farzun ala a'naqi kulli al-khalaiq",
        "As-salamu alayki ya bint waliyyillahi al-mu'azzam",
        "As-salamu alayki ya ammata waliyyillahi al-mukarram",
        "As-salamu alayki ya umma al-masa'ib ya zaynab wa rahmatullahi wa barakatuh",
        "As-salamu alayki ayyatuha al-fadilatu ar-rashida",
        "As-salamu alayki ayyatuha al-kamilatu al-alimatu al-amilatu",
        "As-salamu alayki ayyatuha al-karimatu an-nabila",
        "As-salamu alayki ayyatuha at-taqiyatu an-naqiya",
        "As-salamu alayki ya man zaharat mahabbatuhu lil-husayni al-mazlumi fi mawarida adidatin wa tahmilu al-masa'iba al-muhriqata lil-qulubi ma'a tahammulatin shadida",
        "As-salamu alayki ya man hafizati al-imama fi yawmi ashura fi al-qatla wa badhalat nafsaha fi najati zayn al-abidin fi majlisi ashqa al-ashqiya wa nataqat ka-nutqi aliyyin alayhi as-salamu fi siki al-kufati wa hawlahu kathirun min al-a'da",
        "As-salamu alayki ya man natahat jabinaha bi-muqaddami al-mahmali idh ra'at ra'sa sayyidi ash-shuhada wa yakhruju ad-damu min tahti qina'iha wa min mahmaliha bi-haythu yara man hawlahu min al-a'da",
        "As-salamu alayki ya taliyata al-ma'sum",
        "As-salamu alayki ya mumtahanatu fi tahammuli al-masa'ibi kal-husayni al-mazlum wa rahmatullahi wa barakatuh",
        "As-salamu alayki ayyatuha al-ba'idatu an al-awtan",
        "As-salamu alayki ayyatuha al-asiratu fi al-buldan",
        "As-salamu alayki ayyatuha al-mutahayyiratu fi kharabati ash-sham",
        "As-salamu alayki ayyatuha al-mutahayyiratu fi wuqufik ala jasadi sayyidi ash-shuhada wa khatabti jaddaka rasulullahi sallallahu alayhi wa alihi bi-hadha an-nida: \"Salla alayka mala'ikatu as-sama! Hadha husayun bil-ara maslubu al-imamati war-rida, muqatta'u al-a'da, wa banatuka sabaya! Wa ila allahi al-mushtaka.\"",
        "Wa qalat: \"Ya Muhammad! Hadha Husayun tasfi alayhi rihu as-saba, majdhudhu ar-ra'si min al-qafa, qatila awladi al-bigha. Wa huznahu alayka ya aba abdillah.\"",
        "As-salamu alayki ya man tahayyaja qalbaha lil-husayni al-mazlum al-uryan al-matruhi ala ath-thara wa qalat bi-sawtin hazin: \"Bi-abiya man nafsi lahu al-fida, bi-abiya al-mahmum hatta qada, bi-abiya man shaybatuhu taqtiru bid-dima.\"",
        "As-salamu ala man bakat ala jasadi akhiha bayna al-qatla hatta baka li-buka'iha kullu sadiqin wa aduwwin wa ra'a an-nasu dumu'a al-khayli tanhadiru ala hawafiriha ala at-tahqiq",
        "As-salamu ala man takaffalat wa jama'at fi asri ashura banati rasulillahi wa atfal al-husayn wa qamat laha al-qiyamatu fi shahadati at-tiflani al-gharibani al-mazlumayn",
        "As-salamu ala man lam tanam ainaha li-ajli hirasi ali rasulillahi fi taffi ninawa wa sarat asiratan dhalilatan bi-yadi al-a'da",
        "As-salamu ala man rakibat ba'iran bi-ghayri wita'in wa nadat akhaha aba al-fadli bi-hadha an-nida: \"Akhi aba al-fadhl, anta alladhi arkabtani idh aradtu al-khuruja min al-madinah.\"",
        "As-salamu ala man khatabat fi maydani al-kufati bi-khutbatin nafi'atin hatta sakanat al-aswatu min kulli nahiya",
        "As-salamu ala man ihtajjat fi majlisi ibn ziyadin bi-ihtijajatin wadihatin wa qalat fi jawabihi bi-bayyinat-in sadiqatin, idh qala ibn ziyadin li-zaynab salamullahi alayha: \"Kayfa ra'ayti sun'a allahi bi-akhiki al-husayn?\" Qalat: \"Ma ra'aytu illa jamilan.\"",
        "As-salamu alayki ya asiratan bi-aydi al-a'da'i fi al-falawati wa ra'ayti ahla ash-shami fi halati al-'ayshi was-sururi wa nashri ar-rayat",
        "As-salamu ala man shudda al-hablu ala adhudiha wa unuqi al-imami zayn al-abidin wa adkhaluha ma'a sittata ashara nafaran min ali rasulillahi wa hum ka-al-asara muqarranina bil-hadidi mazlumin",
        "Wa qala aliyyu ibn al-husayn alayhi as-salamu li-yazida: \"Ya yazidu ma zannuka bi-rasulillahi sallallahu alayhi wa alihi law ra'ana ala hadhihi al-halati?\"",
        "Thumma qalat ummu al-masa'ibi zaynab lahu: \"Qa'ilan la ahl-lu wa istahallu farahan thumma qalu ya yazidu la tushal, muntahiyan ala thanaya abi abdillahi, alayhi as-salamu, sayyidi shababi ahli al-jannati tankutuha bi-mikhsaratika?\"",
        "Thumma qalat: \"Wa la'in jarat alayya ad-dawahi mukhatabatuka, inni la astasghiru qadraka wa asta'zimu taqri'aka wa astakthiru tawbikhaka, lakin al-uyunu abra was-suduru harra. Ala fa al-'ajabu kullu al-'ajabi li-qatli hizbillahi an-nujaba bi-hizbi ash-shaytani at-tulaqa'i!",
        "La'in ittakhadhtana maghnaman la-tajiduna washikan mughraman hina la tajidu illa ma qaddamat yadaka, \"Wa ma rabbuka bi-zallamin lil-'abid\" fa ila allahi al-mushtaka wa alayhi al-mu'awwalu fi ash-shiddati war-rakha'i.",
        "Fakid kaydaka was'a say'aka wa nasib jahdaka! Fa wallahi la tamhunnan dhikrana wa la tumitu wahyana wa la tudriku amadana wa la tarkhasu anka arahha.",
        "Wa hal ra'yuka illa fanadun wa ayyamuka illa adadun wa jam'uka illa badadun. Ya yazid ama sami'ta qawla allahi ta'ala: \"Wa la tahsabanna alladhina qutilu fi sabilillahi amwatan bal ahya'un inda rabbihim yurzaqun.\"",
        "Fa al-hamdu lillahi rabbi al-alamin alladhi khatama li-awwalina bis-sa'adati wal-maghfirati wa li-akhirina bish-shahadati war-rahmah, wa nas'alullah an yukmila lahum ath-thawaba wa yujiba lahum al-mazida wa yuhsinu alayna al-khilafah; innahu rahimun wadud, wa hasbuna allahu wa ni'm al-wakil.",
        "Wa sallallahu ala muhammadin wa alihi at-tayyibina at-tahirin"
    ],
    "title": "Syeda Zainab binte Ali (sa) - 2"
}