{
    "id": "after-salat",
    "title": "After Salat",
    "language": "en",
    "text": [
        "INFO: Prophet Muhammad (saww)",
        "Peace be upon you, O Messenger of God, and God’s mercy and blessings. Peace be upon you, O Muhammad bin Abdullah. Peace be upon you, O the best of God. Peace be upon you, O Beloved of God, peace be upon you, O elite of God. Peace be upon you, O Trustee of God. I bear witness that you are the Messenger of God, and I bear witness that you are Muhammad bin Abdullah, I bear witness that you have been sincere towards your nation, and have striven in the path of your Lord, and have worshiped Him until certainty has come to you, so may God reward you, O Messenger of God, with the best. No prophet can be rewarded for his nation. O God, bless Muhammad and the family of Muhammad the best of all that You blessed Abraham and the family of Abraham. Indeed, You are Praiseworthy and Glorious.",
        "INFO: Imam Hussain (as)",
        "Peace be upon thee, O Imam Hussain. Peace be upon Thee, O son of Holy prophet Peace be upon thee, O son of (Imam Ali) the Commander of Faithful Peace be upon thee, O son of Fatima Zahra Peace be upon thee-O Abbas (son of Imam Ali) Peace be upon thee, and the mercy of God and His Bounties",
        "INFO: Imam Ali Ridha (as)",
        "Peace be upon thee, who lies far away from his domain Peace be upon thee, O Ali son of Imam Musa ar Ridha Peace be upon thee and mercy of God and His Bounties",
        "INFO: Imam Mahdi (ajtfs)",
        "Peace be upon thee O king of the times Peace be upon thee O Imam of men and jinn Peace be upon thee O Companion of Qur'an Keep us under your protection Peace be upon thee and the mercy of God and his Bounties O our God, bless Muhammad, and the Progeny of Muhammad",
        "INFO: Ibn Babawayh (i.e. Shaykh al-Saduq) mentions one should say the following litany immediately after reciting Tasbih al-Zahra':",
        "O Allah, You are the [source of] peace,",
        "peace is coming from You,",
        "peace is for You,",
        "and to You does peace belong.",
        "Glory be to your Lord, the Lord of Honor, above what they describe.",
        "Peace be on the messengers.",
        "All praise is due to Allah, the Lord of the worlds.",
        "Peace be upon you, O Prophet.",
        "Allah’s mercy and blessings be upon you.",
        "Peace be upon the Imams; the guides and well-guided.",
        "Peace be upon all Prophets, Messengers, and angels of Allah.",
        "Peace be upon us and upon the righteous servants of Allah.",
        "Peace be upon `Ali, the Commander of the Believers.",
        "Peace be upon al-Hasan and al-Husayn,",
        "the two chiefs of all the youth of Paradise.",
        "Peace be upon `Ali the son of al-Husayn, the Adornment of the Worshippers.",
        "Peace be upon Muhammad the son of `Ali, the splitter of the knowledge of the Prophets.",
        "Peace be upon Ja`far the son of Muhammad, the veracious.",
        "Peace be upon Musa the son of Ja`far, the suppressor of rage.",
        "Peace be upon `Ali the son of Musa, the amiable.",
        "Peace be upon Muhammad the son of `Ali, the magnanimous.",
        "Peace be upon `Ali the son of Muhammad, the guide.",
        "Peace be upon al-Hasan the son of `Ali, the bright and resident of `Askar.",
        "Peace be upon the Argument (of Allah), the son of al-Hasan, the Assumer and the well-guided.",
        "Blessings of Allah be upon them all.",
        "INFO: After saying this litany, one may pray to Almighty Allah to grant him all his personal desires"
    ]
}