{
    "id": "asking-permission-for-entering-the-holy-shrines---1",
    "title": "Asking permission for entering the holy shrines - 1",
    "language": "en",
    "text": [
        "O Allah, this is verily an area that You have purified,",
        "a courtyard that You have honored,",
        "and landmarks that You have ennobled",
        "when You have shown therein the proofs on Your Oneness",
        "and the ghosts of the Glorious Throne",
        "whom You have selected as kings maintaining the System (of the universe),",
        "You have chosen them as chiefs of all beings,",
        "and You have sent them for standing out firmly for justice",
        "since the beginning of existence and up to the Resurrection Day.",
        "You have then conferred upon them with the grace of their representing Your Prophets",
        "in the matters of maintaining Your rules and laws.",
        "You have thus perfected, through assigning them as successors of Your Prophets, the Mission of the warning Prophets",
        "in the same way as You have made their leadership incumbent since the first creation of all peoples who are responsible for carrying out Your duties.",
        "Glory be to You; what a Compassionate Lord Your are!",
        "There is no god save You; what a Just King You are!",
        "Your making has corresponded with all that on which You have created the intellects,",
        "and Your laws have concurred with that which You have decided, including the logic and the narrated.",
        "Praise be to You for Your arrangement—the fine and excellent.",
        "Thanks be to You for Your ordain that is outstandingly founded.",
        "Glory be to Him Whom is not asked about whatever He does,",
        "and Whom is not disputed about whatever He decides.",
        "Glory be to Him Who has inscribed mercy for Himself",
        "before He started creation.",
        "Praise be to Allah Who has conferred upon us",
        "with the favor of assigning rulers who represent Him",
        "as if He is present therein.",
        "There is no god save Allah Who has honored us with Successors",
        "maintaining the (Divine) laws in all ages.",
        "Allah is the Most Great for He has demonstrated them before us",
        "through miracles that neither men nor can the jinn do.",
        "There is no power and no might save with Allah, the Most High, the All-great,",
        "Who has accustomed us to receive His favorable donations that He did to the ancient nations.",
        "O Allah, all praise be to You and elevated thanks be to You",
        "as eternal existence has been confirmed for Your Face,",
        "and as You have chosen our Prophet to be the best of Prophets",
        "and our kings to be the best of the creatures,",
        "and You have chosen them aforetime above the nations knowingly.",
        "(Please do) grant us prosperity to stand at the doorsteps of their flourishing shrines up to the Resurrection Day,",
        "make our souls long for the places of their feet,",
        "and make our spirits desire for looking at their sessions and courtyards",
        "as if we can talk to them in their presence.",
        "May Allah bless them; they are absent masters,",
        "immaculate progeny,",
        "and infallible leaders.",
        "O Allah, (please do) permit us to enter these courtyards",
        "that You have ordered the inhabitants of the heavens and the earth to visit them as sign of worship to You,",
        "make our eyes shed tears of reverence for their dignity,",
        "and make our organs show humility of servitude and of obligatory obedience (to You),",
        "so that we will confess of the qualities that are fixed for them",
        "and to admit that they are the interceders for the creatures",
        "when the Scale shall be set up on the Heights Day.",
        "All praise be to Allah and peace be upon His servants that He has chosen;",
        "Muhammad and His Immaculate Household.",
        "DESC: You may then kiss the doorstep with submission and teary eyes, for this is the sign that you have been permitted by the Infallibles (as) to enter."
    ]
}