{
    "id": "asking-permission-for-entering-the-holy-shrines",
    "title": "Asking permission for entering the holy shrines",
    "language": "en",
    "text": [
        "O Allah, I am standing at one of the doors",
        "of Your Prophet’s Houses—",
        "may Your blessings be upon him and his Household.",
        "And You have prevented people to enter there before they obtain his permission.",
        "You have thus said, “O ye who believe!",
        "Enter not the Prophet's houses until leave is given you.”",
        "O Allah, I believe in the sanctity of the owner of this holy shrine in his absence",
        "as same as I believe in it in his presence.",
        "I also know for sure that Your Messenger and Your Representatives—peace be upon them—",
        "are live, finding their sustenance in the presence of You;",
        "they can see my place,",
        "hear my words,",
        "and respond to my greetings,",
        "but You have prevented my hearing from receiving their words",
        "and You have opened the door of my understanding to taste the fine flavor of my confidential speech with",
        "I thus ask Your permission—O my Lord—first of all,",
        "the permission of Your Prophet—peace be upon him and his Household—secondly,",
        "the permission of Your Representative, the Imam",
        "the obedience to whom is incumbent upon me…",
        "DESC: Mention the name of the Imam that you are visiting his holy shrine and also mention the name of his father. For instance, if you are visiting the holy shrine of Imam al-Husayn (as), you may say, “al-Husayn ibn Ali (as)” and so on.",
        "INFO: You may then say:",
        "…and the permission of the angels whom are commissioned to supervise this blessed area, thirdly.",
        "May I enter, O Messenger of Allah?",
        "May I enter, O Argument of Allah?",
        "May I enter, O angels of Allah—the intimate,",
        "the residing in this shrine?",
        "So, (please do) permit me to enter, O my Master,",
        "in the best way of permission that you have ever conferred upon any of your intimate adherents.",
        "If I do not deserve such permission,",
        "then you are worthy of conferring it upon me.",
        "INFO: You may then kiss the holy doorstep (of the shrine) and enter, saying",
        "In the Name of Allah (I begin), in Allah (I trust),",
        "on the way of Allah (I proceed),",
        "and on the norm of the Messenger of Allah,",
        "may Allah bless him and his Household.",
        "O Allah, (please do) forgive me,",
        "have mercy upon me, and accept my repentance,",
        "for You are verily the Oft-Returning, the All-Merciful."
    ]
}