{
    "id": "h.-abu-talib-(as)",
    "language": "en",
    "text": [
        "Peace be on you , O the leader of Mecca and the son of its chief",
        "Peace be on you, O the inheritor of the Holy Ka’bah after its foundation ….",
        "Peace be on you, O the guardian of the Apostle of Allah",
        "Peace be on you, O the protector of the religion of Allah",
        "Peace be on you, O the uncle of Al-Mustafa",
        "Peace be on you, O the father of Al–Murtaza…",
        "Peace be on you , O the father of the guiding leaders Sufficient for you is the nobility and lineage which Allah has rendered you and enough for you is the honour and esteem that He has granted you",
        "Peace be on you, O the one noble of existence..",
        "Peace be on you, O the friend of worshipped one",
        "Peace be on you, O the protector of the Promised Prophet..",
        "Peace be on you, O the one who was granted a son, who is the best of the new-born ones",
        "Peace be on you, O the one who was designated for a chaste, pure, purified and lofty son (Ali) whose name is derived from that of Allah’s (Ali)",
        "Congratulations be to you for your son who is the satisfied one of the Apostles, the brother of the Apostle, the husband of Batool (Lady-Fatemah) and the ever drawnsword of Allah. <",
        "Again congratulations be to you for your son whose position with Mohammad al-Mustafa is like the one with Hazrat Horroon had with Hazrat Moosa",
        "Congratulations be to you for your son who is a partner in prophethood. The chosen one for brotherhood (with the Holy Prophet). The removal of sorrow, the leader ofthe nation and the father of the Imams.",
        "Congratulations be to you, for your son who is the distributor of Paradise and Hell, the Bounty of Allah upon the righteous and His Wrath upon the debauchers",
        "Peace be on you and on him and on them all (Imams) and the Mercy of Allah and His Blessings…."
    ],
    "title": "H. Abu-Talib (as)"
}