{
    "id": "h.-abal-fadhl-al-abbas-(as)---1",
    "title": "H. Abal-Fadhl al-Abbas (as) - 1",
    "language": "en",
    "text": [
        "DESC: You should stop at the gate of the shed (precinct) and say this ziyarah",
        "Peace of Allah and peace of His favorite angels,",
        "His commissioned prophets,",
        "His righteous servants,",
        "all the martyrs, and all the veracious (ones),",
        "and also pure, true blessings that come and go,",
        "be upon you, O son of the Commander of the Faithful.",
        "I testify to you of submission (to the will of God), honest acceptance as true,",
        "loyalty, and sincerity",
        "to the descendant of the commissioned Prophet, Allah’s blessings be upon him and his Household,",
        "the chosen grandson (of the Prophet),",
        "the well knowledgeable guide (to the true religion),",
        "the conveying successor,",
        "and the wrongfully oppressed one.",
        "So, Allah may reward you on behalf of His Messenger,",
        "the Commander of the Faithful,",
        "al-Hasan, and al-Husayn,",
        "peace of Allah be upon them,",
        "with the best reward",
        "for your steadfastness, dedication (to the sake of God), and support (for the right party).",
        "Very excellent be the reward of the eternal life.",
        "Allah’s curse be on him who killed you.",
        "Allah’s curse be on him who ignored your position",
        "and belittled your sanctity.",
        "Allah’s curse be on him who precluded you from having from the water of the Euphrates.",
        "I testify that you were killed wrongfully",
        "and that Allah will verily fulfill His promise that He made with you.",
        "O son of the Commander of the Faithful, I have come to you to present myself before you.",
        "My heart is submissive to you and is following you.",
        "And I am your follower.",
        "I am ready to support you",
        "until Allah decides.",
        "He is surely the best of all those who decide.",
        "I am verily with you,",
        "not with your enemy.",
        "I am one of those who believe in you and believe in your Return.",
        "I also one of those who deny your opposites and killers.",
        "Allah may kill the group who killed you with hands and tongues (by giving orders of killing you.)",
        "INFO: You should then enter, throw yourself on the tomb, and say the following words",
        "Peace be upon you, O righteous servant (of Allah)",
        "and obedient to Allah, to His Messenger, to the Commander of the Faithful,",
        "to al-Hasan, and to al-Husayn, peace and greetings of Allah be upon them.",
        "Peace, Allah’s mercy, blessings,",
        "forgiveness, and gratifications be upon you, your soul, and your body.",
        "I testify, and call Allah to witness, that you abided by the same course that was taken by the warriors of (the battle of) Badr",
        "and the strivers for Allah’s sake",
        "who sincerely served Him in the battlefields against His enemies,",
        "did their bests for supporting His disciples,",
        "and defended His intimate ones.",
        "So, Allah may reward you the best,",
        "the maximum,",
        "the most abundant,",
        "and the most conclusive reward that He may give to any one who fulfills his homage,",
        "answers the call (of the religion),",
        "and obeys his (divinely elected) leaders.",
        "I testify that you acted extremely sincerely",
        "and exerted all your efforts (in this regard).",
        "Allah may attach you to the martyrs,",
        "add your soul to the souls of the happy ones,",
        "give you the largest abode in His Paradise",
        "and the most handsome room,",
        "exalt your mention in `Illiyyin (the most elevated position),",
        "and join you to the Prophets, the veracious ones,",
        "the martyrs, and the righteous ones.",
        "Very excellent is the companionship of such ones.",
        "I testify that you did not lag behind and did not turn away the face,",
        "and that you left this life with full awareness of the truth,",
        "following the examples of the righteous ones",
        "and sticking to the Prophets.",
        "So, Allah may gather us with you,",
        "with His Messenger, and with His disciples",
        "in the abodes of those who practiced humbly (with their Lord).",
        "He is certainly the most merciful of all the merciful ones.",
        "DESC: You may then turn to the side of the head and offer a two-unit prayer.",
        "DESC: Afterwards, you may offer prayers as many as you wish",
        "INFO: Then you may say the following dua",
        "O Allah, (please) send blessings upon Muhammad and the Household of Muhammad",
        "and do not leave for me, in this honored place and glorified shrine, any sin that I did but that You forgive it,",
        "any care but that You relieve it,",
        "any illness but that You cure it,",
        "any defect buth that You cover up,",
        "any source of sustenance but that You expand it,",
        "any item of terror but that You pacify it,",
        "any disunity but that You reunify it,",
        "any absent one but that You guard it and approach (him to me),",
        "and any single need, among the many needs for this life as well as the life to come",
        "whose settlement achieves your gratification and my good,",
        "but that You grant it. O He Who is the most merciful of all the merciful ones!",
        "INFO: You may then return to the tomb, stop at the side of the legs, and say the following words",
        "Peace be upon you, O Abu’l-Fadl al-`Abbas the son of the Commander of the Faithful.",
        "Peace be upon you, O son of the chief of the successors (of the Prophets).",
        "Peace be upon you, O son of the foremost to Islam,",
        "the first to believe,",
        "the best to have served the religion of Allah,",
        "and the most careful for Islam.",
        "I bear witness that you served Allah, His Messenger, and your brother sincerely.",
        "You were the most excellent self-sacrificing brother.",
        "So, Allah’s curse be on the group who killed you.",
        "Allah’s curse be on the group who wronged you.",
        "Allah’s curse be on the group who violated your sanctities",
        "and infringed the sanctity of Islam.",
        "You were the most excellent steadfast fighter,",
        "protector, supporter,",
        "and brother who defended his brother,",
        "responded to the obedience to his Lord,",
        "and worked desirably for gaining the abundant reward, which others refused,",
        "and the nice tribute.",
        "So, Allah may attach you to the rank of your fathers in the gardens of bliss.",
        "O Allah, I have done the pilgrimage to Your disciples out of my desire for (winning) your reward",
        "and my wish for Your forgiveness and Your abundant benevolence.",
        "So, I implore You to send Your blessings upon Muhammad and his immaculate Household",
        "and to make my sustenance flow copiously in their names,",
        "my living delightful in their names,",
        "my pilgrimage rewardable in their names,",
        "and my life pleasant in their names,",
        "to make me take to the conduct of the honored ones,",
        "to make me one of those who, as returning from the pilgrimage to the tombs of Your beloved ones,",
        "win success and prosperity",
        "and deserve forgiveness of sins,",
        "covering up of defects,",
        "and relief of disasters.",
        "You are surely worthy of being feared and worthy of forgiving"
    ]
}