{
    "id": "h.-abd-al-ʿaẓīm-al-ḥasanī-(as)",
    "language": "en",
    "text": [
        "Peace be on Adam, the Choice of Allāh! Peace be on Noah, the Prophet of Allāh",
        "Peace be on Ibrāhīm, the Friend of Allāh Peace be on Mūsā who spoke to Allāh",
        "Peace be on Isa, the Spirit of Allāh. Peace be on you, O Messenger of Allāh",
        "Peace be on you, O the best of the Mankind Peace be on you, O Choice of Allāh! Peace be on you. O Muḥammad bin Abdullah, the last of the Prophets!",
        "Peace be on you, O ʿAlī b. Abī Ṭālib, Commander of the faithful and the Successor of the Messenger of Allāh.",
        "Peace be on you, O Fāṭimah, the Leader of the women of the worlds,",
        "Peace be on you, O the grandsons of the Prophet of Mercy and the leaders of the youth of Paradise",
        "Peace be on you, O Ali bin Husain the leader of worshippers, O Coolness of investigating eyes",
        "Peace be on you, O Muḥammad b. ʿAlī, O the explorer of the knowledge Peace be on you, O Jaʿfar bin Muḥammad, the truthful the benign, the trustworthy",
        "Peace be on you, O Mūsā bin Jaʿfar, the pure, the purified Peace be on you, O ʿAlī b. Mūsā, the pleased, the gratified",
        "Peace be on you, O Muḥammad b. ʿAlī, the pious one Peace be on you, O Ali bin Muḥammad, the pure, the advising guardian, and the trustworthy",
        "Peace be on Ḥasan b. ʿAlī Peace be on the successor after him",
        "Peace be on you, O Syyed O virtuous, O pure,",
        "Peace be on you, O the son of the pure and the virtuous Peace be on you, O the son of the chosen",
        "Peace be on the Messenger of Allah and his offspring. May Allah confer His Mercy -and blessing on you!",
        "Peace be on the virtuous, obedient slave of Allah, the Lord of the worlds, His Messenger and the Commander of the faithful!",
        "Peace be on you, O Abu al-Qasim, the grandson of the chosen.",
        "Peace be on whose Ziarat is equivalent to the Ziarat of the Leader of the martyrs of the world.",
        "Peace be on you, May Allah grant us your companionship on the day of Judgment and guide us to follow your footsteps",
        "to lead us to your grandfather's fountain and quench our thirst out of it, with Muḥammad's own cup in Ali's hand, Allah Bless you All",
        "I ask Allah to grant us, through you, happiness, ease",
        "to grant us your companionship on the day of Judgment, Allah Bless him and his family,",
        "and to make us know you well Indeed, He is Protector an, Powerful on everything.",
        "I seek Allah's nearness through my love for you and through my enmity for you enemies my surrender to Allah willingly, not unwillingly, my acceptance,",
        "with unshaken faith, what He communicated to Muḥammad seeking in that Thy Face! Thy satisfaction, and the next world, O Master!",
        "O my leader and the son of my leader stand by us when Allah sit in judgment over us, O intimate of Allah,",
        "O Allah, I ask Thee to make me have a happy ending, and not to deprive me from what you have given me",
        "There is neither might nor power but with Allah, the Great, the Exalted.",
        "So by Thy generosity, might Mercy and bounteousness, comply with our supplication,",
        "O Allah, bless Muḥammad, and his pious and pure Progeny and give them abundant peace! O the Most Merciful of the Merciful."
    ]
}