{
    "id": "h.-ibrahim-son-of-prophet-(saww)",
    "title": "H. Ibrahim son of Prophet (saww)",
    "language": "en",
    "text": [
        "DESC: Ibrahim, the Prophet's (saww) son from his wife Maria Qittiya passed away in childhood, which was a very sad event for the Messenger of Allah (saww) so much so that with tearful eyes he said: Although the heart is restless in his sorrow we do not say anything that may enrage Allah. This beloved son of the Prophet (saww) is buried in Baqee cemetery. One must stand by his grave and recite his Ziarat as follows:",
        "Peace be upon Allah's messenger. Peace be upon Allah's prophet.",
        "Peace be upon Allah's elite. Peace be upon Allah's wellselected one.",
        "Peace be upon Allah' confidant. Peace be upon Muhammad son of",
        "'Abdullah: the master of the Prophets, the seal of the Messengers,",
        "and the best of Allah's created beings in the earth and the skies.",
        "Peace be upon all His Prophets and Messengers.",
        "Peace be upon the martyrs, the happy ones, and the righteous ones.",
        "Peace be upon us and upon the righteous servants of Allah.",
        "Peace be upon you, O pure soul.",
        "Peace be upon you, O honorable self.",
        "Peace be upon you, O imnlaculate descendant.",
        "Peace be upon you, O upright person.",
        "Peace be upon you, O son of the best of all created beings",
        "Peace be upon you, O son of the selected Prophet.",
        "Peace be upon you, O son of the envoy to all peoples",
        "Peace be upon you, O son of the conveyor of good tidings (to the believers), the warner (against Allah's chastisement)",
        "Peace be upon you, O son of the bright torch",
        "Peace be upon you, O son of the one supported by the Qur'an",
        "Peace be upon you, O son of the one sent to both men and jinn.",
        "Peace be upon you, O son of the holder of the Pennon and the Sign",
        "Peace be upon you, O son of the Intercessor on the Resurrection Day.",
        "Peace be upon you, O son of him upon wholn Allah has conferred with honor.",
        "Peace and Allah's mercy and blessings be up you.",
        "I bear witness t Allah decided for you the Abode of His Bliss before",
        "He prescribed His rules for you or ordained you to commit to what is deemed lawful and what is deemed unlawful by Him.",
        "He thus moved you near Him while you are immaculate, upright, pleased and purified",
        "for all filths and sanctified against all dirt",
        "He lodged you in the Paradisiacal Abode, and elevated you to the uppermost ranks.",
        "May Allah bless you with such a blessings that delight His messenger",
        "and make him attain his utmost objective.",
        "O Allah : (please do) render the best and the purest of Your blessings,",
        "and the most abundant and the richest of Your benedictions to be upon Your messenger, prophet,",
        "and the most favorite of Your creatures, namely Muhammad, the seal of the prophets",
        "and upon his immaculate sons",
        "and upon his pure successors from his household;",
        "in the name of Your mercy, O most Merciful of all those who show Mercy.",
        "O Allah : I beseech You in the name of Muhammad, Your elite",
        "and in the name of Ibrahim, the son of Your prophet, that You make my efforts praiseworthy,",
        "my sins forgiven, my life satisfying",
        "my end result commendable, my needs settled,",
        "my deeds pleasant, my affairs blissful",
        "and my matters commended.",
        "O Allah : (please do) grant me remarkable successfulness",
        "and relieve all my griefs and depressions.",
        "O Allah : (please do) ward off from me your chastisement,",
        "sign over me Your rewards, allow me to settle in the gardens of your Paradise,",
        "bestow upon me Your pleasure and security,",
        "and allow my acceptable supplications to include my parents, my sons,",
        "and all believing men and women,",
        "the alive and the dead,",
        "for You are verily the Lord of the ever-abiding, good works",
        "Respond to me, O Lord of the Worlds."
    ]
}