{
    "id": "h.-muslim-ibn-aqeel-(as)",
    "title": "H. Muslim ibn Aqeel (as)",
    "language": "en",
    "text": [
        "DESC: Muslim ibn Aqeel was the son of Aqeel ibn Abi Talib, and therefore was a first cousin to Imam Husayn (peace be upon him). The Imam (peace be upon him) sent Muslim as his ambassador to Kufa, where Muslim (peace be upon him) was brutally murdered by the Umayyads on the 9th of Dhul-hijjah. His shrine is within the Premises of the Masjid Kufa nearNajaf Iraq.",
        "INFO: Permission of entrance to the shrine",
        "All praise be to Allah: the Lord and the evident Truth.",
        "All the tyrannical oppressors are subservient to His almightiness.",
        "All the inhabitants of the heavens and the layers of the earth admit His Godhead.",
        "All the created beings confess of His Oneness.",
        "May Allah send blessings upon the master of all created beings",
        "and upon the members of his Household; the noble ones,",
        "such blessings that delight them",
        "and humiliate all those who antagonize them",
        "from all jinn and mankind.",
        "Peace of Allah the All-high and All-great,",
        "and peace of His favorite angels,",
        "His missioned Prophets,",
        "His choice Imams,",
        "His righteous servants,",
        "and all the martyrs and veracious ones,",
        "and all blessings that are pure and delightful,",
        "that are coming and going,",
        "be upon you, Muslim the son of `Aqil the son of Abu-Talib.",
        "Allah’s mercy and benedictions be upon you.",
        "I bear witness that you performed the prayers,",
        "defrayed the zakat,",
        "enjoined the right,",
        "forbade the wrong,",
        "strove in the way of Allah in the best manner of striving,",
        "and you were slain following the course of those who strive in Allah’s way",
        "until you met Allah, to Whom belong all might and majesty, while He is pleased with you.",
        "And I bear witness that you fulfilled your covenant with Allah",
        "and sacrificed yourself for the sake of supporting Allah’s argument and the son of Allah’s argument (namely, Imam al-Husayn)",
        "until death came upon you.",
        "I bear witness that you submitted and acted loyally to him",
        "and that you acted sincerely to the successor of the missioned Prophet,",
        "the select grandson (of the Prophet),",
        "the guide (to the right path), the knowledgeable,",
        "the Prophet’s successor, the conveyor (of his mission),",
        "the wronged, and the oppressed Imam.",
        "May Allah reward you on behalf of His Messenger,",
        "on behalf of the Commander of the Faithful,",
        "and on behalf of al-Hasan and al-Husayn",
        "with the best of rewarding",
        "that befits your steadfastness, reliance (on Allah), and assistance.",
        "How excellent is the final home!",
        "May Allah curse him who slew you.",
        "May Allah curse him who ordered of slaying you.",
        "May Allah curse him who wronged you.",
        "May Allah curse him who forged lies against you.",
        "May Allah curse him who underestimated your position",
        "and belittled your sanctity.",
        "May Allah curse those who cheated you after they had sworn allegiance to you,",
        "those who disappointed and let you down,",
        "and those who allied against you instead of assisting you.",
        "All praise be to Allah Who decided Hellfire to be the eternal abode of those peoples.",
        "Woeful indeed will be the place to which they are led!",
        "I bear witness that you were slain wrongly",
        "and that Allah shall fulfill His promise to you.",
        "As I am visiting you, I recognize your right,",
        "I am submissive to you,",
        "I am imitating your course,",
        "and I am preparing myself for supporting you",
        "until Allah judges, and He is the best of judges.",
        "So, I am always with you",
        "and I never am with your enemies.",
        "May Allah’s peace be upon you",
        "and upon your souls and bodies",
        "and upon the present from you and the absent one.",
        "Peace and Allah’s mercy and blessings be upon you.",
        "May Allah kill the groups that have killed you with deeds and words.",
        "INFO: Ziyarah",
        "Peace be upon you, O righteous servant (of Allah),",
        "who is obedient to Allah, to His Messenger, to the Commander of the Faithful,",
        "to al-Hasan, and to al-Husayn, peace be upon them.",
        "All praise be to Allah",
        "and all peace be upon His servants whom He has chosen:",
        "Muhammad and his Household.",
        "Peace, Allah’s mercy,",
        "blessings, and forgiveness be upon you",
        "and upon your soul and your body.",
        "I bear witness that you died for the same principles for which the martyrs of the Battle of Badr died:",
        "those who strove in Allah’s way",
        "and did their best in struggling against Allah’s enemies",
        "and in supporting Allah’s friends.",
        "So, may Allah reward you with the best rewarding,",
        "with the most abundant rewarding,",
        "and with the most affluent rewarding that He grants to one who fulfilled his allegiance to Him,",
        "responded to His invitation,",
        "and obeyed His representatives.",
        "I bear witness that you exerted all efforts in acting sincerely",
        "and you put forth all possible endeavors",
        "so that Allah has included you with the martyrs,",
        "put your soul with the souls of the delighted ones,",
        "has decided for you the most spacious abode in the gardens of His Paradise",
        "and the best rooms therein,",
        "raised your name to the `illiyyin (the loftiest place),",
        "and added you to the group of the Prophets, the veracious ones,",
        "the martyrs, and the righteous ones.",
        "How excellent is the company of these.",
        "I bear witness that you never slackened or recoiled (from your duty)",
        "and that you died while you are certain of your doctrine",
        "as you followed the righteous ones",
        "and imitated the Prophets.",
        "So, may Allah gather us with you",
        "and with His Messenger and intimate servants",
        "in the abodes of the modest ones.",
        "Surely, He is the most merciful of all those who show mercy.",
        "DESC: You may then offer a two-unit prayer at the side of his head and present this prayer as your gift to him.",
        "DESC: You may recite duas in the shrine if you want."
    ]
}