{
    "id": "imam-ali-(as)---18-zilhajj",
    "title": "Imam Ali (as) - 18 Zilhajj",
    "language": "en",
    "text": [
        "Peace be upon Muhammad the Messenger of Allah,",
        "the seal of the Prophets,",
        "the chief of the Messengers,",
        "and the choice of the Lord of the worlds,",
        "whom Allah has entrusted with His Revelations",
        "and with His determined commandments,",
        "who sealed the previous Messages,",
        "paved the way to the coming blessings,",
        "and Who prevails over all that.",
        "May the mercy, blessings, peace,",
        "benedictions, and greetings of Allah be upon him, too.",
        "Peace be upon the Prophets and Messengers of Allah,",
        "and upon His favorite angels",
        "and righteous saints.",
        "Peace be upon you, O Commander of the Faithful,",
        "the chief of the Prophets’ successors,",
        "the heir of the Prophets’ knowledge,",
        "the friend of the Lord of the worlds,",
        "and my master as well as the master of all of the believers.",
        "May Allah’s mercy and blessings be upon you, too.",
        "Peace be upon you, O my master, O Commander of the Faithful,",
        "the trustee of Allah on His lands,",
        "the envoy of Him amongst His creatures,",
        "and His conclusive argument against His servants.",
        "Peace be upon you, O true religion of Allah",
        "and the straight path of Him.",
        "Peace be upon you, O the Great News",
        "about whom they differ",
        "and they shall be asked.",
        "Peace be upon you, O Commander of the Faithful.",
        "You believed in Allah while they were polytheists,",
        "accepted the truth while they belied it,",
        "strove for the sake of Allah while they refrained,",
        "and worshipped Allah with full sincerity to Him in obedience",
        "while you were steadfast, depending upon Him totally, until death came upon you.",
        "Verily, curse of Allah be upon the wrongdoers.",
        "Peace be upon you, O chief of the Muslims,",
        "head of the believers,",
        "guide of the pious ones,",
        "and leader of the white-forehead ones.",
        "Allah’s mercy and blessings be upon you.",
        "I bear witness that you are indeed the brother of Allah’s Messenger,",
        "the successor of him, the heir of his knowledge,",
        "his trustee on his laws,",
        "his representative in his nation,",
        "and the first to believe in Allah",
        "and to accept as true all that which was revealed to Allah’s Prophet.",
        "I also bear witness that he (i.e. the Prophet) conveyed all that which Allah revealed to him concerning you;",
        "so, he expounded openly what he was commanded (to expound),",
        "declared to his nation the duty of obedience and loyalty to you,",
        "ordered them to swear allegiance to you,",
        "and declared you as enjoying more priority on the believers than that which they enjoy on themselves",
        "in the same was as Allah has made him enjoy the same.",
        "He then asked Allah the All-exalted to be the witness on them (in this respect),",
        "saying, “Have I conveyed?”",
        "They answered, “Yes, you have. We swear to it by Allah.”",
        "He thus said, “O Allah, be the witness",
        "and You are sufficient Witness and Judge between the servants (0f Yours).”",
        "Hence, curse of Allah be upon him who denied the allegiance to you after he had confessed of it",
        "and upon him who breached his pledge to you after he had taken it.",
        "I also bear witness that you have indeed observed your pledge to Almighty Allah",
        "and that Almighty Allah, in return, shall observe His pledge to you.",
        "“Therefore, whoever fulfills what he has covenanted with Allah, He will grant him a mighty reward.”",
        "I also bear witness that you are truly the commander of the faithful,",
        "the Divine Revelation did declare your commissioned leadership,",
        "and the Messenger made a covenant with the people (that they would be under your leadership).",
        "I also bear witness that you, along with your uncle and brother,",
        "traded with Allah in your souls;",
        "He therefore revealed about you this:",
        "“Surely, Allah has bought of the believers their persons and their property for this,",
        "that they shall have Paradise;",
        "they fight in Allah's way, so they slay and are slain;",
        "a promise which is binding on Him in the Torah and the Bible and the Qur'an;",
        "and who is more faithful to his covenant than Allah?",
        "Rejoice therefore in the pledge which you have made;",
        "and that is the mighty achievement.",
        "They who turn to Allah, who serve Him,",
        "who praise Him, who fast,",
        "who bow down, who prostrate themselves,",
        "who enjoin what is good and forbid what is evil,",
        "and who keep the limits of Allah; and give good news to the believers.”",
        "O Commander of the Faithful, I bear witness",
        "that whoever doubts about you has never believed in the Trusted Messenger,",
        "and whoever leaves you to choose another (as his leader) has indeed diverted the true religion,",
        "that the Lord of the worlds has chosen for us,",
        "and that He completed it on the Ghadir Day through (declaring) the Divinely commissioned leadership of you.",
        "And I bear witness that you are the one intended in the following saying of the Almighty, All-merciful Lord:",
        "“And this is My path, the right one; therefore, follow it,",
        "and follow not other ways, for they will lead you away from His way.”",
        "I swear by Allah that whoever follows any one other than you has in fact strayed off the right way and misled others (i.e. those who imitate him),",
        "and that whoever incurs the hostility of you has undoubtedly rejected the right.",
        "O Allah, we have listened to Your command",
        "obeyed, and followed Your straight path;",
        "therefore, (please do) guide us, O our Lord!",
        "And do not cause our hearts to deviate after You have guided us to the obedience to You,",
        "and include us with those who always thank You for Your bounties.",
        "And I also bear witness that you have always been at variance with whimsical desires",
        "as you have always been in line with piety,",
        "you have always been capable of suppressing your rage,",
        "you have always forgiven and pardoned people,",
        "and when Allah is disobeyed, you have always been furious,",
        "and when He is obeyed, you have always been pleased,",
        "and you have always carried out what Allah has commissioned you to do,",
        "you have always observed what has been entrusted with you,",
        "you have always kept what has been confided to you,",
        "you have always conveyed what you were ordered to convey,",
        "and you have always expected that which you were promised.",
        "And I bear witness that as you sometimes conceded some things, you did not do that on account of humiliation,",
        "and as you sometimes did not demand with your right, you did not do that on account of fear,",
        "and as you sometimes stopped combating those who usurped your right, you did not do so on account of weakness,",
        "and as you (on a certain occasion) showed contentment to things to which Allah is not pleased, you did not do so on account of flattery,",
        "and you have never been weakened by what befell you for the sake of Allah,",
        "and you have never been feeble and you have never abased yourself as regards demanding with your rights on account of fear.",
        "I seek Allah’s refuge against such claims;",
        "rather, when you were wronged, you relied upon your Lord in these questions",
        "and entrusted your affair to Him,",
        "and as you reminded them (of their allegiance to you), they did not regard it,",
        "and as you preached them, they did not accept from you,",
        "and as you instructed them to fear Allah, they did not mind.",
        "I also bear witness, O Commander of the Faithful,",
        "that you strove in the way of Allah in the most appropriate way",
        "until Allah summoned you to be in His vicinity,",
        "chose to grasp you,",
        "and established the argument against your enemies who killed you,",
        "so that you should have argument against them,",
        "although you enjoy conclusive arguments against all of His creatures.",
        "Peace be upon you, O Commander of the Faithful.",
        "You have worshipped Allah sincerely,",
        "striven in the way of Allah steadfastly,",
        "sacrificed yourself, seeking Allah’s judgment,",
        "acted upon His Book,",
        "followed His Prophet’s instructions,",
        "performed the prayers,",
        "paid the zakat,",
        "enjoined what is right,",
        "and forbidden what is wrong as much as you could,",
        "seeking what is possessed by Allah",
        "and desiring for that which Allah has promised.",
        "You have never cared for misfortunes,",
        "never yielded to the hardships,",
        "and never stopped fighting against any warrior on account of fear.",
        "Indeed, whoever claims anything opposite to this to you is actually fabricating",
        "and is forging lies to you,",
        "and whoever leaves your path is drawing himself near to destruction.",
        "You have certainly striven in the way of Allah as exactly as required,",
        "stood harm for the sake of Allah,",
        "have been the foremost to believe in Allah,",
        "the first to offer prayer and to strive,",
        "and the first to expose himself in the land of the polytheists,",
        "while the lands were suffocated with deviation,",
        "Satan was worshipped openly,",
        "and (in the midst of this) you said, “The big number of people that surround me shall never increase my might,",
        "nor shall their departing me make me feel lonely.",
        "I thus shall never submit even if all peoples desert me.”",
        "Because you resorted to Allah, you were the mightiest,",
        "and because you preferred the Next World to this worldly life, you have been ascetic.",
        "Thus, Allah supported, guided,",
        "chose, and selected you.",
        "Your deeds were never contradictory,",
        "your words were never paradoxical,",
        "your situations were never fickle,",
        "you have never claimed falsely or forged lies against Allah,",
        "you have never been greedy for the wreckage of this world,",
        "you have never been defiled by sins,",
        "you have always had manifest proof from your Lord,",
        "and you have always been certain of what you do,",
        "as you used to guide to the right and to a straight path.",
        "I bear true witness",
        "and I truly swear by Allah",
        "that Muhammad and his Household—may Allah’s blessings be upon them—are the masters of all creatures",
        "and you are indeed my master and the master of all believers,",
        "the servant and friend of Allah,",
        "the brother, successor, and heir of the Messenger,",
        "who used to say to you,",
        "“I swear this by Him Who sent me with the truth: whoever denies you has never believed in me,",
        "whoever rejects you has never confessed of Allah’s existence,",
        "whoever abandons you has actually strayed off,",
        "and whoever is not guided be you has never found the way to Allah or to me.",
        "Confirming this, my Lord the the Almighty and All-majestic says,",
        "‘Most surely, I am most Forgiving to him who repents and believes and does good,",
        "then follows the right path.’ To follow the right path is to adhere to your Divinely commissioned leadership.”",
        "O master, your favor cannot be concealed",
        "and your light cannot be extinguished.",
        "Verily, he who rejects you shall be the most misfortunate wrongdoer.",
        "O master, you are the (Divine) claim against the servants,",
        "the guiding to uprightness,",
        "and our means on the Promised Day.",
        "O master, Allah has indeed elevated your standing in this world,",
        "raised your rank in the Hereafter,",
        "and led you to that which has not been seen by those who antagonized you,",
        "those who stood between you and Allah’s gifts to you.",
        "So, curse of Allah be upon those who violated your sanctity",
        "and those who prevented you from taking your right.",
        "I do bear witness that these are the biggest losers",
        "whose faces shall be scorched by Hellfire",
        "and they therein shall be in severe affliction.",
        "And I bear witness that whenever you did something or you avoided doing something,",
        "and whenever you said something or you kept silent;",
        "all these were by the order of Allah and His Messenger.",
        "You thus said, “I swear this by Him Who grasps my soul:",
        "when the Messenger of Allah—peace of Allah be upon him and his Household—",
        "watched me striking (the enemies) with my sword ceaselessly, he said to me,",
        "‘O `Ali, your position to me is the same as (Prophet) Aaron’s position to (Prophet) Moses;",
        "yet, there shall be no prophet after me.",
        "I would like to further inform you that your death and your lifestyle shall be with me and according to my instruction.’",
        "(Imam `Ali continued,) I swear by Allah that I have not told untruth and none shall belie me,",
        "and I have never strayed off and none shall ever mislead me,",
        "and I have never forgotten my Lord’s instructions to me,",
        "and I do follow the true path of my Lord that He showed His Prophet",
        "and the Prophet showed me,",
        "and, most certainly, I am following the lucid path step by step.”",
        "By Allah I swear, true are your words and you have said nothing but the truth.",
        "Curse of Allah be upon those who compare you to your enemies,",
        "while Allah, Whose Name be elevated, says,",
        "“Are those who know and those who do not know alike?”",
        "So, the curse of Allah be upon those who compared you to those whom Allah has ordered to follow your leadership,",
        "while you are the friend of Allah,",
        "the brother of His Messenger,",
        "the defender of His religion,",
        "and the one whose preference (to all others) has been declared by the Qur'an;",
        "hence, Almighty Allah says,",
        "“And Allah shall grant to the strivers above the holders back a mighty reward.",
        "(High) degrees from Him, protection, and mercy.",
        "And Allah is Forgiving, Merciful.”",
        "Almighty Allah has also said,",
        "“Do you make one who undertakes the giving of drink to the pilgrims and the guarding of the Sacred Mosque",
        "to be like him who believes in Allah and the latter day and strives hard in Allah's way?",
        "They are not equal with Allah;",
        "and Allah does not guide the unjust people.",
        "Those who believed, fled their homes,",
        "and strove hard in Allah’s way with their property and their souls",
        "are much higher in rank with Allah;",
        "and those are they who are the achievers of their objects.",
        "Their Lord gives them good news of mercy from Himself and His good pleasure",
        "and gardens, wherein lasting blessings shall be theirs;",
        "abiding therein for ever.",
        "Surely, Allah has a mighty reward with Him.”",
        "I bear witness that Allah’s words of praise mean you exclusively",
        "and you are the most sincere in the obedience to Allah",
        "as you have never accepted any alternative for the right guidance",
        "and you have never associated anyone in your worshipping your Lord.",
        "And Almighty Allah has responded the prayer of His Prophet—",
        "peace of Allah be upon him and his Household—concerning you.",
        "He then ordered him to proclaim the position of succeeding him in (the leadership of) his nation,",
        "as a sign of showing your elevated position,",
        "declaration of the evidence on your leadership,",
        "refutation of the false claims,",
        "and repudiation of all excuses.",
        "But when he (i.e. the Prophet) worried about the sedition that would be aroused by the transgressing group due to such declaration",
        "and he did not want you to be faced by the hypocrites,",
        "the Lord of the worlds revealed to him, saying,",
        "“O Messenger! Proclaim the message which has been sent to you from your Lord.",
        "If you did it not, you would not have fulfilled and proclaimed His mission.",
        "And Allah will defend you from men (who mean mischief).”",
        "Accordingly, he (i.e. the Prophet) burdened himself with the loads of (long) walking",
        "and stood up under the burning sun in the midst of the desert,",
        "where he delivered a speech, made everyone listen to him,",
        "and called upon them with rhetorical language.",
        "He then asked them all,",
        "“Have I conveyed (the message)?”",
        "“Yes, you have. We swear it by Allah,” they answered.",
        "“O Allah, be the witness!” the Prophet said.",
        "He then added, “Do I not enjoy more priority to the selves of the believers than that which they enjoy on themselves?”",
        "“Yes, you do,” answered they.",
        "Hen then took you from the hand and said,",
        "“This `Ali is now the master of every one who has betaken me as his master.",
        "O Allah, (please do) support those who support `Ali,",
        "be the enemy of those who incur the hostility of `Ali,",
        "give victory to those who stand by `Ali,",
        "and disappoint those who disappoint `Ali.”",
        "Nevertheless, none believed in what Allah has revealed to His Prophet about you except a few.",
        "Similarly, this (Divinely commissioned) declaration did not increase others but obstinacy.",
        "In defiance of them, Almighty Allah had revealed in this connection:",
        "“O you who believe!",
        "Whoever from among you turns back from his religion,",
        "then Allah will bring a people. He shall love them and they shall love Him.",
        "(They shall be) lowly before the believers,",
        "mighty against the unbelievers.",
        "They shall strive hard in Allah's way",
        "and shall not fear the censure of any censurer.",
        "This is Allah's favor; He gives it to whom He pleases.",
        "And Allah is Ample-giving, Knowing.",
        "Only Allah is your Guardian and His Messenger and those who believe:",
        "those who keep up prayers",
        "and give alms while they are in the state of the genuflection of prayer.",
        "And whoever takes Allah and His messenger and those who believe for a guardian,",
        "then, surely, the party of Allah are they that shall be triumphant.”",
        "Our Lord! We believe in what You have revealed and we follow the messenger;",
        "so, write us down with those who bear witness.",
        "Our Lord! Make not our hearts to deviate after You have guided us aright.",
        "And grant us from Your mercy.",
        "Surely, You are the most liberal Giver.",
        "O Allah, We do realize that this is the truth whose source is You.",
        "So, curse those who object, act arrogantly (towards it),",
        "belie, and deny it.",
        "And they who act unjustly shall know to what final place of turning they shall turn back.",
        "Peace be upon you, O Commander of the Faithful,",
        "chief of the Prophets’ successors,",
        "foremost of the worshippers,",
        "and most ascetic.",
        "May Allah’s mercy and blessings be upon you.",
        "So be His peace and compliments.",
        "It is you who served a poor man, an orphan, and a prisoner with food on account of your love for Him,",
        "(you did so) for the sake of Allah, while you did not ask for reward or thanks.",
        "Hence, Almighty Allah has revealed the following about you:",
        "“And they prefer them to themselves though poverty may afflict them.",
        "And whoever is preserved from the niggardliness of his soul, these it is that are the successful ones.”",
        "Verily, it is you who is the suppressor of rage",
        "and it is you who is the pardoner of people,",
        "and Allah loves the good-doers.",
        "It is also you who is the steadfast in distress and affliction, as well as in times of conflicts.",
        "And it is you who distributes things completely equally,",
        "who is just among the subjects,",
        "and the one having full acquaintance with the laws of Allah among all people.",
        "Informing about the favors that He has conferred upon you, Allah the All-exalted says,",
        "“Is he then who is a believer like him who is a transgressor?",
        "They are not equal.",
        "As for those who believe and do good,",
        "the gardens of Paradise are their abiding-place; an entertainment for what they did.”",
        "It is you to whom the knowledge of the Divine Revelation is given exclusively",
        "as well as the laws of true interpretation (of the Holy Qur'an)",
        "and the words of the Messenger.",
        "You are known for your unforgettable situations,",
        "renowned positions,",
        "and memorable events,",
        "in the Battle of Badr and the Battle of the Allies (al-Ahzab):",
        "“When the eyes turned dull, and the hearts rose up to the throats,",
        "and you began to think diverse thoughts of Allah.",
        "There, the believers were tried and they were shaken with severe shaking.",
        "And when the hypocrites and those in whose hearts was a disease began to say:",
        "‘Allah and His Messenger did not promise us (victory) but only to deceive.’",
        "And when a party of them said,",
        "‘O people of Yathrib! There is no place to stand for you here; therefore, go back.’",
        "And a party of them asked permission of the prophet,",
        "saying: ‘Surely, our houses are exposed.’",
        "And they were not exposed; they only desired to fly away.”",
        "Almighty Allah has also said:",
        "“And when the believers saw the allies, they said:",
        "‘This is what Allah and His Messenger promised us.",
        "And Allah and His Messenger spoke the truth.’",
        "And it only increased them in faith and submission.”",
        "On that day, you (O `Ali) killed their knight, `Amr (ibn `Abd-Wadd)",
        "and defeated their allies:",
        "“And Allah turned back the unbelievers in their rage.",
        "They did not obtain any advantage.",
        "And Allah sufficed the believers in fighting.",
        "And Allah is Strong, Mighty.”",
        "On the Battle of Uhud: “When they ran off precipitately and did not wait for any one",
        "and the Messenger was calling them from their rear.”",
        "And you were engaged in preventing the polytheists from reaching the Prophet,",
        "on both sides—the right and the left,",
        "until Almighty Allah drove them back, full of fear.",
        "Hence, He gave victory, by means of you, to the disappointing ones.",
        "On the Battle of Hunayn, as is accounted by the Divine Revelation:",
        "“When your great numbers made you vain, but they availed you nothing.",
        "And the earth became strait to you notwithstanding its spaciousness,",
        "then you turned back retreating.",
        "Then, Allah sent down His tranquility upon His Messenger and upon the believers.”",
        "“The believers” were you and your party.",
        "You uncle, al-`Abbas, was calling at the defeated party:",
        "“O companions of Surah al-Baqarah!",
        "O owners of the Allegiance of the Tree!”",
        "He still shouted until a group responded to him, and it was you who replaced them in fighting,",
        "and it was you who aided the Prophet instead of them.",
        "They therefore returned free from reward,",
        "and hoping for repentance, as was promised by Almighty Allah.",
        "He, majestic be His mention, says,",
        "“Then will Allah, after this, turn mercifully to whom He pleases.”",
        "As for you, you were awarded the rank of steadfastness",
        "and prized the great reward.",
        "On the Battle of Khaybar, when Allah exposed the cowardice of the hypocrites",
        "and cut off the roots of the atheists,",
        "so, all praise be to Allah, Lord of the worlds (for that):",
        "“And, certainly, they had made a covenant with Allah before, that they would not turn their backs.",
        "And Allah's covenant shall be inquired of.”",
        "O master, you are the conclusive argument (of Allah),",
        "the clear course,",
        "the poured grace,",
        "and the radiant evidence.",
        "So, congratulations, for the favors that Allah has given you.",
        "perdition overtake your enemies, the ignorant!",
        "You presented yourself with the Prophet—peace be upon him and his Household—",
        "during all battles and expeditions that he led;",
        "you always carried the pennon with him",
        "and stroke (the enemies) with your sword before him.",
        "Then, due to your prominent determination",
        "and your sagacity in all affairs,",
        "he (i.e. the Prophet) appointed you as the commander on all occasions,",
        "and you were never under the commandment of another.",
        "On many occasions, your piety prevented you from doing what you had decided about a matter,",
        "while your rival followed his (personal) lust and committed that matter.",
        "Thus, the ignorant ones thought that you were incapable of doing that which had been done by your rival!",
        "I swear by Allah that any one who thought so had missed the right thing and had never found the true guidance.",
        "However, you clarified the misunderstanding in which those who fancied and doubted fell",
        "by your saying—may Allah’s peace be upon you:",
        "“One who has been through thick and thin of life finds the excuses",
        "to be preventing him from orders and prohibitions of Allah,",
        "but he disregards them despite capability (to succumb to them and instead follows the commands of Allah),",
        "while one who has no restraints of religion seizes the opportunity (and accepts the excuses for not following the commands of Allah).”",
        "You have said the very truth; I swear it by Allah, and the followers of vanity are indeed losers.",
        "And when the two preachers (of their allegiance) tried to deceive you;",
        "and said, “We want to go on `umrah!”",
        "You thus answered them, “I swear by your lives; you do not want to go on `umrah;",
        "rather, you want to betray me!”",
        "Hence, you made covenant with them again",
        "and you renewed their allegiance to you;",
        "but they exerted all efforts to act hypocritically.",
        "And when you drew their attentions to this act, they neglected, redid it again, and did not follow your advice.",
        "Thus, their end result was loss.",
        "After them, the people of Syria (mutinied)!",
        "So, you went to fight them after you had provided all excuses,",
        "while they did not follow the true religion",
        "neither did they understand the Qur'an.",
        "They were rabble, rot, and deviants,",
        "and they were unbelievers in what was revealed to Muhammad about your leadership,",
        "and they were supporters of those who antagonized you.",
        "While, Almighty Allah ordered everyone to follow you",
        "and instructed the believers to support you.",
        "He, the Almighty and All-majestic, has said in this respect:",
        "“O you who believe!",
        "Be careful of your duty to Allah, and be with the truthful.”",
        "O master, through you did the right manifest itself,",
        "but the people discarded it.",
        "And you made clear the (Prophetic) traditions after they had been eradicated and confused.",
        "Hence, you enjoy the priority of struggling for the sake of confirming the Divine Revelation,",
        "and you enjoy the virtue of struggling for the sake of confirming the true interpretation (of the Divine Revelation).",
        "Your enemy is in fact the enemy of Allah and the denier of Allah’s Messenger.",
        "Your enemy thus calls for vanity, judges unfairly,",
        "usurps the position of rule, and drives his fans to Hellfire.",
        "While `Ammar (ibn Yasir) strove and called at the two parties (of the battle):",
        "“How eager I am to join Paradise!”",
        "When he then asked for a drink, he was served with a drink of milk; he thus shouted, glorifying Allah, and said:",
        "“The Messenger of Allah—peace of Allah be upon him and his Household—did say to me:",
        "‘The last drink that you will have in this world is a cup of milk,",
        "and the transgressing party will kill you.’”",
        "Thus, Abu’l-`ªdiyah al-Fazari faced and killed him.",
        "The curse of Allah",
        "and the curse of all His angels and Messengers be upon this Abu’l-`ªdiyah,",
        "upon any one who unsheathed a sword against you,",
        "and upon any one against whom you unsheathed your sword—",
        "O Commander of the Faithful—",
        "(Curse be upon) the polytheists and the hypocrites up to the Religion Day.",
        "Curse be also upon any one whom is pleased by whatever upsets you,",
        "and curse be upon any one who is not passive for whatever upsets you and upon any one who bypasses and does not deny,",
        "and upon any one who supports your rivals by deeds or words,",
        "and upon any one who fails to support you,",
        "and upon any one who slackens to fight with you,",
        "and upon any one who despises your merits,",
        "and upon any one who denies your right,",
        "and upon any one who leaves you and joins one upon whom Almighty Allah has given you priority.",
        "Allah’s peace, mercy, and blessings,",
        "compliments, and greetings",
        "be upon you and upon the Imams from your Immaculate Household.",
        "Verily, Allah is Praised and Glorious.",
        "What is more astounding",
        "and more horrible than usurping your right",
        "is the usurpation of Fadak from the veracious, pure, and luminous Lady, the doyenne of the women of the world!",
        "As well as the rejection of your testimony and the testimonies of the two masters—your descendants,",
        "and the Household of the Chosen Prophet, may Allah’s peace be upon you all.",
        "Whereas Almighty Allah has elevated you in rank over the nation,",
        "raised your positions,",
        "and demonstrated your preference and honorable favorability over all the created beings.",
        "He thus removed away filth from you and purified you with the most thorough purification.",
        "Allah the Almighty and All-majestic says:",
        "“Indeed, man is created of a hasty temperament.",
        "Being greatly grieved when evil afflicts him",
        "and niggardly when good befalls him,",
        "except those who pray.”",
        "Hence, Almighty Allah has excluded His Chosen Prophet",
        "you, the chief of the Prophets’ successors, from among all His beings.",
        "How deviant from the right he who has wronged you is!",
        "They then deceptively decided the share of ‘Near of Kin’ to be for you,",
        "after they wrongly deprived its meritorious people of it.",
        "When the matter (of rule) was returned to you, you continued carrying out what they had decided,",
        "because you desired for what is stored by Allah for you.",
        "Your ordeals are thus similar to the ordeals encountered by the Prophets, peace be upon them,",
        "who also faced loneliness and absence of supporters.",
        "As you replaced the Prophet by spending that night on his bed instead of him, this situation was similar to the situation of the self-sacrificing Prophet, peace be upon him.",
        "Because you responded (to the Prophet’s order) in the same way as he (i.e. Prophet Isma`il) responded (to his father’s request),",
        "and you obeyed the Prophet in the same way as (Prophet) Isma`il obeyed with steadfastness and reliance upon Allah.",
        "Hence, when his father said to him, ‘O my son! Surely, I have seen in a dream that I should sacrifice you;",
        "consider then what you see.’",
        "He said, ‘O my father! Do what you are commanded;",
        "if Allah please, you will find me of the patient ones.’",
        "The same situation with you, when the Prophet—peace be upon him and his Household—chose you to replace him,",
        "and ordered you to sleep in his bed instead of him",
        "so that you should protect him by sacrificing yourself for him,",
        "you quickly responded to his request with obedience,",
        "by exposing yourself to killing fearlessly.",
        "So, Allah the All-exalted appreciated this obedience to him",
        "and He, majestic be His mention, declared your excellent deed by saying:",
        "“And among men is he who sells himself to seek the pleasure of Allah.”",
        "Then, your ordeal on the Battle of Siffin,",
        "when books of the Qur'an were raised (on spearheads) out of trickery and deception,",
        "causing doubt to be aroused,",
        "the truth to be neglected,",
        "and conjecture to be followed,",
        "this ordeal was similar to the ordeal of (Prophet) Aaron when (Prophet) Moses appointed him as the leader of his people, but they left him alone,",
        "while (Prophet) Aaron was calling at them, saying:",
        "‘O my people! You are only tried by it, and surely your Lord is the Beneficent Allah.",
        "Therefore, follow me and obey my order.’",
        "They said, ‘We will by no means cease to keep to its worship until Moses returns to us.’",
        "Similarly, when the books of the Qur'an were raised (on spearheads), you said:",
        "‘O my people, you are only tried by this and you have been surely cheated.’",
        "Nevertheless, they disobeyed you and did the opposite.",
        "And when they demanded with nominating two arbitrators (one from each party),",
        "you rejected and declared your disavowal of this act before Allah, and then asked them to do whatever they wanted.",
        "Thus, when the truth manifested itself",
        "the wrong was proven as futile,",
        "and they confessed of their flaw and deviation from the right thing,",
        "they also mutinied after that",
        "and obliged you to commit to the nonsensical result of the arbitration that you had rejected and they had accepted,",
        "and you had forbidden it, and they then confessed of the sin that they had committed.",
        "While you were following the course of sagacity and true guidance,",
        "they were following the courses of deviation and blindness.",
        "Nonetheless, they insisted on hypocrisy",
        "and involved themselves in seduction",
        "until Allah made them taste the evil result of their conduct.",
        "He thus deadened, through your sword, those who mutinied against you, causing them eternal misery and perdition,",
        "and He gave life, through your acting as His argument, to those whom He decided as happy; therefore, they were guided (to the true choice).",
        "Allah’s blessings be upon you, coming and going,",
        "and still and moving.",
        "Certainly, no one praising you can ever cover your actual characteristics",
        "and no one criticizing you can ever belittle your merits.",
        "You are verily the best worshipper of all created beings,",
        "the most sincere in asceticism,",
        "and the most enthusiastic defender of the religion.",
        "You executed the laws of Allah with exceptional efforts",
        "and damaged the armies of the apostates with your sword.",
        "You can extinguish the flames of battles with your finger,",
        "tear out the curtains of seditions with your eloquent language,",
        "and distinguish the confusing wrong from the plain right.",
        "You are never influenced by any censure as long as you work for the sake of Allah.",
        "The praising of Allah the All-exalted to you suffices",
        "from the praising of any other one and from the approval of the depicters.",
        "Almighty Allah says:",
        "“Of the believers are men who are true to the covenant which they made with Allah.",
        "So, of them is he who accomplished his vow, of them is he who yet waits, and they have not changed in the least.”",
        "After you felt that you had killed the preachers, the wrongdoers, and the apostates,",
        "the predictions of Allah’s Messenger—peace be upon him and his Household—came true,",
        "and you had fulfilled your promise to him, you then said:",
        "“Has time not come yet so that this (beard) shall be dyed with the blood of this (head)?",
        "When will the most unfortunate of them be sent (to slay me)?”",
        "You were always confident that you were proceeding on clear proof from your Lord,",
        "you were acting with sure knowledge of what you do,",
        "you were on your way to Allah,",
        "and you were rejoicing in the bargain that you had made with Him;",
        "and that is the supreme triumph.",
        "O Allah, curse the murderers of your Prophets and the murderers of Your Prophets’ successors",
        "with the variant curses (that You have prepared for them),",
        "and make those slayers to taste the heat of Your fire.",
        "And also curse those who usurped the right of Your friend,",
        "those who denied their allegiance to him,",
        "and those who rejected him after they had witnessed and declared their loyalty to him",
        "on the day when you completed your religion through him.",
        "O Allah, curse those who slew the Commander of the Faithful,",
        "curse those who wronged him, and curse their adherents and supporters.",
        "O Allah, curse those who wronged and slew al-Husayn,",
        "and curse those who adhered to his enemies and those who supported them,",
        "and curse those who were pleased by the murder of killing al-Husayn and those who disappointed him, with violent cursing.",
        "O Allah, curse the first one to invent the wronging against the Household of Muhammad",
        "and curse those who deprived them of their rights.",
        "O Allah, pour violent curses upon the first one who wronged and usurped the rights of the Household of Muhammad,",
        "and curse all those who followed those wrongdoers up to the Resurrection Day.",
        "O Allah, send blessings upon Muhammad, the seal of the Prophets,",
        "and upon `Ali, the chief of the Prophets’ successors, and upon his immaculate Household,",
        "(please do) make us adhere to them firmly,",
        "and include us with those who shall be winners and secured because they abode by their leadership;",
        "those upon whom there shall come no fear, nor shall they grieve."
    ]
}