{
    "id": "imam-ali-(as)---at-najaf-shrine---entrance",
    "title": "Imam Ali (as) - at Najaf Shrine - Entrance",
    "language": "en",
    "text": [
        "INFO: D0 Ghusl and While you are about to leave your house, you may say the following",
        "O Allah, I leave my house seeking Your bounties",
        "and visiting the Viceroy of Your Prophet—peace of You be upon both of them.",
        "So, O Allah, (please do) make it easy for me,",
        "help me pay this visit to him,",
        "and take my place, while I am away, in my affairs and possessions",
        "in the best manner of taking place.",
        "O most Merciful of all those who show mercy!",
        "INFO: You may then proceed, extolling Almighty Allah with the following doxology",
        "All praise be to Allah.",
        "All glory be to Allah.",
        "There is no god but Allah.",
        "INFO: Once you reach the trench of al-Kufah, you may stop there and say the following words",
        "Allah is the Most Great. Allah is the Most Great.",
        "O worthiest of exaltation, glorification, and grandeur.",
        "Allah is the Most Great. O worthiest of being deemed Great, of sanctification,",
        "of glorification, and of granting bounties.",
        "Allah is Greater than what I fear and what I worry about.",
        "Allah is the Most Great; He is my support and on Him do I rely.",
        "Allah is the Most Great; He is my hope and to Him do I turn.",
        "O Allah, You are indeed the source of my blessings",
        "and You alone can respond to my request.",
        "You know my neediness",
        "and whatever is concealed by the premonitions of hearts",
        "and the thoughts of inner selves.",
        "I therefore beseech You in the name of Muhammad, the Chosen Prophet,",
        "through whom You have stopped all the claims of those who may excuse",
        "and the pretexts of those who may make apologies",
        "and whom You have decided to be mercy to the peoples,",
        "(I beseech You) not to deprive me of the rewards of my visiting Your intimate servant,",
        "the brother of Your Prophet, and the Commander of the Believers and my directing to him,",
        "and to include me with the virtuous delegation to him",
        "and with his pious adherents;",
        "(I beseech for that) in the name of Your mercy, O most Merciful of all those who show mercy.",
        "INFO: e your eyes fall on the holy dome, say these wor",
        "All praise be to Allah, for He has conferred upon me exclusively",
        "the legitimacy of birth,",
        "and for He has bestowed me, out of His honoring me,",
        "with the loyalty to the pious,",
        "immaculate representatives (of Him),",
        "the best of all, and the most knowledgeable.",
        "O Allah, (please do) accept my seeking for You",
        "and my earnest imploration in Your Presence",
        "and (please do) forgive my sins that cannot be hidden from You.",
        "Verily, You are Allah, the King, the All-forgiving.",
        "INFO: When you reach at the fortress of Najaf (hisn al-najaf), you may say the following words",
        "All praise be to Allah Who has guided us to this;",
        "and we would not have found the way had it not been that Allah had guided us.",
        "All praise be to Allah Who has made me travel in His countries,",
        "Who has caused me to ride His animals,",
        "Who has made the distant space seem near for me,",
        "Who has kept away from me what is dangerous,",
        "and Who has held off against me what is unwanted",
        "until He made me come up to the Precinct of the brother of His Messenger,",
        "peace be upon him and his Household.",
        "INFO: You may then enter the city, saying",
        "All praise be to Allah Who has allowed me to enter this blessed zone,",
        "which Allah has blessed",
        "and has chosen for His Prophet’s Successor.",
        "O Allah, (please do) make this zone witness for me.",
        "INFO: When you reach at the first doorstep, you may say the following",
        "O Allah, I have stopped at Your door,",
        "I have come to Your court,",
        "to Your Cord do I cling,",
        "Your mercy do I seek,",
        "and by Your Intimate Servant—may Your blessings be upon him—do I beg You.",
        "So, (please do) make it an admissible visit",
        "and a responded supplication.",
        "INFO: You may then stop at the gate of the courtyard, saying the following",
        "O Allah, this holy place is verily Yours,",
        "this situation is Yours,",
        "and I am entering here so as to confide to You",
        "things that You are more knowledgeable than I am",
        "as well as You are more knowledgeable than I am as regards my secrets and my confidential speech.",
        "All praise be to Allah, the All-benevolent, the All-favorer, the All-munificent,",
        "Who, out of His munificence, has made it easy for me to visit my master,",
        "Who has not made me banned from visiting him,",
        "and Who has not included me with those who are prevented from being loyal to his (Divinely commissioned) leadership;",
        "rather, He has bestowed upon me and donated me (this favor).",
        "O Allah, just as You have conferred upon me with the favor of recognition of him,",
        "so also (please do) include me with his adherents (Shi`ah)",
        "and allow me to enter Paradise by means of his intercession,",
        "O most merciful of all those who show mercy.",
        "INFO: You may then enter the courtyard of the holy shrine and say the following words",
        "All praise be to Allah Who has honored me with the recognition of Him,",
        "the recognition of His Messenger,",
        "and the recognition of him the obedience to whom has been made incumbent upon me by Him",
        "on account of His mercy to me,",
        "His favor that He bestowed upon me,",
        "and His conferral upon me with faith.",
        "All praise be to Allah Who has allowed me to enter the shrine of His Messenger’s brother",
        "and has made me see this shrine while I enjoy good health.",
        "All praise be to Allah Who has included me with the visitors of the tomb of His Messenger’s successor.",
        "I bear witness that there is no god but Allah,",
        "alone without having any associate,",
        "and I bear witness that Muhammad is His servant and Messenger.",
        "He has conveyed the truth from Allah.",
        "And I bear witness that `Ali is the servant of Allah and the brother of Allah’s Messenger.",
        "Allah is the Most Great. Allah is the Most Great. Allah is the Most Great.",
        "There is no god but Allah, and Allah is the Most Great.",
        "All praise be to Allah for He has guided me",
        "and led me successfully to His course to which He has invited (us).",
        "O Allah, You are verily the most excellent besought One",
        "and the most honorable purposed One.",
        "I thus have come to You, seeking nearness to You",
        "in the name of Your Prophet, the Prophet of Mercy",
        "and in the name of his brother, the Commander of the Faithful,",
        "`Ali the son of Abu-Talib—peace be upon them both.",
        "So, (please do) send blessings upon Muhammad and the Household of Muhammad,",
        "do not disappoint my efforts,",
        "(please) grant me a merciful look from You through which You refresh me,",
        "make me illustrious in Your view in this world as well as the world to come,",
        "and make me of those brought near to You.",
        "INFO: You may then walk until you stop at the door of the portico and say the following words",
        "Peace be upon Allah’s Messenger",
        "whom Allah has entrusted with His Revelations and with His determined commandments,",
        "who sealed the previous Messages,",
        "paved the way to the coming blessings,",
        "and who prevails over all that.",
        "May the mercy and blessings of Allah be upon him, too.",
        "Peace be upon the holder of tranquility.",
        "peace be upon the one buried at al-Madinah.",
        "Peace be upon the triumphed and supported (by Allah).",
        "Peace be upon Abu’l-Qasim, Muhammad the son of `Abdullah.",
        "May the mercy and blessings of Allah be upon him, too.([1])",
        "INFO: You may then enter the portico with your right foot, stop at the door of the dome, and say these words seeking permission to enter",
        "I bear witness that there is no god but Allah,",
        "alone without having any associate,",
        "and I bear witness that Muhammad is His servant and Messenger.",
        "He has conveyed the truth from Him and verified the (past) Messengers.",
        "Peace be upon you, O Messenger of Allah!",
        "Peace be upon you, O most-beloved of Allah and best of His beings!",
        "Peace be upon the Commander of the Faithful",
        "the servant of Allah and the brother of Allah’s Messenger.",
        "O master, O Commander of the Faithful!",
        "I, your slave and the son of your slave and your bondmaid,",
        "have come to you seeking the refuge of your protection,",
        "directing to your shrine,",
        "turning my face toward your place,",
        "and begging Almighty Allah in your name.",
        "May I enter, O master?",
        "May I enter, O Commander of the Faithful?",
        "May I enter, O argument of Allah?",
        "May I enter, O trustee of Allah?",
        "May I enter, O angels of Allah who reside in this shrine?",
        "O master, may you permit me to enter",
        "in the best way of permission you have ever given to any of your devotees?",
        "If I am too little to deserve your permission, then You are too exalted to deprive me of it.",
        "INFO: You may then kiss the doorstep and enter there with your right foot, saying the following",
        "In the Name of Allah (I begin), in Allah (I trust),",
        "on the way of Allah,",
        "and on the norm of the Messenger of Allah (I proceed),",
        "may Allah bless him and his Household.",
        "O Allah, (please do) forgive me",
        "for You are verily the Oft-Returning."
    ]
}