{
    "id": "imam-ali-al-naqi-and-imam-al-hasan-al-askari-(as)",
    "title": "Imam Ali al-Naqi and Imam al-Hasan al-Askari (as)",
    "language": "en",
    "text": [
        "DESC: When you are at the gate of the holy shrine, you may ask permission of entrance and recite the following form of ziyarah, which is considered the most authentic",
        "INFO: At the gate of the holy shrine",
        "Peace be upon both of you, O representatives of Allah.",
        "Peace be upon both of you, O Arguments of Allah (against His created beings).",
        "Peace be upon both of you, O Light of Allah in the darkness of the earth.",
        "Peace be upon both of you, O they about whom Allah has decided.",
        "I have come to you visiting (your tombs),",
        "recognizing your right,",
        "showing enmity towards your enemies,",
        "declaring loyalty to your loyalists,",
        "believing in that which you both believed in,",
        "disbelieving in all that which you both disbelieved in,",
        "deeming right all that which you deemed right,",
        "and deeming wrong all that which you deemed wrong.",
        "I thus beseech Allah, my and your Lord,",
        "to decide that my rewards for my visit to you both",
        "to be His sending blessings upon Muhammad and his Household",
        "and to grant me the favor of accompanying you both in the gardens of Paradise",
        "with your righteous fathers.",
        "I also beseech Him to save me from Hellfire,",
        "to grant me your intercession and your company,",
        "to introduce me to you,",
        "not to take out from my heart love for you both",
        "and for your righteous fathers at all,",
        "not to decide this time of my visit to you as the last,",
        "and to include me with your group in Paradise, out of His mercy .",
        "O Allah, (please do) grant me love for them",
        "and make me die following their faith.",
        "O Allah, curse and punish those who usurped the right of the Household of Muhammad wrongfully.",
        "O Allah, curse the past and the coming generations of those people,",
        "apply to them many folds of torture,",
        "and send them, their fans,",
        "their adherents, and the followers",
        "to the deepest area of Hellfire.",
        "Verily, You have power over all things.",
        "O Allah, (please do) hasten the Relief of Your representative and the son of Your representative",
        "and cause our relief to accompany his relief,",
        "O most merciful of all those who show mercy.",
        "DESC: You may then pray for yourself and your parents.",
        "DESC: If you can reach their tombs, you may offer a two-unit prayer there. or in the mosque which is adjacent to the house of the two Imams (as), where they used to perform the prayers.",
        "INFO: Ziyarah with a Little Difference",
        "DESC: The aforesaid form of ziyarah has been cited according to the book of Kamil al-Ziyarah. However, Shaykh Muhammad ibn al-Mashhadi, Shaykh al-Mufid, and al-Shahid, in their books on forms of ziyarah, have recorded it with little difference. i.e. added the following:",
        "INFO: You may then approach towards the two tombs, throw yourself on them, kiss them, and place your two cheeks on them. When you raise your head, you may say the following",
        "O Allah, (please do) grant me love for them,",
        "and make me die following their course…",
        "DESC: They then added: You may now offer four units of prayer next to the side of the Imam’s head."
    ]
}