{
    "id": "imam-ali-(as)---ziyarat-ameenallah",
    "language": "en",
    "text": [
        "Peace be upon you, O trustee of Allah on His lands",
        "and argument of Allah against His servants.",
        "Peace be upon you, O Commander of the Faithful.",
        "I bear witness that you strove for the sake of Allah as it ought to be striven,",
        "acted upon His Book,",
        "and followed the instructions of His Prophet,",
        "peace of Allah be upon him and his Household,",
        "until Allah called you to be in His vicinity.",
        "So, He grasped you to Him by His will",
        "and put your enemies under the claim",
        "although you have inclusive claims against all of His creatures.",
        "O Allah, (please do) cause my soul to be fully tranquil with Your decrees,",
        "satisfied with Your acts,",
        "fond of mentioning and praying to You,",
        "bearing love for the choicest of Your intimate servants,",
        "beloved in Your lands and heavens,",
        "steadfast against the affliction of Your tribulations,",
        "thankful for Your graceful bounties,",
        "always bearing in mind Your incessant gifts,",
        "longing for the gladness of meeting You,",
        "supplied with piety for the day of Your rewarding,",
        "pursuing the morals of Your intimate servants,",
        "quitting the conducts of Your enemies,",
        "and distracted from this world by praising and thanking You.",
        "O Allah, the hearts of those humbling themselves to You are fascinated,",
        "the paths of those desiring for You are open,",
        "the sings of those directing to You are evident,",
        "the hearts of those having recognition of You are resorting to You,",
        "the voices of those beseeching You are mounting up to You,",
        "the doors of responding to them are wide open,",
        "the prayer of him who speaks to You confidentially is responded,",
        "the repentance of him who turns to You modestly is admitted,",
        "the tear of him who weeps on account of fear from You is compassionated,",
        "the aid of him who seeks Your aid is available,",
        "the help of him who seeks Your help is obtainable,",
        "Your promises to Your servants are fulfilled,",
        "the slips of him who implore You to excuse him are forgivable,",
        "the deeds of those who act for You are preserved,",
        "Your sustenance to the creatures are descending from You,",
        "Your gifts for further conferrals are reaching them,",
        "the sins of those imploring Your forgiveness are forgiven,",
        "the requests of Your creatures are granted by You,",
        "the prizes of those begging You are offered,",
        "Your gifts for further conferrals are uninterrupted,",
        "the dining tables for those seeking Your feeding are prepared,",
        "and the springs of quenching their thirst are brimful.",
        "O Allah, (so) respond to my prayer,",
        "accept my thanksgiving for You,",
        "and join me to my masters,",
        "[I beseech You] in the name of Muhammad, `Ali,",
        "Fatimah, al-Hasan, and al-Husayn.",
        "You are verily the only source of my boons,",
        "the ultimate goal of my wishes,",
        "and the target of my hope in my recourses and settlement.",
        "INFO: In the book of Kamil al-Ziyarat, the following statements are added to this form of Ziyarah",
        "You are verily my God, Master, and Lord.",
        "(Please) forgive our friend,",
        "prevent our enemies against us,",
        "distract them from harming us,",
        "give prevalence to the Word of Truth",
        "and make it the supreme,",
        "and frustrate the word of falsehood",
        "and make it the lowliest.",
        "Verily, You have power over all things.",
        "INFO: Mafateeh ul Jinaan: p. 698; Misbah ul Mutahajjid: p. 738; and in Misbah uz Zaaer: p. 474, and the Mazaar of Agha Jamaal Khwansaari: p. 98 with slight difference.",
        "INFO: Farewell Ziyaarat to be Recited after Ziyaarat-e-Ameenullah The author says: I have seen in the book ‘Al-Iqbaal’ and the book ‘Sahifa al-Saadeqiyyah’ written by late Sayed ibn Taaoos (r.a.) and in two manuscripts in which a farewell ziyaarat to be recited after ziyaarat-e-Ameenullah, narrated by Imam Ja’far al-Sadiq (as) has been mentioned.",
        "INFO: Jaabir says: When I informed Imam Ja’far al-Sadiq (as) about the ziyaarat of Ameenullah as narrated by Imam Muhammad Baqir (as), he (as) said: “Whenever you decide to depart from the shrine of the Holy Imams (as) then add in it this supplication after Ziyaarat-e-Ameenullah",
        "Peace be on you, O the Imam and mercy of Allah and His blessings, I entrust you with Allah and upon you is peace and mercy of Allah and His blessings.",
        "We believe in the Messenger, and in whatever you have come with and called to.",
        "O Allah! Do not make this my last visitation of Your master.",
        "O Allah! Do not deprive me of the reward of his shrine which You have decided for him and make our returning to visit it easy for us, if Allah – the High – wish."
    ]
}