{
    "id": "imam-ali-(as)---at-najaf-shrine---farewell",
    "language": "en",
    "text": [
        "Peace and Allah’s mercy and blessings be upon you.",
        "I entrust you with Allah and ask Him to keep you under His custody and to send blessings upon you.",
        "We believe in Allah, in the Messengers, and in what they have conveyed to us,",
        "in that to which they have called, and in that to which they have guided.",
        "So, (please, our Lord,) include us with the witnesses.",
        "O Allah, (please) do not decide this visit of mine to him (i.e. the Imam) to be the last,",
        "and if you cause me to die before that,",
        "then I bear witness in my death",
        "to the same things to which I have born witness in my lifetime:",
        "I bear witness that `Ali the Commander of the Faithful,",
        "and al-Hasan, al-Husayn,",
        "`Ali ibn al-Husayn,",
        "Muhammad ibn `Ali,",
        "Ja`far ibn Muhammad,",
        "Musa ibn Ja`far,",
        "`Ali ibn Musa,",
        "Muhammad ibn `Ali,",
        "`Ali ibn Muhammad,",
        "al-Hasan ibn `Ali,",
        "and al-Hujjah (the Argument of Allah) ibn al-Hasan—",
        "may Your blessings be upon all of them—are my Imams.",
        "I also bear witness that all of those who have slain and fought against them are polytheists",
        "and that all of those who reject them shall be in the lowest class of Hellfire.",
        "I also bear witness that those who have fought against the Imams are our enemies",
        "and we disavow them,",
        "because they are indeed the party of Satan.",
        "The curse of Allah, His angels and all the peoples be upon those who killed the Imams,",
        "and upon those who had any role in killing them and those who were pleased for their having been killed.",
        "O Allah, as I begin with invoking Your peace and blessings upon them,",
        "I pray you to bless Muhammad, `Ali,",
        "Fatimah, al-Hasan, al-Husayn,",
        "`Ali, Muhammad, Ja`far, Musa,",
        "`Ali, Muhammad, `Ali, al-Hasan, and al-Hujjah,",
        "and not to decide this visit of me to his tomb to be the last,",
        "and if you decide so, then (please) include me with these Imams to whom I have referred.",
        "O Allah, (please) cause our hearts to be subservient to them by showing obedience to them, well-wishing,",
        "love for them, support, and submission."
    ],
    "title": "Imam Ali (as) - at Najaf Shrine - Farewell"
}