{
    "id": "imam-mahdi-(ajtfs)---ahad-fajr",
    "language": "en",
    "text": [
        "DESC: This Ziarat is recited after every Fajr prayer for Imam Mahdi (ajtfs)",
        "O Allah, (please) convey to my master the Patron of the Age,",
        "Allah’s blessings be upon him,",
        "on behalf of all the believing men and women",
        "in the east and west sides of the earth,",
        "in its lands and oceans,",
        "in its plains and mountains,",
        "and both the alive and the dead,",
        "and on behalf of my parents, my descendants, and me,",
        "(convey to him) such blessings and greetings",
        "that are as heavy as the measure of the Throne of Allah,",
        "as much as the ink of His words,",
        "as endless as His pleasure,",
        "and as many as all that which has been calculated by His Books",
        "and comprehended by His knowledge.",
        "O Allah, I update to him",
        "on this day",
        "and on all days",
        "a pledge, a covenant, and an allegiance to which I commit up to my neck.",
        "O Allah, just as You have endued me with this honor,",
        "conferred upon me this virtue,",
        "and granted me exclusively this bounty,",
        "so also (please) send blessings upon my master and chief,",
        "the patron of the age,",
        "and make me of his supporters,",
        "adherents, and defenders,",
        "and make me of those who will be martyred in his presence,",
        "with full willingness and without compulsion,",
        "in the line whose people have been described in Your Book",
        "where You say, “… one line as if they were a firm and compact wall,”",
        "and with obedience to You",
        "and obedience to Your Messenger and his Household,",
        "peace be upon them.",
        "O Allah, this is my allegiance to him that is involved in my neck",
        "up to the Resurrection Day.",
        "INFO: Dua After Ziyarah",
        "DESC: It is narrated that Imam `Ali ibn Musa al-Ridha (as), used to order his companions and adherents to say \"Dua Allumma Idfaa an waliyak\" for sake of Imam al-Mahdi (ajtfs). Besides, it is strongly recommended to say it after the ziyarah of Imam al-Mahdi (ajtfs)."
    ],
    "title": "Imam Mahdi (ajtfs) - Ahad Fajr"
}