{
    "id": "imam-ali-(as)---at-najaf-shrine-5",
    "language": "en",
    "text": [
        "INFO: You may face the tomb of Imam `Ali (as) and say the following words",
        "Peace be upon you, O Allah’s Messenger.",
        "Peace be upon you, O Allah’s select.",
        "Peace be upon you, O Allah’s trustee.",
        "Peace be upon him whom Allah chose,",
        "selected, and preferred from amongst His creatures.",
        "Peace be upon you, O Allah’s friend",
        "whenever night darkens and becomes dusk",
        "and whenever daylight shines and gleams.",
        "Peace be upon you whenever one keeps silent,",
        "whenever one utters something, and whenever a new day begins.",
        "So also be Allah’s mercy and blessings upon you.",
        "Peace be upon our master - the Commander of the Faithful,",
        "`Ali the son of Abu-Talib,",
        "the owner of unprecedented virtues, merits, and relief,",
        "the terminator of the phalanxes of the infidels,",
        "the all-courageous,",
        "the all-powerful,",
        "the deep-rooted,",
        "who will serve the believers with water in a cup",
        "from the Pond of the Messenger—the honorable, the honest.",
        "Peace be upon the owner of perspicacity, favors,",
        "bestowals, honors, and incentives.",
        "Peace be upon the knight of the believers,",
        "the lion of the monotheists,",
        "the slayer of the polytheists,",
        "and the successor of the Messenger of the Lord of the words.",
        "May Allah’s mercy and blessings be upon him, too.",
        "Peace be upon him whom Allah supported with (Archangel) Gabriel,",
        "backed with (Archangel) Michael,",
        "whom Allah has bestowed a close degree in both this abode and the abode to come,",
        "and whom Allah has granted all things that act as delight for an eye.",
        "May Allah send blessings upon him",
        "upon his Household the immaculate,",
        "upon his descendants the choicest ones,",
        "and upon the right-directing Imams,",
        "who enjoined the right,",
        "forbade the wrong,",
        "explained to us the duty of prayers,",
        "ordered us to give alms,",
        "made clear for us the observance of fasting during the month of Ramadan,",
        "and taught us the true recitation of the Qur'an.",
        "Peace be upon you, O Commander of the Faithful,",
        "chief of the religion,",
        "and leader of the white-forehead, marked believers.",
        "Peace be upon you, O door to Allah.",
        "Peace be upon you, O sighting Eye of Allah,",
        "extending Hand of Him,",
        "listening Ear of Him,",
        "Allah’s conclusive argument,",
        "His flowing boon,",
        "and His forceful punishment.",
        "Peace be upon the decider between people of Paradise and people of Hellfire.",
        "Peace be upon Allah’s benefaction for the righteous ones",
        "and Allah’s wrath on the wicked ones.",
        "Peace be upon the leader of the pious good-doers.",
        "Peace be upon the brother of Allah’s Messenger,",
        "the cousin of him, the husband of his daughter,",
        "and the one created from the same clay of him.",
        "Peace be upon the eternal origin",
        "and the noble branch.",
        "Peace be upon the prolific fruit.",
        "Peace be upon Abu’l-Hasan, `Ali.",
        "Peace be upon the Tree of Tuba (bliss) and the lote-tree of the utmost boundary.",
        "Peace be upon Adam the choice of Allah,",
        "upon Noah the Prophet of Allah,",
        "upon Abraham the friend of Allah,",
        "upon Moses the spoken by Allah,",
        "upon Jesus the Spirit of Allah,",
        "upon Muhammad the most beloved by Allah,",
        "and upon the Prophets, the veracious ones,",
        "the martyrs, and the upright ones who came among them.",
        "How excellent is the company of these!",
        "Peace be upon the light of lights,",
        "the descendant of the pure ones,",
        "and the originally righteous ones.",
        "Peace be upon the father of the virtuous Imams.",
        "Peace be upon the firm cord of Allah",
        "and the strong side of Him.",
        "May Allah’s mercy and blessings be upon him, too.",
        "Peace be upon Allah’s trustee on His land,",
        "Allah’s viceroy and the judge with His laws,",
        "the custodian over His religion,",
        "the spokesman of His wisdom,",
        "the actor upon His Book,",
        "the brother of the Messenger,",
        "the husband of the Chaste Lady,",
        "and the unsheathed sword of Allah.",
        "Peace be upon the owner of the indications,",
        "the magnificent signs,",
        "and the overcoming miracles,",
        "the redeemer from perdition,",
        "and whom Allah has mentioned in the decisive verses,",
        "saying, “And surely, in the original of the Book with Us, it is written that `Ali is wise.”",
        "Peace be upon Allah’s pleased Name,",
        "His Brilliant Face,",
        "and His most elevated side.",
        "May Allah’s mercy and blessings be upon him, too.",
        "Peace be upon Allah’s Arguments, successors,",
        "prominent people, and choices,",
        "selects, and trustees.",
        "May Allah’s mercy and blessings be upon him, too.",
        "I have come to you, O master,",
        "O Allah’s trustee and argument,",
        "visiting (your tomb), acknowledging your right,",
        "acceding to your adherents,",
        "incurring the hostility of your enemies,",
        "and seeking Allah’s nearness through my visit to you.",
        "So, (please) intercede for me before Allah—your and my Lord—",
        "so that He may save me from Hellfire",
        "and respond to my requests of this world and the Next World.",
        "INFO: You may then throw yourself on the tomb, kiss it, and say the following",
        "Salutations of Allah and salutations of His Archangels,",
        "and those who heartily yield to you,",
        "O Commander of the Faithful,",
        "and those who speak of your virtue",
        "and those who bear witness that you are surely honest, faithful, and veracious;",
        "salutations as well as Allah’s mercy and blessings of all those be upon you.",
        "I bear witness that you are verily pure, immaculate, and purified",
        "and you are the descendant of the pure, immaculate, and purified ones.",
        "I bear witness for you, O Intimate servant of Allah and loyal to Allah’s Messenger,",
        "that you did convey and carry out (your mission).",
        "I also bear witness that you are the duty that Allah has imposed (upon us) and the door to Him,",
        "you are the beloved of Allah",
        "and the direction from which Allah is reached,",
        "you are the path to Allah,",
        "and you are the servant of Allah",
        "and the brother of His Messenger—may Allah’s blessings be upon him and his Household.",
        "I have come to you seeking nearness to Allah, to Whom belong all might and majesty, through my visit to you,",
        "seeking your intercession for me,",
        "through which I hope for saving of myself from Hellfire,",
        "seeking your protecting of myself from the Fire,",
        "escaping my sins with which I have burdened my back,",
        "and having recourse to you in the hope for my Lord’s mercy.",
        "O my master, I have come to you seeking your intercession for me",
        "and I seek nearness to Allah through you",
        "so that He may grant me all of my requests.",
        "So, O Commander of the Faithful, (please) intercede for me before Allah,",
        "for I am the servant of Allah, and I am your associate and visitor,",
        "and you enjoy with Allah a praiseworthy standing,",
        "as well as a great esteem,",
        "a high superiority,",
        "and an acceptable right of intercession.",
        "O Allah, (please do) send blessings upon Muhammad and the Household of Muhammad,",
        "and send blessings upon the Commander of the Faithful—",
        "your well-pleased servant,",
        "your most faithful trustee,",
        "your firmest handle,",
        "your highest hand,",
        "your uppermost side,",
        "your most excellent word,",
        "your claim on the creatures,",
        "your prime all-veracious,",
        "the master of the Prophets’ successors,",
        "the pillar of the saints,",
        "the support of the elite ones,",
        "the commander of the faithful,",
        "the leader of the religion,",
        "the example of the righteous ones,",
        "the chief of the choice ones,",
        "the protected against defects,",
        "the precluded against flaws,",
        "the purified from fault,",
        "the saved from doubt,",
        "the brother of Your Prophet,",
        "the successor of Your Messenger,",
        "the one who sacrificed himself for Your Prophet [when he took his place on his bed],",
        "the one who gave up his soul for Your Prophet,",
        "the one who removed agonies from Your Prophet,",
        "the one whom You chose to be the sword of Your Prophet’s prophethood,",
        "the sign of his Messengership,",
        "the witness over his people,",
        "the indication of his evidences,",
        "the bearer of his pennon,",
        "the shield against his heart,",
        "the guide of his people,",
        "the powerful hand of his might,",
        "the crown of his head,",
        "the door to his secrets,",
        "and the key to his victory,",
        "until he defeated the armies of polytheism by Your permission,",
        "annihilated the forces of infidelity by Your order,",
        "devoted himself to the pleasure of Your Messenger,",
        "and dedicated it to the obedience to him.",
        "So, O Allah, (please do) send upon him with endless, nonstop blessings.",
        "INFO: You may then add the following",
        "Peace be upon you, O intimate servant of Allah,",
        "the shining brightness,",
        "and the endless light.",
        "O descendant of the pure ones!",
        "O secret of Allah!",
        "Verily, there are between Allah and me sins",
        "that have burdened my back",
        "and nothing can ease them except His pleasure;",
        "so, (I beg you) in the Name of Him Who has entrusted you with His secret",
        "and assigned you to manage the affairs of His creatures",
        "to (please) be the interceder for me before Allah,",
        "to be my savoir from the Fire,",
        "and to be my supporter against the vicissitudes of my time,",
        "for I am the servant of Allah and I am your loyalist and visitor.",
        "May Allah send blessings upon you.",
        "INFO: You may then offer a six-unit prayer, which is the Ziyarah Prayer, and supplicate for whatever you want. Then, you may say the following",
        "Peace be upon you, O Commander of the Faithful!",
        "Peace of Allah be upon you forever",
        "as long as I am alive and as long as days and nights come after each other.",
        "INFO: You may then turn your face towards the tomb of Imam al-Husayn (as), point to it, and say the following",
        "Peace be upon you, O Abu-`Abdullah.",
        "Peace be upon you, O son of Allah’s Messenger.",
        "I have come to both of you visiting and begging you to be mediators",
        "between me and Allah, the All-exalted, your and my Lord,",
        "and I am turning my face to Allah in your names,",
        "and seeking your intercession for me before Allah to grant me this request of mine, which is…",
        "INFO: You may then say the famous supplicatory prayer known as Du`a’ Safwan (or Du`a’ `Alqamah), which will be cited after the famous Ziyarah of `ªshura', up to its end; i.e. up to this paragraph",
        "He is verily All-nigh, All-responding.",
        "INFO: You may then face the kiblah direction and say the same Du`a’ Safwan from its beginning",
        "O Allah! O Allah! O Allah!",
        "O He who gives answer to the cries of the persecuted!",
        "O He who pulls out the grief-stricken from agony",
        "INFO: and up to the following statements",
        "…and make me leave having my requests granted",
        "and having all my agonies relieved,",
        "including those of this world and those of the world to come.",
        "O most Merciful of all those who show mercy!",
        "INFO: You may then turn your face toward the tomb of Amir al-Mu'minin (as) and say the following words",
        "Peace be upon you, O Commander of the Faithful!",
        "And peace be upon Abu-`Abdullah al-Husayn,",
        "as long as I am alive and as long as day and night endure.",
        "May Allah not make this visit of mine to be the last of my visit to both of you!",
        "And may Allah never separate me from you!"
    ],
    "title": "Imam Ali (as) - at Najaf Shrine 5"
}