{
    "id": "imam-ali-(as)---at-najaf-shrine-6",
    "language": "en",
    "text": [
        "INFO: When you stop at the Door of Peace (bab al-salam: the gate of Imam `Ali’s holy shrine) where you can see the holy tomb, you may repeat the following phrase forty-three times:",
        "Allah is the Most Great.",
        "INFO: You may then say the following words",
        "Peace of Allah and peace of His Archangels,",
        "His missioned Prophets, and His righteous saints,",
        "and [peace of] all the martyrs and the veracious",
        "be upon you, O Commander of the Faithful.",
        "Peace be upon Adam the choice of Allah.",
        "Peace be upon Noah the prophet of Allah.",
        "Peace be upon Abraham the intimate friend of Allah.",
        "Peace be upon Moses the spoken to by Allah.",
        "Peace be upon Jesus the Spirit of Allah.",
        "Peace be upon Muhammad the beloved by Allah.",
        "Allah’s mercy and blessings be upon them, too.",
        "Peace be upon the pleased name of Allah,",
        "His most elevated Face,",
        "and His straight path.",
        "Peace be upon the refined, purified one.",
        "Peace be upon Abu’l-Hasan, `Ali the son of Abu-Talib.",
        "Allah’s mercy and blessings be upon him, too.",
        "Peace be upon the choicest friend.",
        "Peace be upon the one particularly married to the doyenne of the women [of the world].",
        "Peace be upon the one born in the Ka`bah",
        "and married in the heavens.",
        "Peace be upon the lion of Allah in battlefields.",
        "Peace be upon the one by whom Makkah and Mina have been honored.",
        "Peace be upon the one in charge of the Divine Pond and the bearer of the pennon [on the Resurrection Day].",
        "Peace be upon the fifth of the Cloak Members.",
        "Peace be upon the one who replaced the Prophet in his bed",
        "and thus sacrificed himself for the Prophet against the enemies.",
        "Peace be upon the one who plucked up the gate of Khaybar city and threw it far away in the air.",
        "Peace be upon the one who spoke to the Seven Sleepers of Ephesus in their cave with the language of the Prophets.",
        "Peace be upon the one who caused a ruined well in the desert to spring forth with water.",
        "Peace be upon the one who moved a rock",
        "after strong men could not even move it.",
        "Peace be upon the one who spoke to a serpent",
        "from the minbar (pulpit) of al-Kufah Mosque with an eloquent language.",
        "Peace be upon the one who spoke to a wolf",
        "and spoke to a skull",
        "whose bones were decayed in al-Nahrawan.",
        "Peace be upon the one granted the right of intercession on the Assembly Day.",
        "Allah’s mercy and blessings be upon him, too.",
        "Peace be upon the pure leader who stuck to the mihrab (prayer niche).",
        "Peace be upon the owner of astounding miracles",
        "and who speaks with wisdom and sagacity.",
        "Peace be upon the one who holds the interpretation of the decisive and the allegorical [verses of the Holy Qur'an]",
        "and holds the Basis of the [Holy] Book.",
        "Peace be upon the one to whom the sun was returned",
        "after it had disappeared beyond the veils of night.",
        "Peace be upon the one who spent the dark nights with acts of worship and ponderation.",
        "Peace be upon the one who was addressed by Archangel Gabriel as the Commander of the Faithful, without any doubt.",
        "Allah’s mercy and blessings be upon him, too.",
        "Peace be upon the master of masters.",
        "Peace be upon the owner of miracles.",
        "Peace be upon the one whose campaigns in the battles were a source of astonishment for the angels of seven heavens.",
        "Peace be upon the one who, when he consulted the Holy Messenger,",
        "offered something in charity before his consultation.",
        "Peace be upon the commander of the armies and the leader of the battles.",
        "Peace be upon the one who spoke to a wolf in the desert.",
        "Peace be upon the light of Allah in murk.",
        "Peace be upon the one to whom the sun was returned",
        "so that he could made up the prayer that he had missed.",
        "Allah’s mercy and blessings be upon him, too.",
        "Peace be upon the Commander of the Faithful.",
        "Peace be upon the chief of the Prophets’ successors.",
        "Peace be upon the example of the pious ones.",
        "Peace be upon the inheritor of the Prophets’ knowledge.",
        "Peace be upon the head of the religion.",
        "Peace be upon the shelter of the believers.",
        "Peace be upon the pattern of the veracious ones.",
        "Allah’s mercy and blessings be upon him, too.",
        "Peace be upon the argument of the upright ones.",
        "Peace be upon the father of the Immaculate Imams.",
        "Peace be upon the one whom was given [the sword of] Dhu’l-Faqar exclusively.",
        "Peace be upon the one who shall water his adherents from the Pond of the Chosen Prophet,",
        "may Allah’s blessings be upon him and his Household as long as there is night and day coming after one another.",
        "Peace be upon the Great News.",
        "Peace be upon the one about whom the following verse was revealed by Almighty Allah:",
        "“And, indeed, in the origin of the Book with Us, it is decided that `Ali is wise.”",
        "Peace be upon the straight path of Allah.",
        "Peace be upon the one whose characteristics are mentioned in the Torah, the Bible, and the Wise Qur'an.",
        "Allah’s mercy and blessings be upon him, too.",
        "INFO: You may then throw yourself on the tomb, kiss it, and say the following",
        "O trustee of Allah!",
        "O argument of Allah!",
        "O saint of Allah!",
        "O path to Allah!",
        "I, your servant and adherent, have visited you,",
        "resorted to you tomb,",
        "resided in your courtyard,",
        "sought nearness to Allah the Almighty and All-majestic in the name of you,",
        "and sought your intercession for me before Allah,",
        "I am visiting you so sincerely that I have deserted my friends for so",
        "and I have relied upon you after Almighty Allah.",
        "I bear witness that you are the Mountain Tur (mount of revelation),",
        "the Written Book,",
        "the outstretched fine parchment,",
        "and the swollen ocean of knowledge.",
        "O saint of Allah!",
        "Indeed, each visited person is expected to pay special attention to the one who visits and comes to him.",
        "I, your adherent, have resided in your courtyard,",
        "resorted to your holy precinct,",
        "and had recourse to your tomb,",
        "because I have full acquaintance with the great standing that you enjoy and the gear honor that you hold.",
        "My sins have overburdened my back",
        "and deprived me of sleep.",
        "Therefore, I can find no shelter, no haven,",
        "and no refuge to which I resort save Almighty Allah,",
        "my begging you to be my mediator to Him,",
        "and my seeking your intercession for me before Him.",
        "I am thus residing in your courtyard",
        "and you enjoy a great standing with Almighty Allah",
        "as well as an honorable position;",
        "therefore, (please) intercede for me before your Lord, O master!",
        "INFO: You may then kiss the tomb, turn your face towards the kiblah direction, and say the following supplicatory words",
        "O Allah, I do seek nearness to You,",
        "O most Hearing of all those who can hear!",
        "O most Seeing of all those who can see!",
        "O quickest in reckon!",
        "O most Generous of all those who are generous,",
        "(I seek nearness to You) in the name of Muhammad, the seal of the Prophets",
        "and Your Messengers to all created beings,",
        "and in the name of his brother and cousin,",
        "the hero and erudite,",
        "the manifestly knowledgeable,",
        "`Ali, the Commander of the Faithful,",
        "and (in the names of) al-Hasan and al-Husayn, the two martyred Imams,",
        "and (in the name of) `Ali ibn al-Husayn, the adornment of the worshippers,",
        "and (in the name of) Muhammad ibn `Ali, the one who split the knowledge of the old ages,",
        "and (in the name of) Ja`far ibn Muhammad, the purest among the veracious ones,",
        "and (in the name of) Musa ibn Ja`far, the manifestly suppressor (of rage) and the imprisoned by the oppressors,",
        "and (in the name of) `Ali ibn Musa, the pleased and trusted,",
        "and (in the name of) Muhammad ibn `Ali, the magnanimous and the epitome of the guided ones (to the true path),",
        "and (in the name of) `Ali ibn Muhammad, the upright, the veracious, and the master of worshippers,",
        "and (in the name of) al-Hasan ibn `Ali al-`Askari, the chief of the believers,",
        "and (in the name of) the Successor, the Argument, the Patron of the Affair, and the Demonstrator of Proofs,",
        "(I beseech You in the name of all these) to relieve the grievances that I experience,",
        "to save me from the evils of predetermined ordeals,",
        "and to release me from the hot-winded fire,",
        "(I beseech You) in the name of Your mercy, O most Merciful of all those who show mercy!",
        "INFO: Then, you may pray Almighty Allah to grant you your personal requests, bid farewell to the Imam (‘a), and leave."
    ]
}