{
    "id": "imam-mahdi-(ajtfs)---ziyarat-ale-yasin",
    "title": "Imam Mahdi (ajtfs) - Ziyarat Ale Yasin",
    "language": "en",
    "text": [
        "Peace be upon the Household of Yasin.",
        "Peace be upon you, O caller to Allah and interpreter of His Verses.",
        "Peace be upon you, O door to Allah and applier of His religion.",
        "Peace be upon you, O viceroy of Allah and backer of His right.",
        "Peace be upon you, O Argument of Allah and sign of His volition.",
        "Peace be upon you, O reciter of the Book of Allah and its interpreter.",
        "Peace be upon you at the hours of Your night and the two ends of Your day.",
        "Peace be upon you, O herald of Allah on His lands.",
        "Peace be upon you, O covenant of Allah that He has made and confirmed.",
        "Peace be upon you, O Promise of Allah that He has assured.",
        "Peace be upon you, O appointed pennon,",
        "poured knowledge,",
        "aid, and expansive mercy.",
        "This is verily a promise that shall never be belied.",
        "Peace be upon you whenever you rise (to undertake the mission).",
        "Peace be upon you whenever you sit.",
        "Peace be upon you whenever you recite and elucidate.",
        "Peace be upon you whenever you offer prayer and supplicate.",
        "Peace be upon you whenever you genuflect and prostrate (yourself for Allah).",
        "Peace be upon you whenever you profess Allah’s Godhead and profess His All-greatness.",
        "Peace be upon you whenever you praise Allah and implore for His forgiveness.",
        "Peace be upon you whenever you begin and end your day.",
        "Peace be upon you in the night when it draws a veil",
        "and the day when it shines in brightness.",
        "Peace be upon you, O entrusted leader.",
        "Peace be upon you, O favored and expected.",
        "Peace be upon you to the ultimate meaning of peace.",
        "I solicit you, O my master,",
        "to testify to me that I bear witness that there is no god but Allah;",
        "One and Only Lord and having no associate,",
        "and that Muhammad is His servant and messenger.",
        "There is no one more beloved by Allah than him and his household.",
        "And I solicit you, O my master, to testify to me that I bear witness",
        "that `Ali the Commander of the Faithful is His argument,",
        "al-Hasan is His argument,",
        "al-Husayn is His argument,",
        "`Ali the son of al-Husayn is His argument,",
        "Muhammad the son of `Ali is His argument,",
        "Ja`far the son of Muhammad is His argument,",
        "Musa the son of Ja`far is His argument,",
        "`Ali the son of Musa is His argument,",
        "Muhammad the son of `Ali is His argument,",
        "`Ali the son of Muhammad is His argument,",
        "and al-Hasan the son of `Ali is His argument.",
        "I also bear witness that you are verily the argument of Allah.",
        "You all are the first and the last.",
        "And (I bear witness) that your (promised) Return is undoubtedly true",
        "“On the day when its belief avails not a soul",
        "which theretofore believed not,",
        "nor in its belief earned good by works,”",
        "death is true,",
        "and Nakir and Nakir are true.",
        "And I bear witness that the Raising for death is true,",
        "the Resurrection is true,",
        "the Discriminating Bridge is true,",
        "the Watchtower is true,",
        "the Balance (of deeds) is true,",
        "the Gathering is true,",
        "the Reckoning is true,",
        "Paradise and Hell are true,",
        "and the promise of Paradise and the threat with Hell are true.",
        "O My master! Certainly wretched is he who opposes you",
        "and certainly happy is he who obeys you.",
        "So, testify to me all that which I have besought you to testify.",
        "I am verily an ally of you",
        "and denouncing your enemy.",
        "The truth is only that which you accept,",
        "the wrong is only that which you disallow,",
        "the good is only that which you enjoin,",
        "and the evil is only that which you forbid.",
        "My soul is thus believing in Allah;",
        "One and Only Lord and having no associate,",
        "and also in His Messenger, in the Commander of the Faithful,",
        "and in you all, O my master, from the beginning to the end.",
        "I have prepared myself to back you",
        "and my love is sincerely dedicated to you.",
        "Respond! Respond!"
    ]
}