{
    "id": "imam-hassan-al-askari-(as)",
    "language": "en",
    "text": [
        "Peace be upon you, O my Master",
        "Abu-Muhammad al-Hasan the son of `Ali,",
        "the guide and well-guided.",
        "Allah’s mercy and blessings be upon you.",
        "Peace be upon you, O Allah’s intimate servant and son of Allah’s intimate servants.",
        "Peace be upon you, O Allah’s decisive Argument and son of Allah’s decisive Arguments.",
        "Peace be upon you, O Allah’s elite and son of Allah’s elite ones.",
        "Peace be upon you, O Allah’s representative, son of Allah’s representatives, and father of His representative.",
        "Peace be upon you, O son of the Seal of the Prophets.",
        "Peace be upon you, O son of the chief of the Prophets’ successors.",
        "Peace be upon you, O son of the Commander of the Faithful.",
        "Peace be upon you, O son of the doyenne of all women of the world.",
        "Peace be upon you, O son of the guiding leaders.",
        "Peace be upon you, O son of the orthodox successors (of the Prophets.)",
        "Peace be upon you, O shelter of the pious ones.",
        "Peace be upon you, O leader of the winning party.",
        "Peace be upon you, O haven of the (true) believers.",
        "Peace be upon you, O relief of the aggrieved ones.",
        "Peace be upon you, O heir of the Prophets: the choice ones.",
        "Peace be upon you, O keeper of the knowledge of the successor of Allah’s Messenger.",
        "Peace be upon you, O he who invites to the judgment of Allah.",
        "Peace be upon you, O he who speaks with the Book of Allah.",
        "Peace be upon you, O prime Argument of all the arguments (of Allah.)",
        "Peace be upon you, O guide of all nations.",
        "Peace be upon you, O source of all bounties.",
        "Peace be upon you, O store of knowledge.",
        "Peace be upon you, O ark of forbearance.",
        "Peace be upon you, O father of the Awaited Imam:",
        "whose claim is evident for the rational people,",
        "whose recognition is fixed in the most certain things,",
        "whom is concealed against the eyes of the oppressors,",
        "whom is hidden from the regimes of the faithless authorities,",
        "and through whom our Lord shall recover Islam over again after it will be effaced",
        "and He shall recover the Qur'an fresh over again after it will be eradicated.",
        "O master, I bear witness that you performed the prayers,",
        "defrayed the poor-rate,",
        "enjoined the right,",
        "forbade the wrong,",
        "called to the way of your Lord",
        "with wisdom and goodly exhortation,",
        "and worshipped Allah sincerely",
        "until death came upon you.",
        "I thus beseech Allah in the name of the rank that you enjoy with Him",
        "to accept my visit to you,",
        "receive my efforts with gratitude,",
        "respond to my prayers through you,",
        "and include me with the supporters of the truth,",
        "its followers, its adherents,",
        "its devotees, and its lovers.",
        "Peace and Allah’s mercy and blessings be upon you.",
        "O Allah, (please do) send blessings upon our master Muhammad and his Household",
        "and send blessings upon al-Hasan the son of `Ali",
        "who guides to Your religion",
        "and calls to Your way,",
        "who is the sign of true guidance,",
        "the lantern of true piety,",
        "the essence of rationality,",
        "the resource of reason,",
        "the raining cloud over mankind,",
        "the cloud of wisdom,",
        "the ocean of admonition,",
        "the heir of the Imams,",
        "the witness over the (Muslim) community,",
        "the sinless, the well-mannered,",
        "the virtuous, the favorable (by Allah),",
        "the purified against filth,",
        "and the one whom You have given the knowledge of the (Holy) Book in inheritance,",
        "You have inspired with clear judgment,",
        "You have appointed as the leading sign for those who follow the direction You have decided,",
        "You have decided the obedience to him to be attached to the obedience to You,",
        "and You have imposed the love for him upon all Your creatures.",
        "O Allah, as he always turned to You with excellent sincerity in Your Oneness,",
        "argued and defeated those who anthropomorphized You,",
        "and defended those who faithfully believed in You;",
        "so, O my Lord, (please) pour down on him Your blessings",
        "due to which he joins the rank of those who behave humbly toward You",
        "and due to which he surmounts in Paradise",
        "to the rank of his forefather the Seal of the Prophets.",
        "And (please do) convey to him greetings and compliments from us,",
        "grant us from You, on account of our loyalty to him,",
        "favor and benevolence",
        "and also grant us forgiveness and gratification,",
        "for You are most certainly the Lord of enormous favor",
        "and huge bliss."
    ],
    "title": "Imam Hassan Al Askari (as)"
}