{
    "id": "imam-ali-naqi-al-hadi-(as)",
    "title": "Imam Ali Naqi Al Hadi (as)",
    "language": "en",
    "text": [
        "INFO: At the entrance",
        "May I enter, O Prophet of Allah?",
        "May I enter, O Commander of the Faithful?",
        "May I enter, O Fatimah the luminous",
        "and the doyenne of the women of the world?",
        "May I enter, O my master al-Hasan the son of Ali?",
        "May I enter, O my master al-Husayn the son of Ali?",
        "May I enter, O my master Ali the son of al-Husayn?",
        "May I enter, O my master Muhammad the son of Ali?",
        "May I enter, O my master Ja`far the son of Muhammad?",
        "May I enter, O my master Musa the son of Ja`far?",
        "May I enter, O my master Ali the son of Musa?",
        "May I enter, O my master Muhammad the son of Ali?",
        "May I enter, O my master Abul-Hasan Ali the son of Muhammad?",
        "May I enter, O my master Abu-Muhammad al-Hasan the son of Ali?",
        "May I enter, O angels of Allah",
        "whom are assigned to manage this holy sanctuary?",
        "DESC: You may then enter the holy shrine preceding your right foot to the left.",
        "DESC: Go to the tomb of Imam Abul-Hasan al-Hadi (as), directing your face towards the tomb and your back towards the kiblah direction,",
        "INFO: you may repeat one hundred times",
        "Allah is the Most Great.",
        "INFO: You may then say the following",
        "Peace be upon you, O Abul-Hasan",
        "Ali the son of Muhammad,",
        "the pious, right-directing,",
        "and brightly shining light.",
        "Allahs mercy and blessings be upon you.",
        "Peace be upon you, O sincerely attached friend of Allah.",
        "Peace be upon you, O confidant of Allah.",
        "Peace be upon you, O rope of Allah.",
        "Peace be upon you, O household of Allah.",
        "Peace be upon you, O select of Allah.",
        "Peace be upon you, O choice of Allah.",
        "Peace be upon you, O trustee of Allah.",
        "Peace be upon you, O proof of Allah.",
        "Peace be upon you, O most-beloved by Allah.",
        "Peace be upon you, O light of the lights.",
        "Peace be upon you, O pride of the virtuous ones.",
        "Peace be upon you, O descendant of the upright ones.",
        "Peace be upon you, O essence of the purified ones.",
        "Peace be upon you, O argument of the All-beneficent God.",
        "Peace be upon you, O essence of the true faith.",
        "Peace be upon you, O master of the believers.",
        "Peace be upon you, O guardian of the righteous ones.",
        "Peace be upon you, O symbol of true guidance.",
        "Peace be upon you, O ally of piety.",
        "Peace be upon you, O mainstay of the religion.",
        "Peace be upon you, O son of the seal of the Prophets.",
        "Peace be upon you, O son of the chief of the Prophets successors.",
        "Peace be upon you, O son of Fatimah the Luminous",
        "and the doyenne of the women of the world.",
        "Peace be upon you, O faithful trustee.",
        "Peace be upon you, O favorite epitome.",
        "Peace be upon you, O ascetic and pious.",
        "Peace be upon you, O decisive argument against all creatures.",
        "Peace be upon you, O succeeding of the Qur'an.",
        "Peace be upon you, O distinguishing between the lawful and the unlawful.",
        "Peace be upon you, O sincere saint.",
        "Peace be upon you, O evident course.",
        "Peace be upon you, O bright star.",
        "I bear witness, O my master Abul-Hasan,",
        "that you are verily the decisive argument of Allah against His creatures,",
        "His representative among His created beings,",
        "His trusted administrator in His lands,",
        "and His witness over His servants.",
        "I also bear witness that you are verily the word of piety,",
        "the door to true guidance,",
        "the Firmest Handle,",
        "and the evident proof against those who are on the earth",
        "and those who are beneath the layers of the soil.",
        "I bear witness that you are purified from sins,",
        "cleaned against defects,",
        "bestowed with the honor of Allah,",
        "endued with the proof of Allah,",
        "granted the Word of Allah,",
        "and the stronghold to whom the servants (of Allah) resort",
        "and by whom the lands are revived.",
        "I bear witness, O my master,",
        "that I have faith in and I submit to  you, your forefathers and your sons,",
        "I follow all of you in my personal affairs,",
        "in my religious performance,",
        "in the seals of my deed,",
        "and in my return and final place.",
        "I do show loyalty to your loyalists,",
        "I show enmity towards your enemies,",
        "I believe in all of the invisible and the visible,",
        "and the first and the last of you.",
        "May Allah accept my father and mother as ransoms for you.",
        "Peace and Allahs mercy and blessings be upon you.",
        "INFO: You may then kiss the tomb and place your right and then left cheeks on it and say the following words:",
        "O Allah, (please do) send blessings upon Muhammad and the Household of Muhammad",
        "and send blessings upon Your faithful demonstrator,",
        "Your sagacious representative,",
        "Your well-pleased trustee,",
        "Your sincerely attached guide,",
        "Your Right Path,",
        "the most important approach,",
        "the just and equitable course,",
        "the light of the faithful believers hearts,",
        "the friend of the pious ones,",
        "and the comrade of the sincere.",
        "O Allah, (please do) send blessings upon our Master Muhammad and upon his Household",
        "and send blessings upon Ali the son of Muhammad,",
        "the rightly-directing, the infallible guide,",
        "the free from defects,",
        "who, putting hope in You, kept himself aloof from temptations,",
        "who was tried (by You) through seditious matters,",
        "who was tested (by You) through tribulations,",
        "who was examined (by You) through acting excellently towards misfortunes,",
        "and through steadfastness against complaining;",
        "(he is) the spiritual guide of Your servants,",
        "the blessing for Your lands,",
        "the destination of Your mercy,",
        "the hoarder of Your wisdom,",
        "the leader to Your Paradise,",
        "the all-knowledgeable among Your created beings,",
        "the true guide of Your creatures,",
        "whom You pleased, preferred,",
        "selected to take the place of Your Prophet among his people,",
        "and bounded with the guardianship of his laws.",
        "So, he accomplished the onerous task of representation (of the Prophet),",
        "carrying it perfectly,",
        "and undertaking the responsibility of bearing it.",
        "He neither slipped in any problematic action",
        "nor did he fail to solve any complexity.",
        "Rather, he relieved all agonies,",
        "sealed the loopholes,",
        "and fulfilled the required.",
        "O Allah, just as You made him a source of delight for Your Prophet,",
        "so also (please) raise him to the most elevated position,",
        "give him the most fitting reward that suits him,",
        "bless him,",
        "convey our greetings and salutations to him,",
        "and give us, on account of our love for him, from You bounties, favors,",
        "amnesty, and approval.",
        "Verily, You are the Lord of superabundant favors."
    ]
}