{
    "id": "imam-mahdi-(ajtfs)---for-friday",
    "language": "en",
    "text": [
        "Peace be upon you, O argument of Allah in His lands!",
        "Peace be upon you, O sight of Allah on His creatures!",
        "Peace be upon you, O light of Allah",
        "by which those who have been guided [to the true guidance] are guided",
        "and by which the believers are relieved!",
        "Peace be upon you, O polite and fearful!",
        "Peace be upon you, O sincere patron!",
        "Peace be upon you, O ark of salvation!",
        "Peace be upon you, O essence of life!",
        "Peace be upon you.",
        "May Allah send blessings to you",
        "and upon your Household,",
        "the pure and immaculate.",
        "Peace be upon you.",
        "May Allah hasten that which He has promised you;",
        "namely, victory and prevalence of your authority.",
        "Peace be upon you, O my master.",
        "I am a servant of you",
        "and I recognize the first and the last of your affair.",
        "I seek nearness to Allah, the Exalted, through your Household and you",
        "and I am expecting your advent and the prevalence of the truth at your hands.",
        "And I beseech Allah to send blessings to Muhammad and the Household of Muhammad,",
        "and to include me with those who are expecting you,",
        "those who follow you and support you against your enemies,",
        "and those who will be martyred in front of you in the group of your loyalists.",
        "O my master, O Patron of the Age!",
        "May Allah’s blessings be upon you",
        "and upon your Household.",
        "Today is Friday,",
        "which is your day on which your advent is expected",
        "to bring about relief to the believers at your hands,",
        "and killing of the disbelievers with your sword.",
        "On this day, O my master, I am your guest and in your vicinity",
        "and you, my master, are generous and the descendant of the generous people,",
        "and you are commanded to receive your guests and neighbors hospitably;",
        "so, receive me as your guest and neighbor.",
        "May Allah’s blessings be upon you",
        "and upon your Household, the immaculate."
    ]
}