{
    "id": "imam-ali-(as)---27th-rajab",
    "title": "Imam Ali (as) - 27th Rajab",
    "language": "en",
    "text": [
        "INFO: When you intend to visit the holy shrine of Imam `Ali Amir al-Mu'minin (peace be upon him) on the Divine Mission Day or the night before it, you may stop at the gate of the holy dome, facing the holy tomb, and say the following",
        "Peace be upon you, O inheritor of Adam the vicegerent of Allah.",
        "Peace be upon you, O inheritor of Noah the choice of Allah.",
        "Peace be upon you, O inheritor of Abraham the intimate friend of Allah.",
        "Peace be upon you, O inheritor of Moses the spoken by Allah.",
        "Peace be upon you, O inheritor of Jesus the spirit of Allah.",
        "Peace be upon you, O inheritor of Muhammad the chief of Allah’s Messengers.",
        "Peace be upon you, O commander of the faithful.",
        "Peace be upon you, O epitome of the pious ones.",
        "Peace be upon you, O chief of the Prophets’ successors.",
        "Peace be upon you, O successor of the Messenger of the Lord of the worlds.",
        "Peace be upon you, O inheritor of the knowledge of the past and the coming generations.",
        "Peace be upon you, O Great News.",
        "Peace be upon you, O Straight Path.",
        "Peace be upon you, O noble, refined one.",
        "Peace be upon you, O pious successor (of the Prophet).",
        "Peace be upon you, O well-pleased, pure one.",
        "Peace be upon you, O shining full moon.",
        "Peace be upon you, O grandest veracious one.",
        "Peace be upon you, O greatest distinguisher (between the right and the wrong).",
        "Peace be upon you, O glowing lantern.",
        "Peace be upon you, O leader to the true guidance.",
        "Peace be upon you, O pattern of piety.",
        "Peace be upon you, O grand argument of Allah.",
        "Peace be upon you, O select and elite of Allah,",
        "trustee and choice of Allah,",
        "door to and argument of Allah,",
        "source and secret of Allah’s judgment,",
        "guardian and keeper of Allah’s knowledge,",
        "and envoy of Allah among His creatures.",
        "I bear witness that you performed the prayers,",
        "paid the zakat,",
        "enjoined the right,",
        "forbade the wrong,",
        "followed the Messenger,",
        "recited the Book as exactly as it must be recited,",
        "conveyed the messages of Allah,",
        "fulfilled your covenant with Allah,",
        "the Words of Allah were accomplished by you,",
        "strove in Allah’s way in the best manner,",
        "advised for the sake of Allah and for the sake of His Messenger—peace be upon him and his Household,",
        "and sacrificed yourself with steadfastness, seeking Allah’s reward,",
        "struggling for the defense of Allah’s religion,",
        "protecting Allah’s Messenger—peace be upon him and his Household,",
        "seeking for that which is with Allah,",
        "and desiring for that which Allah has promised.",
        "You also sealed your life as martyr,",
        "a witness, and witnessed;",
        "so, may Allah reward you",
        "on behalf of His Messenger, Islam, and the people of Islam",
        "with the most favorite reward, for you are veracious.",
        "I bear witness that you were the first to embrace Islam,",
        "the most sincere in faith,",
        "the most confident,",
        "and you were the most Allah-fearing,",
        "the most steadfast (against ordeals for the sake of Islam),",
        "the most watchful for Allah’s Messenger, peace be upon him and his Household,",
        "endowed with the most favorable merits,",
        "the foremost of everyone else in everything,",
        "the owner of the most elevated rank,",
        "the owner of the most honorable position,",
        "and the most respected (by Almighty Allah and His Messenger).",
        "Thus, you became stronger when they became weak",
        "and you abode by the course of Allah’s Messenger, peace be upon him and his Household.",
        "I also bear witness that you were the true vicegerent of him (i.e. the Holy Prophet);",
        "no one could ever compete with you in this position in spite of the existence of hypocrites,",
        "the despise of the unbelievers,",
        "and the malice of the wicked.",
        "You also managed the matters when they failed to do so,",
        "you spoke (the truth) when they stammered,",
        "and you carried on with the light of Allah when they stopped.",
        "Hence, he who follows you has actually been led to the true guidance.",
        "You were the first to speak,",
        "the firmest in refuting the rivals,",
        "the most eloquent of them,",
        "the most apposite in opinions,",
        "the most courageous,",
        "the most confident of them,",
        "the best of them in deeds,",
        "and the most learned in affairs.",
        "For the believers, you were merciful father,",
        "and they were thus your dependants;",
        "so, you carried the burdens that they were too weak to carry,",
        "preserved that which they forfeited,",
        "conserved that which they neglected,",
        "prepared yourself for facing that which they were too coward to face,",
        "advanced when they were dismayed,",
        "and acted steadfastly when they became anxious.",
        "You were thus incessant torment on the unbelievers,",
        "and you were also rude and furious (on them).",
        "You rained (with mercy) on the believers, and you were fertile and source of knowledge for them.",
        "Your argument was never weak,",
        "your heart never deviated,",
        "your sagacity was never feeble,",
        "and your determination never cowered.",
        "You were as firm as mountain, since storms could never displace you",
        "and misfortunes could never move you.",
        "You were as exactly as described by Allah’s Messenger—peace be upon him and his Household—who said about you",
        "that you are strong in your body,",
        "modest in yourself,",
        "great in the view of Allah,",
        "imposing in the earth,",
        "and lofty in the heavens.",
        "None could ever find fault with you,",
        "none could ever speak evil of you,",
        "you never desired for any of the created beings,",
        "and you were never lenient (unfairly) to anyone.",
        "The weak, humble one was strong and mighty in your view until you give him back his right,",
        "and the strong, mighty one was weak in your view until you take the others’ rights from him.",
        "The near and the remote were equal in your view.",
        "Your habit was to be true, honest, and kind,",
        "your words were ruling and determination,",
        "your custom was forbearance and fortitude,",
        "and your view was knowledge and firmness.",
        "At your hands, the religion became even,",
        "the difficult became easy,",
        "the fires were extinguished,",
        "the faith became strong,",
        "Islam became steady,",
        "and the calamity of losing you undermined all people.",
        "Surely, we are Allah's and to Him we shall surely return.",
        "Curse of Allah be upon him who slew you,",
        "curse of Allah be upon him who mutinied against you,",
        "curse of Allah be upon him who forged lies against you,",
        "curse of Allah be upon him who wronged you and usurped your right,",
        "and curse of Allah be upon him who, when was informed about this, was pleased with it.",
        "Verily, we disavow all those before Allah.",
        "Curse of Allah be upon the group that disagreed with you,",
        "denied your (Divinely commissioned) leadership,",
        "aided each other against you, slew you,",
        "deviated from you, and disappointed you.",
        "All praise be to Allah, for Hellfire is the abode of those",
        "and evil the place to which they are brought.",
        "I bear witness for you, O Intimate servant of Allah and loyalist of Allah’s Messenger, peace be upon him and his Household, that you did convey and carry out (your mission).",
        "And I bear witness that you are the beloved of Allah and the door to Him,",
        "you are the Side of Allah and His Face from which one can come to Allah,",
        "you are Allah’s way,",
        "you are Allah’s servant,",
        "and you are the brother of His Messenger, peace be upon him and his Household.",
        "I have thus come to visit you because you enjoy a magnificent position and standing with Allah and with His Messenger.",
        "So, I seek nearness to Allah through my visit to you",
        "and I desire that you will intercede for me.",
        "Through your intercession for me, I hope for redemption of myself,",
        "I seek refuge with you against Hellfire,",
        "I am fleeing from my sins that I have overburdened myself with them,",
        "and I resort to you in the hope of my Lord’s mercy.",
        "I have come to you, O my master, seeking your intercession for me before Allah",
        "and seeking nearness to Him through you so that He may settle my needs;",
        "so, (please) intercede for me, O Commander of the Faithful.",
        "Verily, I am the slave of Allah and your servant and visitor,",
        "and you enjoy a distinguished position with Allah,",
        "a great rank,",
        "a big standing,",
        "and an admitted right of intercession.",
        "O Allah, (please do) send blessings upon Muhammad and the Household of Muhammad",
        "and send blessings upon Your servant, Your most faithful trustee,",
        "Your firmest handle,",
        "Your highest Hand,",
        "Your excellent Word,",
        "Your argument on the people,",
        "Your grandest veracious one,",
        "the chief of the Prophets’ successors,",
        "the reliance of the saints,",
        "the support of the elite ones,",
        "the commander of the faithful,",
        "the leader of the pious ones,",
        "the example of the veracious ones,",
        "the pattern of the righteous ones,",
        "the one protected against flaws,",
        "the one saved from defects,",
        "the one cleared from faults,",
        "the one purified from doubts,",
        "the brother of Your Prophet,",
        "the successor of Your Messenger,",
        "the one who replaced him when he spent that night instead of him,",
        "the one who sacrificed his soul for him,",
        "the one who always relieved him in harsh situations,",
        "and the one whom You chose to be the sword of his (i.e. the Prophet) Prophethood,",
        "the miracle of his (Divine) mission,",
        "the lucid indication of his arguments,",
        "the bearer of his pennon,",
        "the protector of his soul,",
        "the guide of his nation,",
        "the power of his might,",
        "the crown of his head,",
        "the door to his victory,",
        "and the key to his triumph,",
        "until he defeated the armies of polytheism by Your aid,",
        "terminated the warriors of atheism by Your permission,",
        "exerted all efforts to win the pleasure of You and Your Messenger,",
        "devoted all of his efforts to the obedience to him,",
        "and made of himself armor to protect him from any misfortune,",
        "until the soul of the Prophet, peace be upon him and his Household, departed his body while his face was in the hand of `Ali,",
        "who thus felt its coldness,",
        "and rubbed his face therewith.",
        "And Your angels helped him bathe and prepare his body for burial.",
        "He then performed [the ritual] prayer for him, buried his body,",
        "settled his debts,",
        "fulfilled his promises,",
        "made his covenants,",
        "followed his example,",
        "and abode by his will.",
        "When he could find supporters, he undertook the burdens of the position of leadership (caliphate)",
        "and assumed the loads of Imamate.",
        "He thus hoisted the flag of true guidance among Your servants,",
        "spread the dress of security in Your lands,",
        "extended justice among Your creatures,",
        "judged according to Your Book among your beings,",
        "executed the laws,",
        "suppressed unbelief,",
        "rectified the deviation,",
        "mollified the criticism,",
        "eradicated lethargy,",
        "blocked the gap,",
        "killed the preachers, the wrongdoers, and the apostates,",
        "kept on following the course and tradition of Allah’s Messenger, peace be upon him and his Household,",
        "kept on following his excellent pattern,",
        "kept on following his superb practice,",
        "he imitated his convention,",
        "held fast to his morale,",
        "and copied his way (of treating with matters).",
        "And he always noticed the Prophet’s deeds as if they were before his eyes;",
        "he thus ordered Your servants to copy these deeds",
        "and invited them to imitate them",
        "until his white beard was dyed with the blood of his head.",
        "O Allah, as he never preferred a dubious matter to a certain one for the sake of obeying You",
        "and never associated any one with You even for a winking of an eye,",
        "please send upon him growing and increasing blessings",
        "due to which he may join the position of Prophethood in Your Paradise,",
        "and (please) convey our greetings and compliments to him",
        "and, on account of our allegiance to his leadership, please grant us from You favor, kindness,",
        "forgiveness, and pleasure.",
        "You are verily the Lord of enormous favor.",
        "[please do that] in the name of Your mercy, O most merciful of all those who show mercy.",
        "INFO: Prayer of Ziyarah",
        "DESC: You may then put your right and then left cheeks on the tomb, turn to the kiblah direction, offer the Prayer of Ziyarah, and supplicate for anything you want.",
        "INFO: Tasbih al-Zahra (sa)",
        "DESC: Then, you may recite the (famous) Tasbih al-Zahra (sa)",
        "INFO: Then, say the following",
        "O Allah, You have conveyed to me glad tidings",
        "through Your Prophet and Messenger",
        "Muhammad, Your peace be upon him and his Household,",
        "as You said, “And give good news to those who believe that theirs is a footing of firmness with their Lord.”",
        "O Allah, I indeed believe in all Your Prophets and Messengers, Your blessings be upon them.",
        "So, (please) do not cause me, after my recognition of them, to be in a situation",
        "due to which You expose me in the presence of the Witnesses;",
        "rather, (please) include me with them and make me die while I give them credence.",
        "O Allah, You have also bestowed upon them exclusive honor from You",
        "and You have ordered me to follow them.",
        "O Allah, I am Your slave and visitor,",
        "seeking Your nearness through visiting the brother of Your Messenger.",
        "Indeed, each visited person is expected to pay attention to his duty towards the one who visits and comes to him.",
        "And You are the Best One to Whom one may come",
        "and You are the most Generous One to be visited;",
        "I therefore beseech You, O Allah, O All-beneficent, O All-merciful,",
        "O All-magnanimous, O All-glorious,",
        "O One, O Besought of all,",
        "O He Who never begets nor is He begotten,",
        "and the like of Whom is none,",
        "O He Who has not betaken wife or child,",
        "(I beseech You) to send blessings upon Muhammad and the Household of Muhammad,",
        "to choose the gift that You present to me on account of my visiting Your Messenger’s brother",
        "to be release of me from Hellfire,",
        "to include me with those who strive with one another in hastening to good deeds",
        "and those who call on You with love and reverence,",
        "and to make me of those who are humble before You.",
        "O Allah, You have indeed conferred upon me with the favor of visiting my master `Ali the son of Abu-Talib",
        "and with the favor of my being loyal to his (Divinely commissioned) leadership and recognition of him;",
        "so, (please) make me of those whom You give victory and whom You choose to triumph through them.",
        "And (please) bestow me with the favor of making me support Your religion.",
        "O Allah, (please) include me with the adherents of him and cause me to die following his doctrine.",
        "O Allah, (please) cause me to deserve mercy, pleasure,",
        "forgiveness, favor,",
        "and sustenance that is growing, legally gotten, and pleasant,",
        "(and make it) suitable to Your favoring, O most merciful of all those who show mercy!",
        "All praise be to Allah the Lord of the worlds."
    ]
}