{
    "id": "imam-ali-(as)---at-najaf-shrine-1",
    "language": "en",
    "text": [
        "INFO: When you face and are opposite to the holy tomb, stop there before reaching the tomb, and say the following",
        "Peace of Allah be upon Muhammad the Messenger of Allah,",
        "the trustee of Allah over His Revelations, Messages,",
        "and determined commandments,",
        "the core of the Divine Inspiration and Revelation,",
        "who sealed the previous Messages,",
        "paved the way to the coming blessings,",
        "who prevails over all that,",
        "the witness over the creatures,",
        "and the luminous torch.",
        "Peace and Allah’s mercy and blessings be upon him.",
        "O Allah, (please do) send blessings upon Muhammad and his Household, the oppressed ones,",
        "with the best, most perfect, most exalted,",
        "and most honored blessings that You have ever showed on any",
        "of Your Prophets, Messengers, and Chosen servants.",
        "O Allah, (please do) send blessings upon the Commander of the Faithful,",
        "Your servant, the best of Your creatures after Your Prophet,",
        "the brother of Your Messenger,",
        "the Successor of Your most-beloved one,",
        "whom You have selected from among Your beings,",
        "the guide to those whom You sent with Your messages,",
        "the establisher of the true religion by means of Your justice,",
        "and the decisive judge among Your beings.",
        "Peace and Allah’s mercy and blessings be upon him.",
        "O Allah, (please do) send blessings upon the Imams from his offspring,",
        "(who are) the holders of Your commandments after him,",
        "and the immaculate ones whom You have accepted as supporters of Your religion,",
        "keepers of Your secret,",
        "witnesses over Your created beings,",
        "and signs (of example) for Your servants.",
        "May Your blessings be upon them all.",
        "Peace be upon the Commander of the Faithful,",
        "`Ali the son of Abu-Talib,",
        "the successor of Allah’s Messenger, his representative,",
        "who managed his affairs after him,",
        "and the master of all Prophet’s successors. May Allah’s mercy and blessings be upon him, too.",
        "Peace be upon Fatimah, the daughter of Allah’s Messenger,",
        "may Allah’s blessings be upon him,",
        "(she is) the doyenne of all the women of this world.",
        "Peace be upon al-Hasan and al-Husayn,",
        "the chiefs of the youth of Paradise among all beings.",
        "Peace be upon the Guiding Imams.",
        "Peace be upon the Prophets and the Messengers.",
        "Peace be upon the Imams whom are entrusted (with the religion by Allah).",
        "Peace be upon the elite creatures of Allah.",
        "Peace be upon those who understand by tokens.",
        "Peace be upon the faithful believers",
        "who have carried out His orders,",
        "supported the saints of Allah,",
        "and have feared for their fear.",
        "Peace be upon the Favorite Angels.",
        "Peace be upon us and upon the righteous servants of Allah.",
        "INFO: You may then draw near the tomb, face it, make the kiblah direction behind you, and say the following words",
        "Peace be upon you, O Commander of the Faithful.",
        "Peace be upon you, O beloved by Allah.",
        "Peace be upon you, O choice of Allah.",
        "Peace be upon you, O intimate servant of Allah.",
        "Peace be upon you, O Argument of Allah (against His creatures).",
        "Peace be upon you, O leader of true guidance.",
        "Peace be upon you, O sign of piety.",
        "Peace be upon you, O successor,",
        "religious, pious,",
        "pure, and loyal.",
        "Peace be upon you, O father of al-Hasan and al-Husayn.",
        "Peace be upon you, O pillar of the religion.",
        "Peace be upon you, O chief of the successors (of Prophets),",
        "trustee of the Lord of the worlds,",
        "judge on the Judgment Day,",
        "best of the believers,",
        "chief of the most truthful ones,",
        "elite of the Prophets’ lineage,",
        "door to the wisdom of the Lord of the worlds,",
        "keeper of His Revelation,",
        "container of His knowledge,",
        "advisor of His Prophet’s people,",
        "next to His Messenger,",
        "who sacrificed himself for him (i.e. for the Messenger),",
        "speaker with his arguments,",
        "inviter to his principles,",
        "and steadfast on his instructions.",
        "O Allah, I do bear witness",
        "that he carried out the mission conveyed to him by Your Messenger,",
        "achieved what he was ordered to keep,",
        "kept what has been stored with him,",
        "deemed lawful that which You deem lawful,",
        "deemed unlawful that which You deem unlawful,",
        "put into practice Your laws,",
        "strove against the contraveners for Your sake,",
        "against the wrongdoers according to Your laws,",
        "and against the apostates from Your decree,",
        "did all that with steadfastness, expecting Your reward,",
        "and no blame of any blamer could ever influence him.",
        "O Allah, (please do) send blessings upon him with the best way",
        "You have ever blessed any of Your intimate servants, Your choicest ones,",
        "and Your Prophet’s successors.",
        "O Allah, this is the tomb of Your representative",
        "the obedience to whom has been made by You incumbent (upon us),",
        "the loyalty to whom has been made by You in the necks of Your servants,",
        "and (it is the tomb of) Your viceroy through whom You will give and take,",
        "and through whom You will reward and punish.",
        "I have directed to him, seeking for what You have prepared for Your intimate servants.",
        "So, (I beseech You) in the name of his eminent standing with You,",
        "in the name of his great status in Your view,",
        "and in the name of the closeness of his position to You,",
        "to bless Muhammad and the Household of Muhammad",
        "and to do to me that which is expected from You,",
        "for You are verily worthy of honoring and generous granting.",
        "Peace be upon you, O my master,",
        "and upon your partners in the place, (Prophet) Adam and (Prophet) Noah.",
        "May Allah’s mercy and blessings be upon you, too.",
        "INFO: You may then kiss the tomb from the head’s side and say the following words",
        "O my master, to You is my coming",
        "and in your name do I beseech my Lord",
        "so that I may achieve my goal.",
        "I bear witness that he who beseeches (Allah) in your name shall never be disappointed",
        "and he who implores (Allah) in your name, with full cognizance,",
        "shall never be rejected; rather, all his needs shall be settled.",
        "So, (please) be my interceder to Allah—",
        "my and your Lord—for purpose of settling my needs,",
        "making easy my affairs,",
        "relieving my depressions,",
        "forgiving my sins,",
        "expanding my sustenance sources,",
        "extending my lifetime,",
        "and granting me all my requests for the world to come as well as this world.",
        "O Allah, curse the killers of the Commander of the Faithful.",
        "O Allah, curse the killers of al-Hasan and al-Husayn.",
        "O Allah, curse the killers of the Imams,",
        "and subject them to such a painful chastisement",
        "that You have never subjected any of Your creatures to it,",
        "such an enormous chastisement that never ceases,",
        "nor comes to an end, nor reaches a deadline,",
        "for what they contended against Your authorities.",
        "And (please do) prepare for them such an intense torture",
        "that You have not decided for any of Your creatures.",
        "O Allah, (please do) impose upon the killers of Your Messenger’s supporters,",
        "the killers of the Commander of the Faithful,",
        "the killers of al-Hasan and al-Husayn,",
        "the killers of the supporters of al-Hasan and al-Husayn,",
        "and the killers of all those whom were killed because of their loyalty to the Household of Muhammad,",
        "a painful, cyclic punishment",
        "in the lowest class of Hellfire",
        "that the punishment shall not be lightened for them",
        "and they shall lay therein in utter despair and endless curse;",
        "they shall be hanging down their heads before their Lord",
        "after they shall find out with certainty regret and long-lasting disgrace,",
        "for they killed the members of the household of Your Prophets and Messengers",
        "and the righteous servants from their followers.",
        "O Allah, (do) curse them in the most concealed secrecy",
        "and in the most apparent openness,",
        "in Your lands and in Your heavens.",
        "O Allah, (please do) decide for me a truthful step with Your intimate servants",
        "and make me long for their shrines and their residing-places",
        "until You include me with them",
        "and make me among their followers in this world as well as the world to come.",
        "O most Merciful of all those who show mercy!",
        "INFO: You may then kiss the tomb, face the tomb of Imam al-Husayn ibn `Ali (as), make the kiblah direction seem to be between your shoulders, and say the following words",
        "Peace be upon you, O Abu-`Abdullah.",
        "Peace be upon you, O son of Allah’s Messenger.",
        "Peace be upon you, O son of the Commander of the Faithful.",
        "Peace be upon you, O son of Fatimah, the luminous lady,",
        "the doyenne of all women of the worlds.",
        "Peace be upon you, O father of the Imams—the guides and well-guided.",
        "Peace be upon you, O victim of the pouring tears.",
        "Peace be upon you, O man of the disastrous misfortune.",
        "Peace be upon you and upon your grandfather and father.",
        "Peace be upon you and upon your mother and brother.",
        "Peace be upon you and upon the Imams from your offspring and descendants.",
        "I bear witness that Allah has purified the soil (on which you fell down) through you,",
        "has made clear His Book through you,",
        "and has made you, your father, your grandfather,",
        "your brother, and your descendants examples for the owners of intellects.",
        "O son of the blessed, purified ones",
        "who recite (and apply) the Book utterly,",
        "I direct my greetings to you.",
        "May Allah make His peace and blessings to be upon you",
        "and may He make the hearts of some people yearn toward you.",
        "Disappointment shall never chase him who adheres to you and resorts to you.",
        "INFO: You may then move to the side of the feet and say the following words",
        "Peace be upon the father of the Imams,",
        "the intimate friend of Prophethood,",
        "and the marked, exclusively, by fraternity (with the Holy Prophet).",
        "Peace be upon the head of the religion and faith,",
        "and the word of the All-beneficent Lord.",
        "Peace be upon the Scale of the deeds",
        "the turner over of manners,",
        "the sword of the Lord of Majesty,",
        "and who supplies with the fresh water of Salsabil.",
        "Peace be upon the most righteous of the believers,",
        "the inheritor of the Prophet’s knowledge,",
        "and the judge on the Judgment Day.",
        "Peace be upon the tree of piety",
        "and the hearer of hidden and confidential speeches.",
        "Peace be upon Allah’s conclusive argument,",
        "His flowing boon,",
        "and His forceful punishment.",
        "Peace be upon the clear-cut path,",
        "the patent star,",
        "the advising leader,",
        "and the igniting firelock.",
        "May Allah’s mercy and blessings be upon him.",
        "INFO: You may then say the following",
        "O Allah, (please do) send blessings upon the Commander of the Faithful,",
        "`Ali the son of Abu-Talib",
        "the brother, ally,",
        "supporter, successor, and patron of Your Prophet,",
        "the store of his knowledge,",
        "the depot of his secrets,",
        "the door to his wisdom,",
        "the spokesman with his arguments,",
        "the caller to his code of law,",
        "his viceroy in his community,",
        "the reliever of agony from his face,",
        "the terminator of the infidels,",
        "the conqueror on the wicked ones,",
        "whom You have made, with regard to his position to Your Prophet,",
        "to occupy the same position that (Prophet) Aaron enjoyed with (Prophet) Moses.",
        "O Allah, (please do) give support to any one who supports him,",
        "be the enemy of every one who antagonizes him,",
        "give victory to any one who gives him his victory,",
        "disappoint every one who disappoints him,",
        "and lay curse on any one who incurs the hostility of him",
        "from the past and the coming generations.",
        "And (please do) bless him with the best blessings",
        "that You have ever poured on any of Your Prophet’s successors.",
        "O Lord of the worlds!"
    ],
    "title": "Imam Ali (as) - at Najaf Shrine 1"
}