{
    "id": "imam-ali-(as)---on-martyrdom-day",
    "language": "en",
    "text": [
        "May Allah have mercy upon you, O Abu’l-hasan.",
        "You were the first of all in accepting Islam and the most sincere of all in faith,",
        "And you were the firmest in conviction and the most Allah-fearing,",
        "And you were the most steadfast (against ordeals for the sake of Islam) and the most watchful for Allah’s Messenger—peace be upon him and his Household,",
        "And you were the most careful for his companions and you were endowed with the most favorable merits,",
        "And you were the foremost of everyone else in everything, and the owner of the most elevated rank,",
        "And you were the closest of them to Allah’s Messenger—peace be upon him and his Household,",
        "And you were the most similar to him in guidance, morals, manners, and deeds,",
        "And you were the owner of the most honorable position, and the most respected (by Almighty Allah and His Messenger).",
        "May Allah reward you on behalf of Islam, the His Messenger, and the Muslims with the best rewarding.",
        "You became stronger when his companions became weak,",
        "And you advanced when they surrendered,",
        "And you stood up (to face difficulties) when they became showed weak-heartedness,",
        "And you abode by the course of Allah’s Messenger—peace be upon him and his Household—as they were his companions,",
        "And you were truly his vicegerent.",
        "No one could ever compete with you or vie with you in this position",
        "In spite of the existence of hypocrites and the despise of the unbelievers,",
        "And the malice of the enviers and the disgrace of the wicked ones.",
        "You thus managed the matters when they failed to do so",
        "And you spoke (the truth) when they stammered,",
        "And you carried on with the light of Allah when they stopped.",
        "As they followed you, they were guided (to the true path),",
        "You voice was the lowest (out of politeness) and was the highest in supplication,",
        "And you were the least in speaking and the you were the most eloquent of them,",
        "And you were the most apposite in opinions and the most courageous,",
        "And you were the firmest in conviction, the best of them in deeds, and the most learned in questions.",
        "By Allah (I swear), you were the true leader of the religion first and last:",
        "You were thus the first (of the enduring ones) when the other people departed, and you were the last (in steadfastness) when they failed.",
        "For the believers, you were merciful father, as they were your dependants;",
        "So, you carried the burdens that they were too weak to carry,",
        "And you preserved that which they forfeited, and you conserved that which they neglected,",
        "And you prepared yourself for facing those who allied (against Islam) and you advanced when they were dismayed,",
        "And you resisted when they hurried (in absconding) and you achieved the goals for which they fought,",
        "And they tasted at your hands that which they had not expected.",
        "You were thus incessant and relentless torment on the unbelievers",
        "And you were support and shelter for the believers.",
        "Thus, I swear by Allah that you won its bliss and gained its reward,",
        "And you attained its merits and prevailed on its worth.",
        "Your argument was never weak and your heart never deviated,",
        "And your sagacity was never feeble, and your determination never cowered, and you never betrayed.",
        "You were as firm as mountain, as storms could never displace you,",
        "And you were as exactly as what was said about you: People felt secure under your government and in what was entrusted with you.",
        "You were also as exactly as what was said about you: modest in your body and strong in carrying out the orders of Allah,",
        "Humble in yourself and enjoying a great standing with Allah,",
        "Great in the earth and lofty in the view of the believers.",
        "None could ever find fault with you, and none could ever speak evil of you,",
        "And you never desired for anyone, And you were never lenient (unfairly) to anyone.",
        "The weak, humble one was strong and mighty in your view until you give him back his right,",
        "And the strong, mighty one was weak in your view until you take the others’ rights from him.",
        "The near and the remote were equal in your view.",
        "You habit was to be right, honest, and kind,",
        "And your words were ruling and determination,",
        "And your custom was forbearance and fortitude,",
        "And your view was knowledge and firmness in whatever you did.",
        "Through you, the right path was taken and the difficult was made easy,",
        "Fires were also extinguished by you and the religion became even at your hands, and Islam and the believers because mighty because of you,",
        "You thus advanced in great strides and stopped and curbed the wrongdoings of those who came after you.",
        "You are thus too lofty to be mourned and the calamity (of losing you) was so astounding for the inhabitants of the heavens,",
        "And this calamity undermined all people.",
        "Surely, we are Allah's and to Him we shall surely return.",
        "We succumb to Allah’s acts and to His matters do we submit.",
        "By Allah I swear, the calamity of losing you is the ever most catastrophic for the Muslims.",
        "You were haven, shelter, and unshakable fortress of the believers.",
        "And you were, at the same time, firm and furious on the opposing unbelievers.",
        "May Allah join you to His Prophet and may He never deprive us of the reward of our grief for you, and may He never mislead us after you."
    ],
    "title": "Imam Ali (as) - on Martyrdom Day"
}