{
    "id": "imam-ali-(as)---at-najaf-shrine-3",
    "title": "Imam Ali (as) - at Najaf Shrine 3",
    "language": "en",
    "text": [
        "DESC: Imam Muhammad al-Baqir (as): Accompanying my father, I went for visiting the tomb of my grandfather, Amir al-Mu'minin `Ali ibn Abi-Talib (as), in al-Najaf. My father stopped at the holy tomb, wept, and said the following",
        "Peace be upon the father of the Imams, the friend of the Prophethood,",
        "and the one exclusively granted the fraternity (of the Holy Prophet).",
        "Peace be upon the chief of true faith,",
        "the Scale of the deeds",
        "and the sword of the Lord of Majesty.",
        "Peace be upon the most righteous of the believers,",
        "the inheritor of the knowledge of the Prophets,",
        "and the judge on the Judgment Day.",
        "Peace be upon the Tree of Piety.",
        "Peace be upon Allah’s conclusive argument,",
        "His flowing boon,",
        "and His forceful punishment.",
        "Peace be upon the clear-cut path,",
        "the patent star,",
        "and the advising leader.",
        "May Allah’s mercy and blessings be upon him.",
        "DESC: My father (as) then added the following",
        "You are verily my means and my course to Allah.",
        "And I enjoy the right of my loyalty to you and my hoping for you.",
        "So, (please) be my intercessor before Allah—the Almighty and All-majestic—",
        "as regards the settlement of my request,",
        "which is the release of my neck from Hellfire.",
        "And (please) seal my current situation with success",
        "and with response to all that which I have asked for, out of His mercy and power.",
        "O Allah, (please do) grant me an utter intellect,",
        "sharp aptitude,",
        "pure heart,",
        "much deed,",
        "and fabulous courtesy,",
        "and make all that for my good",
        "and do not make it against me,",
        "[I beseech You] in the name of Your mercy, O most Merciful of all those who show mercy!"
    ]
}