{
    "id": "imam-ali-(as)---17th-rabiul-awwal",
    "language": "en",
    "text": [
        "DESC: There is high recommendation on visiting the holy tomb of Imam `Ali (peace be upon him) on occasions related to the Holy Prophet (peace be upon him and his family) such as his birthday & Besat.This is because of the firm connection between these two great individuals and because of the perfect union between these two personalities.",
        "INFO: When you stop at the door of peace (bab al-salam), which is the gate of the holy shrine, you may face the kiblah direction and repeat three times",
        "Allah is the Most Great.",
        "INFO: You may then say the following",
        "Peace be upon the Messenger of Allah.",
        "Peace be upon the elite select of Allah.",
        "Peace be upon the bearer of glad tidings, the warner (against Allah’s chastisement),",
        "and the shining lantern.",
        "Allah’s mercy and blessings be upon him.",
        "Peace be upon the pure, the immaculate.",
        "Peace be upon the luminous epitome.",
        "Peace be upon the one given victory and aid (by Almighty Allah).",
        "Peace be upon Abu’l-Qasim Muhammad.",
        "Allah’s mercy and blessings be upon him.",
        "Peace be upon the missioned Prophets of Allah",
        "and upon the righteous servants of Allah.",
        "Peace be upon the angels of Allah",
        "who surround this sanctuary",
        "and this tomb to which they are resorting.",
        "INFO: You may then approach the tomb and say the following",
        "Peace be upon you, O successor of the Prophets’ successors.",
        "Peace be upon you, O reliance of the pious ones.",
        "Peace be upon you, O best saint among all saints.",
        "Peace be upon you, O master of martyrs.",
        "Peace be upon you, O grandest sign of Allah.",
        "Peace be upon you, O fifth of the People of the Cloak.",
        "Peace be upon you, O leader of the white-forehead, pious group.",
        "Peace be upon you, O shelter of the saints.",
        "Peace be upon you, O adornment of the noble monotheists.",
        "Peace be upon you, O select of the best friends.",
        "Peace be upon you, O father of the trusted Imams.",
        "Peace be upon you, O director of the (Divine) pond and bearer of the Pennon.",
        "Peace be upon you, O decider of Paradise and Hellfire—the flaming.",
        "Peace be upon you, O one by whom Makkah and Mina have been honored.",
        "Peace be upon you, O ocean of knowledge and haven of the poor.",
        "Peace be upon you, O one who was born in the Ka`bah,",
        "married in the heavens to the Doyenne of Women;",
        "and the witnesses were the elite angels.",
        "Peace be upon you, O lantern of light.",
        "Peace be upon you, O one whom was exclusively awarded abundant favors by the Prophet.",
        "Peace be upon you, O one who replaced the Seal of the Prophets in his bed",
        "and protected him with his soul against the evil of the enemies.",
        "Peace be upon you, O one to whom the sun was returned",
        "and he thus became the match of Sham`un al-Safa (Simon the Zealot).",
        "Peace be upon you, O one in whose name and in the name of whose brother, Allah saved the Ark of Noah",
        "when the waves of water collided and clashed around it.",
        "Peace be upon you, O one in whose name and in the name of whose brother, Allah accepted the repentance of Adam after he had allowed himself to be seduced.",
        "Peace be upon you, O ark of redemption;",
        "he who embarks on it will have saved himself (from perdition),",
        "but he who leaves it will have perished.",
        "Peace be upon you, O he who spoke to a serpent and to a wolf in the desert.",
        "Peace be upon you, O commander of the faithful.",
        "Allah’s mercy and blessings be upon you.",
        "Peace be upon you, O argument of Allah against both those who disbelieved and those who believed.",
        "Peace be upon you, O chief of people of understanding.",
        "Peace be upon you, O essence of wisdom and clear judgment.",
        "Peace be upon you, O one having the knowledge of the Books.",
        "Peace be upon you, O criterion on the Judgment Day.",
        "Peace be upon you, O solver of all quarrels and spokesman of truth.",
        "Peace be upon you, O he who gave his ring as alms while being in the prayer niche.",
        "Peace be upon you, O he through whom Allah sufficed the believers",
        "in fighting on the Battle of al-Ahzab (the Allies).",
        "Peace be upon you, O he who worshipped Allah alone with sincerity and always turned to Him.",
        "Peace be upon you, O warrior of Khaybar and plucker of the gate (of the fortress).",
        "Peace be upon you, O one who, when the Best of Creatures (i.e. the Prophet) ordered him to spend that night at his place instead of him,",
        "submitted to death and responded.",
        "Peace be upon you, O he to whom is Tuba (bliss) and goodly return are decided.",
        "Allah’s mercy and blessings be upon you.",
        "Peace be upon you, O director of the safety of the religion and chief of the chiefs.",
        "Peace be upon you, O owner of miracles.",
        "Peace be upon you, O he about whose merits Surah al-`ªdiyat was revealed.",
        "Peace be upon you, O he whose name is written in the heavens on the canopies (of the Divine Throne).",
        "Peace be upon you, O manifester of marvels and signs.",
        "Peace be upon you, O commander in campaigns.",
        "Peace be upon you, O he who accounted the bygone and predicted the future.",
        "Peace be upon you, O speaker to a wolf in the desert.",
        "Peace be upon you, O reckoner of pebbles and expounder of problems.",
        "Peace be upon you, O he whose attacks in battlefields astonished the angels in the heavens.",
        "Peace be upon you, O he who offered something in charity when he talked confidentially with the Messenger.",
        "Peace be upon you, O father of the Imams, the virtuous masters.",
        "Allah’s mercy and blessings be upon you.",
        "Peace be upon you, O one coming immediately after the Messenger.",
        "Peace be upon you, O inheritor of the knowledge of the most favorable inherited being.",
        "Allah’s mercy and blessings be upon you.",
        "Peace be upon you, O chief of the Prophets’ successors.",
        "Peace be upon you, O head of the pious ones.",
        "Peace be upon you, O aid of the aggrieved ones.",
        "Peace be upon you, O shelter of the believers.",
        "Peace be upon you, O provider of evidences.",
        "Peace be upon you, O Ta-Ha and Ya-Sin.",
        "Peace be upon you, O firm rope (taking) to Allah.",
        "Peace be upon you, O he who gave his ring as alms, while he was offering prayer, to a poor.",
        "Peace be upon you, O he who removed the rock from the open of the well,",
        "and he thus caused the pure water to flow.",
        "Peace be upon you, O observing eye of Allah,",
        "His extended Hand,",
        "and His spokesman who conveys His affairs to all of His created beings.",
        "Peace be upon you, O heir of the Prophets’ knowledge,",
        "keeper of the knowledge of the past and coming generations,",
        "bearer of the Pennon of Praise (liwa’ al-hamd),",
        "and one who shall serve his adherents with water from the (Divine) Pond of the Seal of the Prophets.",
        "Peace be upon you, O head of the religion,",
        "leader of the white-forehead group,",
        "and father of the well-pleased Imams.",
        "Allah’s mercy and blessings be upon you.",
        "Peace be upon the pleased name of Allah,",
        "His radiant Face,",
        "His strong Side,",
        "and His straight Path.",
        "Peace be upon the pious Imam,",
        "the select and elite.",
        "Peace be upon the brightly shining star.",
        "Peace be upon the Imam Abu’l-Hasan `Ali.",
        "Allah’s mercy and blessings be upon him.",
        "Peace be upon the leaders to true guidance,",
        "the lanterns in murk,",
        "the epitomes of piety,",
        "the lights of true guidance,",
        "and owners of thought,",
        "the havens of people,",
        "the firmest handles,",
        "and the arguments against the inhabitants of this world.",
        "Allah’s mercy and blessings be upon them.",
        "Peace be upon the light of lights,",
        "the argument of the Omnipotent Lord,",
        "the father of the immaculate Imams,",
        "the decider of Paradise and Hellfire,",
        "the narrator of past events,",
        "the destroyer of the unbelievers,",
        "and the savior of the faithful Shi`ah from their grand sins.",
        "Peace be upon the one married to the pure, pious daughter of the Chosen Prophet,",
        "the one born in the House of curtains,",
        "the one married in the heavens to the reverent, immaculate,",
        "content, and well-pleased lady—",
        "the mother of the immaculate Imams.",
        "Allah’s mercy and blessings be upon him.",
        "Peace be upon the Great News,",
        "about whom they differ,",
        "before whom they shall be stood,",
        "and about whom they shall be asked.",
        "Peace be upon the most shining light of Allah",
        "and the most luminous brightness of Him.",
        "Allah’s mercy and blessings be upon him.",
        "Peace be upon you, O Allah’s friend and argument",
        "and Allah’s select and choice.",
        "I bear witness that you, being Allah’s friend and argument,",
        "strove in Allah’s way in the most appropriate way,",
        "followed the course of Allah’s Messenger, peace be upon him and his Household,",
        "enjoined that which Allah has deemed lawful,",
        "forbade that which Allah has deemed unlawful,",
        "carried out His laws,",
        "offered the prayers,",
        "paid the zakat,",
        "enjoined the right,",
        "forbade the wrong,",
        "and strove in Allah’s way with steadfastness and well-wishing,",
        "and with painstakingness and with the intention of seeking the great reward of Allah until death came upon you.",
        "So, Allah’s curse be upon those who deprived you of your right",
        "and upon those who took you away from your position.",
        "Allah’s curse be upon every one who, when informed about this, accepted it.",
        "I call Allah, His angels, His Prophets, and His Messengers to witness for me that",
        "I am the friend of him who is loyal to you",
        "and the enemy of him who antagonizes you.",
        "Peace and Allah’s mercy and blessings be upon you.",
        "INFO: You may then throw yourself on the tomb, kiss it, and say the following words",
        "I bear witness that you can hear my words",
        "and see my place.",
        "And I testify to you, O Allah’s friend, that you conveyed and fulfilled.",
        "O my master! O Allah’s argument!",
        "O Allah’s trustee! O Allah’s friend!",
        "Between me and Allah, to Whom all might and majesty belong, there are sins",
        "that have overburdened my back",
        "and deprived me of sleep;",
        "whenever I remember them, even my insides shiver.",
        "I thus flee to Allah, to Whom all might and majesty belong, and to you.",
        "I beg you in the name of Him Who has entrusted you with His secrets,",
        "appointed you as the supervisor over the affairs of His creatures,",
        "matched the obedience to you to the obedience to Him,",
        "and matched the loyalty to you to the loyalty to Him",
        "that you may intercede for me before Allah,",
        "rescue me from Hellfire,",
        "and aid me against the vicissitudes of my time.",
        "INFO: You may then throw yourself on the tomb again, kiss it, and say the following words",
        "O Allah’s friend!",
        "O Allah’s argument!",
        "O Allah’s door of forgiveness!",
        "I, your adherent, visitor,",
        "seeker of refuge with your tomb,",
        "residing in your courtyard,",
        "staying in your vicinity,",
        "(I) beg you to intercede for me before Allah that He may grant my needs",
        "and may respond to my requests for this life as well as the life to come,",
        "because you enjoy an enormous position with Allah,",
        "as well as admitted right of intercession.",
        "So, O my master, include me with those for whom you care",
        "and include me with your party.",
        "Peace be upon you and upon your partners in place; Adam and Noah.",
        "Peace be upon you and upon your two sons; al-Hasan and al-Husayn,",
        "and upon the immaculate Imams from your progeny.",
        "Allah’s mercy and blessings be upon you.",
        "DESC: You may then offer a six-unit prayer of ziyarah; two for visiting Amir al-Mu'minin (peace be upon him), two for visiting Prophet Adam (peace be upon him), and two for visiting Prophet Noah (peace be upon him). You may also supplicate Almighty Allah as earnestly as possible, for your prayers are responded at this place, Allah willing."
    ]
}