{
    "id": "imam-mohammed-baqer-(as)",
    "language": "en",
    "text": [
        "Peace be upon you; O one who opened the knowledge of Allah!",
        "Peace be upon you; O one who denotes the religion of Allah!",
        "Peace be upon you; O one who demonstrates the laws of Allah!",
        "Peace be upon you; O one who maintains the justice of Allah!",
        "Peace be upon you; O one who sincerely advises the servants of Allah!",
        "Peace be upon you; O one who calls to Allah!",
        "Peace be upon you; O one who guides to Allah!",
        "Peace be upon you; O evident grace!",
        "Peace be upon you; O glaring light!",
        "Peace be upon you; O brilliant full moon!",
        "Peace be upon you; O palpable truth!",
        "Peace be upon you; O shining lantern!",
        "Peace be upon you; O luminous star!",
        "Peace be upon you; O dazzling celestial body!",
        "Peace be upon you; O one protected!",
        "Peace be upon you; O one protected against slips!",
        "Peace be upon you; O one of immaculate lineage!",
        "Peace be upon you; O one of lofty roots!",
        "Peace be upon you; O benevolent Imam",
        "Peace be upon you O fortress?",
        "Peace be upon you; O Allah's proof against all of His creatures!",
        "I bear witness, O my master, that you verily expounded the right openly,",
        "and split the knowledge with thorough splitting,",
        "and dispersed it scatteredly!",
        "In the way of Allah, you were not taken by the blame of any blamer!",
        "and you established the religion of Allah",
        "and fulfilled what had been incumbent upon you,",
        "and took your followers out of the loyalty to other than Allah to the loyalty to Allah,",
        "and you enjoined obedience to Allah,",
        "and you forbade disobedience to Allah,",
        "Until He took you to His pleasure",
        "and moved you to the abode of His honouring",
        "and to the houses of His elite ones",
        "and to the vicinity of His intimate servants",
        "Peace and Allah's mercy and blessings be upon you."
    ],
    "title": "Imam Mohammed Baqer (as)"
}