{
    "id": "imam-ali-zainul-abideen---as-sajjad-(as)",
    "language": "en",
    "text": [
        "INFO: Ziarat 1",
        "Peace be on you, O leader of Those who prostrate!",
        "Peace be on you, O prestige of Worshipping ones!",
        "Peace be on you, O participant Of unhappiness and sadness!",
        "Peace be on you, O the Imam, Who got sores on spots which Touched during sijda!",
        "Peace be on you, O one who Wept and mourned!",
        "Peace be on you, one who was Captive of hardships!",
        "Peace be on you, O one from The great worshippers!",
        "Peace be on you , O the son of The fifth of the people of the Cloak (Husayn)",
        "Peace be on you, O son of the Leader of the martyrs!",
        "Peace be on you , O support of Pious ones!",
        "Peace be on you, and Allah’s Blessings and bounties on you!",
        "INFO: Ziarat 2",
        "Peace be upon you; O the Pride of the worshippers!",
        "Peace be upon you; O Pride of the Strivers!",
        "Peace be upon you; O Imam of the pious!",
        "Peace be upon you; O Lamp of the Approved Ones.",
        "Peace be upon you; O Master of Muslims!",
        "Peace be upon you; O the delight of the viewer eyes and learned",
        "Peace be upon you; O the descendant of the Previous Ones",
        "Peace be upon you; O Guardian of the Guardians",
        "Peace be upon you; O The trustee of the Divine Commandments",
        "Peace be upon you; O The Light of",
        "Peace be upon you; O The Light of the Lonely",
        "Peace be upon you; O Illumination of the Strivers",
        "Peace be upon you; O the Asset of The Worshipers",
        "Peace be upon you; O the Lamp of the Worlds",
        "Peace be upon you; O the Ship of Knowledge",
        "Peace be upon you; O the Peace of Tolerant",
        "Peace be upon you; O the Scale of Retribution",
        "Peace be upon you; O Ship of Salvation",
        "Peace be upon you; O ocean of generosity!",
        "Peace be upon you; O full moon in gloom!",
        "Peace be upon you; O Tenderhearted and Forbearing!",
        "Peace be upon you; O Patient and Wise!",
        "Peace be upon you; O head of weepers (of fear of God)!",
        "Peace be upon you; O Lantern for the Believers!",
        "Peace be upon you; O my master, Abü-Muhammad!",
        "I bear witness that you are the Proof of God and the Son of His Proof",
        "And the father of His Proof",
        "And the son of His trustee and the father of His trustees",
        "And you acted sincerely in the worship of your Lord,",
        "and hurried for seeking His pleasure",
        "and disappointed His enemies,",
        "and delighted His intimate servants!",
        "I bear witness that you worshipped Allah as He should be worshipped,",
        "and fear Him as He should be feared,",
        "and obeyed Him as He should be obeyed,",
        "until death came upon you.So, O my master, son of Allah's Messenger; (May) the most favorable greetings and peace be upon you (Along with) Allah's mercy and blessings.",
        "INFO: Ziarat 3",
        "Peace be upon you, O Imam of the guidance",
        "Peace be upon you, O Badr al-Duji.",
        "Peace be upon you, O cave of piety.",
        "Peace be upon you, O leader of the people of piety.",
        "Peace be upon you, O Baqir of the knowledge of the Prophets.",
        "Peace be upon you, O adornment of the heavens and the earth.",
        "Oh God, just as You made it a sign for Your servants, a repository of Your forbearance, and an interpreter of Your revelations.",
        "So bless him with the best of what you have bestowed upon one of the offspring of your prophets and your chosen ones and your messengers and your trustees",
        "Lord of the worlds."
    ]
}