{
    "id": "lady-fatima-bintul-asad---mother-of-imam-ali-(as)",
    "language": "en",
    "text": [
        "Peace be on the Prophet of Allah, Peace be on the Messenger of Allah,",
        "Peace be on Muhammad the leader of the Messengers,",
        "Peace be on Muhammad the leader of the foremost ones.",
        "Peace be on Muhammad the leader of the last ones.",
        "Peace be on one whom Allah sent as a mercy to the universe.",
        "Peace be on you, O Prophet and the mercy and blessings of Allah be upon you.",
        "Peace be on Fatima, the daughter of Asad, the Hashimite,",
        "Peace be upon you O truthful and contented one;",
        "Peace be upon you O virtuous and pure one;",
        "Peace be upon You O noble and contented one;",
        "Peace be upon you O one who looked after Muhammad, the seal of the Prophets.",
        "Peace be upon you O mother of the leader of the successors.",
        "Peace be upon you who showed compassion to the Prophet of Allah, seal of the Prophets;",
        "Peace be upon you O one who raised the trustworthy friend of Allah;",
        "Peace be upon you, on your soul and on your pure body;",
        "May peace, mercy and blessings be upon you and on your son.",
        "I bear witness that you supported in the best manner possible and fulfilled your obligation",
        "and strived for the pleasure of Allah",
        "and exerted yourself in protecting the Prophet of Allah,",
        "being aware of his status; believing in his truthfulness; acknowledging his prophecy,",
        "perceiving his blessings; taking responsibility of his upbringing,",
        "dealing with him affectionately; ready to serve him;",
        "choosing what please him, preferring what he like;",
        "I bear witness that you spent your life on the (true) faith",
        "and adhering to the most noble religion, being pleased and contented,",
        "pure, clean, guarded and virtuous.May Allah be pleased and satisfied with you;",
        "may He make heaven as your house and permanent abode.",
        "O Allah, send your greetings on Muhammad and the family of Muhammad",
        "and make my visiting her beneficial to me and make me firm in my love for her",
        "and do not deprive me of her intercession and the intercession of the Imams from her loins;",
        "so grant me her company and gather me with her and with her pure children;",
        "O Allah, do not make it my last visit to her",
        "and grant me another visit to her as long as You keep me alive",
        "and if You cause me to die then gather me with her ranks",
        "and include me amongst those receiving her intercession by Your mercy, O Most Merciful of the Merciful ones.",
        "O Allah, I ask You by her status and high position in front of You, forgive me",
        "and my parents and all believing men and women",
        "and grant us goodness in this and the next world and save us, by Your mercy, from the punishment of the fire."
    ],
    "title": "Lady Fatima bintul Asad - Mother of Imam Ali (as)"
}