{
    "id": "lady-ummul-baneen-(sa)---3",
    "language": "en",
    "text": [
        "I bear witness that there is no god but God alone, with no partner, and I bear witness that Muhammad is His servant and Messenger. Peace be upon you, O Messenger of God. Peace be upon you, O Commander of the Faithful. Peace be upon you, O Fatima Foremost Lady of the Women of the Worlds. Peace be upon Al-Hasan and Al-Hussein, the lords of the youth of the people of Paradise.",
        "Peace be upon you, O wife of the guardian of the Messenger of God. Peace be upon you, O dearest of Zahra, peace be upon her. Peace be upon you, O mother of the radiant Badour, Fatima bint Hazzam al-Kalabiya, nicknamed Ummul Baneen ( Mother of sons). , the door to fulfilment of needs",
        "I call God and His Messenger to witness that you strove for the sake of God, as you sacrificed your children,on Al-Hussein son of the daughter of the Prophet(saws)of God. and you worshiped God sincerely in your religion through your loyalty to the infallible Imams, peace be upon them, and you were patient in that great calamity, and you sought that from God, Lord of the Worlds, and you supported Imam Ali(as). During trials, tribulations, and calamities, you were at the peak of obedience and loyalty, and you did well in ensuring and performing the greatest trust in preserving deposits of Al-Zahra, Al-Hasan and Al-Hussein",
        "You attained maturity, excelled, and observed the righteous proofs of God, and desired to maintain ties with the children of the Messenger of the Lord of the Worlds, knowing their rights, believing in their sincerity, and Excessively kind towards them, attentive to their wishes, and loving them more that your own blessed children.",
        "May the peace of God be upon you, my lady, Ummul Baneen ( Mother of sons), when the night fell and dusk, and the day became bright and bright, and God give you to drink of sealed nectar,on a day when wealth and children would not be of use, and you became an example For righteous believing women, because you are the noblest of creation, knowledgeable and learned, pure and pure, may God be pleased with you and please you, and May God bestow upon you many wonderful blessings, so that your obedience to God and the guardian of guardians, your love for the Lady of Women, Al-Zahra, and your ransom of your four children for the Lord of Martyrs, became a gateway to all needs.",
        "So intercede for me with God by forgiving my sins, removing my harm, and meeting my needs, for you have a praiseworthy status and prestige before God, and peace be upon your martyred children, Al-Abbas. The moon of Banu Hashim and Bab al-Hawaij, and Abdullah, Othman and Jaafar, who were martyred in support of Hussein in Karbala, and peace be upon your daughter, Al-Durra, the pure, pure, and contented Khadija, may God reward you. May God reward them with Gardens beneath which rivers flow, in which they will abide. O God, bless Muhammad and his family."
    ]
}