{
    "id": "prophet-muhammad-(saww)---17-rabiul-awwal",
    "title": "Prophet Muhammad (saww) - 17 Rabiul Awwal",
    "language": "en",
    "text": [
        "I bear witness that there is no god save Allah, alone without having any associate,",
        "and I bear witness that Muhammad is His servant and Messenger,",
        "that he is the chief of the ancient and the coming generations,",
        "and that he is the chief of all Prophets and Messengers.",
        "O Allah, send blessings upon him and upon his Household—the Immaculate Imams.",
        "Peace be upon you, O Messenger of Allah.",
        "Peace be upon you, O Friend of Allah.",
        "Peace be upon you, O Prophet of Allah.",
        "Peace be upon you, O Choice of Allah.",
        "Peace be upon you, O Mercy of Allah.",
        "Peace be upon you, O Well-Chosen by Allah.",
        "Peace be upon you, O Most Beloved by Allah.",
        "Peace be upon you, O Selected by Allah.",
        "Peace be upon you, O Seal of the Prophets.",
        "Peace be upon you, O Master of the Messengers.",
        "Peace be upon you, O Maintainer of justice.",
        "Peace be upon you, O introducer of goodliness.",
        "Peace be upon you, O core of Divine Inspiration and Revelation.",
        "Peace be upon you, O conveyor on behalf of Allah.",
        "Peace be upon you, O light-giving torch.",
        "Peace be upon you, O conveyor of good tidings (to the believers).",
        "Peace be upon you, O warner (against Allah’s chastisement).",
        "Peace be upon you, O he who warns (against violating Allah’s commands).",
        "Peace be upon you, O Allah’s Light that spreads luminosity.",
        "Peace be upon you and upon your Household—the pure, immaculate,",
        "guides, and rightly guided.",
        "Peace be upon you and upon your grandfather, `Abd al-Muttalib,",
        "and upon your father, `Abdullah.",
        "peace be upon your mother, ªminah the daughter of Wahab.",
        "Peace be upon your (paternal) uncle, Hamzah, the master of martyrs.",
        "Peace be upon your uncle, al-`Abbas the son of `Abd al-Muttalib.",
        "Peace be upon your uncle and your guardian, Abu-Talib.",
        "Peace be upon your cousin, Ja`far the flying in the gardens of the Paradise of Eternity.",
        "Peace be upon you, O Muhammad (the praised).",
        "Peace be upon you, O Ahmad (the more praised).",
        "Peace be upon you, O Argument of Allah against the past and coming generations,",
        "foremost to the obedience to the Lord of the worlds,",
        "prevailing over His Messengers,",
        "last of His Prophets,",
        "witness over all His creatures,",
        "interceder to Him,",
        "firmly established with Him,",
        "obeyed in His Kingdom,",
        "winner of the most praised qualities,",
        "holder of the most praised honors,",
        "honored by the Lord,",
        "addressee (by Almighty Allah) from behind the (Divine) Veils,",
        "most advanced in position,",
        "and unovertakable.",
        "I greet you with the greeting of him who acknowledges your right (that is incumbent upon us),",
        "who confesses of his shortcoming in carrying out his duty towards you,",
        "who does not discuss your limitless virtues,",
        "who is sure that you will have more rewards from your Lord,",
        "who believes in the Book that was revealed to you,",
        "who deems lawful all that which you deemed lawful,",
        "and who deems unlawful all that which you deemed unlawful.",
        "O Messenger of Allah, I bear witness—and I join everyone who bears witness",
        "and also bear witness rather than everyone who may deny it—",
        "that you conveyed the messages of your Lord (flawlessly),",
        "offered your nation good advice,",
        "strove in the way of your Lord,",
        "expounded openly what you were commanded to convey,",
        "stood harm for the sake of Him,",
        "called to the way of Him with excellent wisdom and fair exhortation,",
        "fulfilled the duty with which you were commissioned,",
        "you, verily, were compassionate to the believers,",
        "strong against the unbelievers,",
        "and you worshipped Allah sincerely until death came upon you.",
        "Therefore, Almighty Allah has exalted you to the most honorable position of the ennobled ones,",
        "to the most elevated place of the intimate servants of Him,",
        "and to the most exalted ranks of the Messengers where none can come up with you,",
        "none can excel you,",
        "none can overtake you,",
        "and none can even think of obtaining your rank.",
        "All praise be to Allah Who saved us from perdition through you,",
        "Who guided us off misdirection through you,",
        "and Who lit our darkness through you.",
        "O Messenger of Allah, may Allah reward you, for you are His envoy, with the best rewarding that He has ever conferred upon a prophet on behalf of his people",
        "or a messenger on behalf of those to whom He has sent him.",
        "May Allah accept my father and my mother as ransoms for you, O Messenger of Allah. I am visiting you for I acknowledge your right (that is incumbent upon us),",
        "I confess of your superiority,",
        "I know for sure about the straying off (from the right path) of those who dissent from you and from your Household,",
        "and I admit the true guidance that you follow (and lead to).",
        "May Allah accept my father, my mother, me, my family, my property, and my sons as ransoms for you!",
        "Let me invoke Almighty Allah’s blessings upon you in the same way as Allah did send blessings upon you",
        "and so did His angels, Prophets, and Messengers;",
        "such blessings that are consecutive, abundant,",
        "continuous, incessant, infinite, and unlimited.",
        "May Allah send blessings upon you and upon your Household, the pure and immaculate, as much as you deserve.",
        "O Allah, (please do) make You complete blessings,",
        "Your perfect benedictions,",
        "Your most virtuous boons,",
        "and Your most honorable greetings, salutations,",
        "dignities, and mercy,",
        "as well as the blessings of Your archangels,",
        "your commissioned Prophets,",
        "Your elite Imams,",
        "Your righteous servants,",
        "the inhabitants of the heavens and the earth,",
        "and (the blessings of) everyone who glorified You, O Lord of the worlds,",
        "from the past and the coming generations—",
        "make all these pour forth upon Muhammad; Your servant, Your messenger,",
        "Your witness, Your Prophet,",
        "Your warner, Your trustee,",
        "Your firmly established (in truth), Your confidante,",
        "Your elite, Your most beloved,",
        "Your friend, Your choice,",
        "Your notable, Your elect,",
        "Your well-chosen, Your mercy,",
        "the best of Your created beings,",
        "the Prophet of mercy,",
        "the storer of forgiveness,",
        "the leader to goodliness and blessing,",
        "the savior of the servants (of Almighty Allah) from perdition by Your permission,",
        "the caller of them to Your religion,",
        "the custodian by Your order,",
        "the first Prophet to make the covenant,",
        "and the last Prophet to be sent (to humanity),",
        "whom You have immersed in the ocean of virtue,",
        "in the lofty rank,",
        "in the elevated level,",
        "and in the exalted position;",
        "and whom You entrusted in the pure loins",
        "and moved to the immaculate wombs",
        "out of Your kindness to him",
        "and Your compassion to him.",
        "In order to safeguard, to shield,",
        "to protect, and to defend him,",
        "You assigned, out of Your omnipotence, a protective lookout over him",
        "to keep him from the impurities of adultery",
        "and from the defects of fornication;",
        "thus, You raised the sights of the servants through him",
        "and revived the derelict lands",
        "when You removed the screening murk by the light of his birth",
        "and dressed Your Holy Precinct the garments of brightness through him.",
        "O Allah, as You have given him exclusively the honor of this noble rank",
        "and the privilege of this great merit,",
        "(please do) bless him for he fulfilled his covenant to You,",
        "conveyed all Your messages,",
        "fought against the infidels in order to prove Your Oneness,",
        "exterminated the womb of atheism in order to strengthen Your religion,",
        "and dressed himself the garb of misfortune in order to struggle against Your enemies.",
        "Hence, You have given him as recompense for any harm that inflicted him,",
        "any trickery that he faced",
        "from the faction who tried to assassinate him;",
        "a merit that excels all other merits",
        "and due to which he possessed Your abundant gifts.",
        "In return, he hid his sadness,",
        "concealed his grief,",
        "swallowed the pang,",
        "and never did he violate the instructions of Your Revelation.",
        "O Allah, (please do) send blessings upon him and his Household—blessings that You please for them,",
        "and convey our abundant greetings and compliments to him,",
        "and give us - from You on account of our loyalty to them - favors, kindness,",
        "mercy, and forgiveness.",
        "Verily, You are the Lord of great favor.",
        "O Allah, You have said to Your Prophet Muhammad—",
        "may Allah bless him and his Household:",
        "“And had they, when they were unjust to themselves,",
        "come to you and asked forgiveness of Allah",
        "and the Messenger had (also) asked forgiveness for them,",
        "they would have found Allah Oft-returning (to mercy), Merciful.”",
        "I was not present at the age of Your Messenger—peace be upon him and his Household.",
        "O Allah, I have visited him desiring, repenting from my ill deeds,",
        "imploring forgiveness of my sins,",
        "confessing of my having committed these sins although You know them more than I do,",
        "and turning my face towards You in the name of Your Prophet, the Prophet of Mercy—",
        "may Your blessings be upon him and his Household.",
        "O Allah, in the name of Muhammad and his Household, (please do) make me illustrious",
        "in this world as well as the Next World and one of those brought near to You.",
        "O Muhammad!",
        "O Messenger of Allah!",
        "May Allah accept my father and mother as ransoms for you!",
        "O Prophet of Allah!",
        "O chief of all created beings of Allah!",
        "In Your name do I turn my face towards Allah, my and your Lord,",
        "so that He may forgive my sins,",
        "accept my deeds,",
        "and settle my requests.",
        "Therefore, be my interceder before your and my Lord,",
        "for my Lord, the Master, is the best besought",
        "and You are the best interceder.",
        "O Muhammad!",
        "May peace be upon you and upon your Household.",
        "O Allah, (please do) confer upon me with forgiveness, mercy,",
        "and sustenance that is outgoing, good, and beneficial from Your Presence",
        "in the same way as You conferred upon him who came to Your Prophet, Muhammad, when he was alive,",
        "may your blessings be upon him and his Household,",
        "and confessed of his sins.",
        "Thus, Your Messenger prayed You to forgive him.",
        "May your blessings be upon him and his Household.",
        "And You did forgive him out of Your mercy, O most Merciful of all those who show mercy.",
        "O Allah, I now put my hope in You, please You,",
        "stand before You,",
        "desire for You other than anyone else,",
        "and hope for Your abundant reward",
        "while I confess of my sins and I do not deny them,",
        "I repent to You from whatever I have committed,",
        "and I seek refuge with You from this position",
        "against the deeds that I have committed",
        "although You, firstly, had introduced them to me as prohibited, warned me against committing them,",
        "and threatened me with Your punishment if I would violate.",
        "And I seek shelter with the nobility of Your Face",
        "lest You impose upon me the situation of disgrace and humility",
        "on the day when the veils will be exposed,",
        "the secrets and scandals will be disclosed,",
        "and the muscles will writhe with fear;",
        "on the day of regret and remorse,",
        "the day of exposing the liars,",
        "the day of the approaching doom,",
        "the day of assembling,",
        "the day of separation,",
        "the day of punishment,",
        "the day the measure of which is fifty thousand years,",
        "the day of the blowing,",
        "the day on which the quaking land shall quake",
        "followed by oft-repeated commotions,",
        "the day of raising the dead,",
        "the day of exposition before the Fire,",
        "the day when all mankind stand before the Lord of the Worlds,",
        "the day when a man flees from his brother,",
        "his mother, his father,",
        "his wife, and his children,",
        "the day when the earth and the sides of the heavens will split asunder,",
        "the day when every soul will come pleading for itself,",
        "the day when they will be relegated to Allah Who will inform them of what they did,",
        "the day when a friend can in naught avail his friend",
        "nor can they be helped",
        "save him on whom Allah will have mercy.",
        "Lo! He is the Mighty, the Merciful,",
        "the day when they will be returned to the Knower of the invisible and the visible,",
        "the day when they will be restored to Allah, their Lord, the Just,",
        "the day when they come forth from the graves in haste,",
        "as racing to a goal",
        "and as locusts spreading abroad,",
        "hastening toward the Summoner—",
        "to Allah,",
        "the day of the event inevitable",
        "when  the earth will be shaken with a shock,",
        "the day when the sky will become as molten copper",
        "and the hills become as flakes of wool",
        "and no familiar friend will ask a question of his friend,",
        "the day of the witness and that whereunto he bears testimony,",
        "and they day when the angels will come rank on rank.",
        "O Allah, (please do) have mercy upon my situation on that day (when I will be stopped for interrogation) for my current situation,",
        "and do not confound me at that situation for the wrongdoings that I have committed against myself.",
        "O my Lord, (please do) group me, on that day, with Your intimate servants,",
        "include me with the company of Muhammad and his Household—peace be upon them—",
        "make the Pond of him (i.e. the Holy Prophet) to be my arrival point,",
        "make me a place among the honorable, white-forehead group,",
        "and give me my Record (of deeds) in my right hand",
        "so that I will succeed due to my rewards,",
        "You will make my face white,",
        "You will make easy for me my reckoning,",
        "You will make my pan of the Scale (of deeds) outweigh,",
        "and I will join the triumphant ones",
        "among Your righteous servants",
        "to Your Pleasure and gardens of Paradise.",
        "O God of the Worlds!",
        "O Allah, I do seek Your protection lest You may expose me on that day",
        "in the presence of Your creatures because of my sins,",
        "or I may encounter disgrace and regret due to my wrongdoings,",
        "or You may make my evildoings outweigh my good deeds,",
        "or You may declare my name as loser amongst Your creatures.",
        "O All-generous, O All-generous,",
        "(I beg You for) pardon, (I beg You for) pardon,",
        "(I beg You for) covering (my evildoings), (I beg You for) covering (my evildoings).",
        "O Allah, I also seek Your protection against including me, on that day,",
        "with the line of the evils",
        "or add me to the row of the wretched ones.",
        "When You shall distinguish between Your creatures",
        "and drive each group –according to their deeds-",
        "to their final abodes in groups,",
        "(please do) line me up, in the name of Your mercy, with the group of Your righteous servants,",
        "and drive me with the group of the Your pious, intimate servants",
        "to the gardens of Your Paradise, O Lord of the Worlds!",
        "INFO: Then you may bid farewell",
        "Peace be upon you, O Messenger of Allah.",
        "Peace be upon you, O conveyor of good tidings (to the believers) and warner (against Allah’s chastisement).",
        "Peace be upon you, O light-giving torch.",
        "Peace be upon you, O intercessor between Allah and His creatures.",
        "I bear witness, O Messenger of Allah, that You were light in the lofty loins",
        "and purified wombs.",
        "The ignorance could not stain you with its impurities",
        "or dress you its gloomy garbs.",
        "I also bear witness, O Messenger of Allah, that I have faith in you",
        "and in the Imams from your Household,",
        "and I believe in all that which you have brought,",
        "satisfactorily and faithfully.",
        "And I bear witness that the Imams from your Household are the signs of (true) guidance,",
        "the Firmest Handle,",
        "and the arguments against the inhabitants in this world.",
        "O Allah, (please) do not make it the last of my pilgrimage to (the tomb of) Your Prophet—",
        "peace be upon him and his Household.",
        "If you decide to grasp my soul, I will bear witness in my death,",
        "as same as I have born witness in my lifetime,",
        "that Your are verily Allah; there is no god save You,",
        "alone without having any associate,",
        "that Muhammad is Your servant and Messenger,",
        "and that the Imams from his Household are Your intimate servants, Your supporters,",
        "Your Arguments against Your creatures,",
        "Your representatives amongst Your servants,",
        "Your signs in Your lands,",
        "the custodians of Your knowledge,",
        "the keepers of Your secret,",
        "and the interpreters of Your Revelation.",
        "O Allah, (please do) send blessings upon Muhammad and the Household of Muhammad",
        "and convey to the souls of Your Prophet, Muhammad, and his Household,",
        "at this very hour as well as all times,",
        "greetings and compliments from me.",
        "O Messenger of Allah, peace and Allah’s mercy and blessings be upon you.",
        "Allah may not decide this compliment of me to be the last."
    ]
}