{
    "id": "syeda-sakina-(ruqayya)-bintul-hussain-(sa)",
    "title": "Syeda Sakina (Ruqayya) Bintul Hussain (sa)",
    "language": "en",
    "text": [
        "Peace with you, O daughter of the Chosen Prophet,",
        "Peace with you, O daughter of the Pleased wali,",
        "Peace with you, O daughter of the pure Batool, Fatima al-Zahraa,",
        "Peace with you, O daughter of Khadija the Great,",
        "Peace with you, O daughter of the fifth of Ashab al-Kisaa[1],",
        "Peace with you, O portion of the liver of the one who was totally covered with blood,",
        "Peace with you, O child of the one who was unjustly killed in Kerbala,",
        "Peace with you, O pampered one of al-Hussain the Martyr, with him be peace, Allah’s mercy and blessings.",
        "Peace with you, O one brought up in the house of piety,",
        "Peace with you, O one born in the house of self-esteem,",
        "Peace with you, O small one of the Pillar of Guidance,",
        "Peace with you, O martyr of grieving and weeping,",
        "Peace with you, O one who was killed by patience at adversity,",
        "Peace with you, O one who much denounced and pleaded, Allah’s mercy and blessings.",
        "Peace with the weeping, complaining, mourning one,",
        "Peace with the wailing captive,",
        "Peace with the one orphaned while still a child,",
        "Peace with the one of the great grief at the loss of one who was affectionate and merciful to her,",
        "Peace with the one of the grief-repressing heart,",
        "Peace with the one of the over-flowing tearful eyes,",
        "With the one having a moaning that tears the hearts apart",
        "Due to the successive of calamities,",
        "Due to what happened to her in the land of afflictions,",
        "The mercy of Allah and His blessings.",
        "Peace with the one who was pained and whipped,",
        "Peace with the one who kept bending on bodies which they killed,",
        "Peace with the one whom they prevented from wailing and cries,",
        "Peace with the captive severed from all ties,",
        "Peace with the wronged and afflicted one,",
        "Peace with the one whose condition was denouncing and wailing,",
        "Peace with the one who did not live long after the calamity,",
        "Peace with the one from whom the protector and guardian was absent, the mercy of Allah and His blessings.",
        "My salutation goes to the one who was martyred in the supreme catastrophe,",
        "I grieve for the one whose tribulation is a great calamity,",
        "When the dark overwhelmed her,",
        "when she was lodged in the House of Ruin in the Sham",
        "with her aunt who gathered the orphans around her,",
        "when wailers took to silence,",
        "when the breaths of grief and wailing calmed down,",
        "when they spent the night seeking the morn,",
        "so you, O Ruqayya, were frightened in your sleep,",
        "and you took to wailing, complaining,",
        "mourning your father with the most somber of words.",
        "When the sound reached the cursed Yazid,",
        "he ordered to bring in the washbowl where the head of the Martyr was placed.",
        "He hid his thoughts and what he wanted to do.",
        "He started expressing elation at your calamity, showing such a great injustice,",
        "with the intention to cut your heart to pieces by doing something from which the stone and the iron crumbles:",
        "Grief cast its shadow on the ladies who descended from Hashim",
        "on seeing the head of the man of fervor and manliness.",
        "You kept looking at the Crown of the dignified `Itra,",
        "and the sight shook you,O Ruqayya,",
        "as the blood drenched his beard,",
        "as his lip was hard pressed with the iron rod,",
        "as his cheeks were dried by thirst,",
        "as his eyes were affixed on the heavens",
        "as he directed this address:",
        "“O Lord! I have abandoned all creation when I loved You…,",
        "orphaned my children so I may see You;",
        "therefore, if You cut me to pieces while loving You…,",
        "my heart will never prefer anyone over You.”",
        "Peace with the one whose condition cuts the hearts to pieces,",
        "Peace with the one who delivered the amazing speech in defense of the one whose cheeks were ruffled with the dust, your father, the father of Abdullah, al-Hussain, peace with him.",
        "It was then that you called out:",
        "“O father! Who drenched the virtuous beard with blood?",
        "“Who severed the holy neck?",
        "“Who made me an orphan though I am still a child?”",
        "To you, O Ruqayya, I express my puzzlement:",
        "How can I describe your whimper?",
        "So peace with the one who fell on the head of her father anxiously,",
        "Peace with the one whose feverish head was hugged,",
        "Peace with the one whose condition spoke for her,",
        "Peace with your ascending soul after you fell on the sacred head,",
        "Peace with your withering senses due to incessant walking,",
        "Peace with the soul that bade farewell to the sighing senses,",
        "Peace with the body the fractured soul of which departed,",
        "Peace with the one who caused women to weep",
        "On account of the horrific site of what they saw,",
        "On account of what happened to her and the woe,When her father’s head was brought to her…",
        "Imam Zainul-`Abidin peace with him said,",
        "“Lift her, for her soul has departed from this life…”",
        "So they lifted you, and you were dead…",
        "Peace with the one who intensified the calamity of Ahl al-Bayt.",
        "Peace with you, one with the self-esteemed soul,",
        "Peace with you, O captive descendant of al-Hussain,",
        "Peace with you, O daughter of the Muhammedi celestial lights,",
        "Peace with you, O branch of the Alawi Fatimi Tree,",
        "O little one of al-Hussain, O Ruqayya,",
        "The mercy of Allah and His blessings.",
        "Our calamities have been aggravated because of you,O daughter of al-Hussain,",
        "Our eyes are affixed on you with warm tears,",
        "Colors of our faces have been robbed by wailing,",
        "Our hearts have suffered due to the darts",
        "Of the hidden animosity of the oppressive Banu Umayyah,",
        "Our souls have gathered here in your presence",
        "With anxiety, affection, sighs and moaning,",
        "The Purified Ahl al-Bayt are they mourning,",
        "Complaining about the anguish, t",
        "he severity of grief,",
        "the hardship of the pain,",
        "The strangulation of the separation,",
        "The warmth of the affection…",
        "We plead to Allah to compensate us for having lost you with abundance of rewards,",
        "with the goodly Return to Him.",
        "We plead to Allah through the status which you enjoy with Him, O Sakina,",
        "through the honor which is before you,",
        "through the place from which your lights shine,",
        "that you will intercede on behalf of the lowly sinner,",
        "the fugitive seeker of a safe haven,",
        "the heart-broken helpless supporter of yourselves,",
        "the repentant lover of Ahl al-Bayt,",
        "who repents to Allah, the all-Knowing, the all-Seeing,",
        "so he may attain, through you, O Ahl al-Bayt, the perfect rewards of Ziyaras,",
        "so he may achieve success in his Hereafter when his rewards are doubled and sins forgiven,",
        "surely my Lord is most Gracious;",
        "surely He answers the pleases,",
        "expresses affection, Merciful to you, O Ahl al-Bayt, and Kind.",
        "Peace with you, masters, the mercy of Allah and His blessings.",
        "I testify that you tolerated whatever afflicted you,",
        "that you are alive according to the text of the Book (Qur’an),",
        "where the One Who is swift in reckoning says,",
        "“And do not reckon those who are killed in the way of Allah as dead. Nay! They are living with their Lord, receiving their sustenance.”",
        "O Allah! Bless Muhammed and the Progeny of Muhammed!",
        "Lord! I plead to You through the medium of the great calamity and the momentous affliction,",
        "INFO: وَ بالنازلة الْكُبْرَى",
        "to what went on in Kerbala,",
        "to bless Muhammed and the Progeny of Muhammed,",
        "and to spare us the ills of everything that is evil,",
        "to overlook our own injustices,",
        "to strengthen us so we may resist the committing of what You abhor!",
        "Lord! We direct ourselves to You through the medium of the shock that killed Ruqayya,",
        "the orphan, through the medium of the momentous calamity,",
        "through the medium of the severe affliction,",
        "through the suffering of the glorified `Itra,",
        "through the medium of Sakina’s pure soul,",
        "persevering senses",
        "and generous tears,",
        "through her status with which pleases You…,",
        "to fulfill our needs and those of believing men and women,"
    ]
}