{
    "id": "syeda-fatima-zahra-(sa)---in-medina",
    "language": "en",
    "text": [
        "Peace be upon You; O daughter of the Messenger of Allah.",
        "Peace be upon You; O daughter of the intimate servant of Allah.",
        "Peace be upon You; O daughter of the Prophet of Allah.",
        "Peace be upon You; O daughter of the most beloved of Allah.",
        "Peace be upon You; O daughter of the chosen one of Allah.",
        "Peace be upon You; O daughter of the trustee of Allah.",
        "Peace be upon You; O daughter of the best of Allah’s creations.",
        "Peace be upon You; O daughter of the best of Allah’s Prophets, Messengers and angels.",
        "Peace be upon You; O daughter of the best of created beings.",
        "Peace be upon You; O the Doyenne of all women of the world.",
        "Peace be upon You; O the lady of the intimate servant of Allah",
        "and the best of all created beings after the Messenger of Allah.",
        "Peace be upon You; O the mother of al-Hasan and al-Husayn,",
        "The two masters of the youth of Paradise.",
        "Peace be upon You; O the veracious, the martyred one.",
        "Peace be upon You; O the content, the pleaseded one.",
        "Peace be upon You; O the virtuous, the pure one.",
        "Peace be upon You; O the Paradisical human being.",
        "Peace be upon You; O Fatimah, daughter of the Messenger of Allah.",
        "So upon you be the mercy and blessings of Allah.",
        "May Allah bless you, And your soul, and your body.",
        "I bear witness that you have spent your life with full awareness of your duty towards your Lord;",
        "And verily, whoever pleases you has pleased the Messenger of Allah.",
        "And whoever is harsh to you has been harsh to the Messenger of Allah.",
        "And whoever cuts ties with you has cut ties with the Messenger of Allah.",
        "For you are a part of him and his soul that resides between his sides.",
        "As the best peace and blessings of Allah were sent upon him when he said:",
        "I bear witness by Allah and His Messenger that I am pleased with whoever you are pleased with,",
        "And displeased with whoever you are displeased with.",
        "I disassociate from whoever you disassociate from, and ally with",
        "Whoever you befriend, and oppose whoever you oppose.",
        "I harbor hatred for whoever you hate, and love for whoever you love.",
        "And sufficient is Allah as a Witness, Reckoner, Judge, and Rewarder.",
        "INFO: Then say",
        "O Allah, send peace and blessings upon Your servant and Messenger,",
        "Muhammad ibn Abdullah, the Seal of the Prophets,",
        "And the best of all creation.",
        "And send blessings upon his successor, Ali ibn Abi Talib,",
        "The Commander of the Faithful and the Imam of the Muslims,",
        "And the best of the successors.",
        "And send blessings upon Fatimah, the daughter of Muhammad,",
        "The Mistress of the Women of the Worlds.",
        "And send blessings upon the Masters of the Youth of Paradise,",
        "Al-Hasan and Al-Husayn.",
        "And send blessings upon the Adornment of the Worshipers, Ali ibn Al-Husayn,",
        "And upon Muhammad ibn Ali, the Splitter of the Prophets' Knowledge.",
        "And upon the Truthful by Allah, Ja'far ibn Muhammad.",
        "And upon the Suppressor of Anger for Allah, Musa ibn Ja'far.",
        "And upon the Pleasure of Allah, Ali ibn Musa.",
        "And upon the Pious, Muhammad ibn Ali.",
        "And upon the Pure, Ali ibn Muhammad.",
        "And upon the Purified, Hasan ibn Ali.",
        "And upon the Proof, the Awaited One, the son of Hasan ibn Ali.",
        "O Allah, revive through him justice and abolish through him oppression,",
        "And adorn the earth with his presence, and manifest through him Your religion,",
        "And the tradition of Your Prophet, until no aspect of truth remains hidden",
        "Out of fear of any creature, and make us among his supporters,",
        "His followers, and those accepted in the company of his allies.",
        "O Most Merciful of the merciful!",
        "O Allah, send blessings upon Muhammad and his Household,",
        "Those from whom You have removed all impurity and purified thoroughly."
    ]
}