{
    "id": "syeda-fatima-zahra-(sa)",
    "title": "Syeda Fatima Zahra (sa)",
    "language": "en",
    "text": [
        "O carefully examined (lady)",
        "Allah Who created you had tried you",
        "before He created you (for this worldly life),",
        "and thus He found you successfully enduring in that trial.",
        "We claim being loyalists to you, believers in you,",
        "and tolerant as regards all that which has been conveyed to us by your father,",
        "peace of Allah be upon him and his Household,",
        "and all that which his Successor has brought to us.",
        "We, thus, ask you, if we have really believed you,",
        "that you may include us with those who believe in both of them (i.e. the Holy Prophet and Imam `Ali),",
        "so that we may feel happy that we have been purified on account of our loyalty to you.",
        "INFO: Then add the following",
        "Peace be upon you, O daughter of the Messenger of Allah.",
        "Peace be upon you, O daughter of the Prophet of Allah.",
        "Peace be upon you, O daughter of the most beloved of Allah.",
        "Peace be upon you, O daughter of the Intimate Servant of Allah.",
        "Peace be upon you, O daughter of the Choice of Allah.",
        "Peace be upon you, O daughter of the Trustee of Allah.",
        "Peace be upon you, O daughter of the best of Allah’s creatures.",
        "Peace be upon you, O daughter of the best of Allah’s Prophets, Messengers, and angels.",
        "Peace be upon you, O daughter of the best of all created beings.",
        "Peace be upon you, O doyenne of all women of the world,",
        "including the past and the coming generations.",
        "Peace be upon you, O lady of the Intimate Servant of Allah",
        "and the best of all created beings after the Messenger of Allah.",
        "Peace be upon you, O mother of al-Hasan and al-Husayn,",
        "the two chiefs of the youth of Paradise.",
        "Peace be upon you, O veracious and martyr.",
        "Peace be upon you, O content and pleased.",
        "Peace be upon you, O virtuous and pure.",
        "Peace be upon you, O Paradisiacal human being.",
        "Peace be upon you, O pious and immaculate.",
        "Peace be upon you, O one talked by the angels, O knowledgeable.",
        "Peace be upon you, O oppressed lady whose right was usurped.",
        "Peace be upon you, O persecuted and maltreated.",
        "Peace be upon you, O Fatimah the daughter of the Messenger of Allah.",
        "So be upon you the mercy and blessings of Allah.",
        "May Allah bless you,",
        "your soul, and your body.",
        "I bear witness that you have spent your life with full awareness of your duty towards your Lord",
        "and (I bear witness) that he who pleases you will have pleased the Messenger of Allah,",
        "peace be upon him and his Household,",
        "and he who displeases you will have displeased the Messenger of Allah,",
        "peace be upon him and his Household,",
        "and he who harms you will have harmed the Messenger of Allah,",
        "peace be upon him and his Household,",
        "and he who respects you will have respected the Messenger of Allah,",
        "peace be upon him and his Household,",
        "and he who disrespects you will have disrespected the messenger of Allah,",
        "peace be upon him and his Household.",
        "This is because you are an inseparable part of him (i.e. the Holy Prophet),",
        "and you are his soul with which he lives.",
        "I ask Allah, His Messengers, and His angels to be the witnesses",
        "that I am verily pleased with him whomever you accept,",
        "I am displeased with him whomever you detest,",
        "I disavow him whomever you disavow,",
        "I am loyal to him whomever you support,",
        "I am the enemy of him whomever you betake as enemy,",
        "I am hateful to him whomever you hate,",
        "and I like him whomever you like.",
        "Verily, Allah is Sufficient as Witness, Reckoner,",
        "Punisher, and Rewarder."
    ]
}