{
    "id": "syeda-fatima-zahra-(sa)---on-martyrdom-date-2",
    "language": "en",
    "text": [
        "Peace be upon you, O daughter of the Messenger of Allah.",
        "Peace be upon you, O daughter of the Prophet of Allah.",
        "Peace be upon you, O daughter of the Beloved of Allah.",
        "Peace be upon you, O daughter of the Friend of Allah.",
        "Peace be upon you, O daughter of the Chosen one of Allah.",
        "Peace be upon you, O daughter of the Trustworthy of Allah.",
        "Peace be upon you, O daughter of the best of Allah's creation.",
        "Peace be upon you, O daughter of the most excellent of Allah’s prophets, messengers, and angels.",
        "Peace be upon you, O daughter of the best of creation.",
        "Peace be upon you, O leader of the women of the worlds, from the first to the last.",
        "Peace be upon you, O spouse of the guardian of Allah and the best of creation after the Messenger of Allah.",
        "Peace be upon you, O mother of Hasan and Husayn, the leaders of the youth of Paradise.",
        "Peace be upon you, O truthful and martyred one.",
        "Peace be upon you, O the contented and pleasing one.",
        "Peace be upon you, O virtuous and pure one.",
        "Peace be upon you, O heavenly maiden in human form.",
        "Peace be upon you, O God-fearing and pure one.",
        "Peace be upon you, O the one spoken to by angels, the knowledgeable one.",
        "Peace be upon you, O the oppressed and wronged one.",
        "Peace be upon you, O the persecuted and subdued one.",
        "Peace be upon you, O Fāṭimah, daughter of the Messenger of Allah, and may Allah’s mercy and blessings be upon you.",
        "May Allah’s blessings be upon you, your soul, and your body.",
        "I bear witness that you departed upon clear guidance from your Lord.",
        "And whoever pleased you has indeed pleased the Messenger of Allah, peace be upon him and his family.",
        "And whoever offended you has indeed offended the Messenger of Allah, peace be upon him and his family.",
        "And whoever harmed you has indeed harmed the Messenger of Allah, peace be upon him and his family.",
        "And whoever connected with you has indeed connected with the Messenger of Allah, peace be upon him and his family.",
        "And whoever cut ties with you has indeed cut ties with the Messenger of Allah, peace be upon him and his family.",
        "For you are a part of him and his soul that resides within him.",
        "I call Allah and His angels to witness that I am a supporter of those who are loyal to you, an enemy to those who show enmity toward you, and at war with those who wage war against you.",
        "O my mistress, I have certainty in you, your father, your spouse, and the Imams from your offspring. I believe in their authority and am committed to their obedience.",
        "I testify that the religion is their religion, the judgment is their judgment, and they delivered Allah’s message, invited toward His path with wisdom and good advice, and were not deterred by the reproach of any critic in Allah’s cause.",
        "And may Allah’s blessings be upon you, your father, your spouse, and your pure offspring, the Imams.",
        "O Allah, send blessings upon Muḥammad and his family, and send blessings upon the pure and chaste Virgin, the truthful, the infallible, the pious, the pure, the contented, the pleasing, the virtuous, the guiding, the oppressed, the subdued, the usurped, whose rights were denied, whose inheritance was withheld, whose rib was broken, whose spouse was killed, and whose children were oppressed.",
        "Fāṭimah, daughter of Your Messenger, a part of his flesh, the essence of his heart, and the piece of his liver, chosen by You for him.",
        "And a gift bestowed upon him, the beloved of al-Muṣṭafā (the Chosen One), and the companion of al-Murtaḍā (the Chosen One).",
        "The leader of the women and the bearer of glad tidings to the righteous ones.",
        "The companion of piety and asceticism, the apple of Paradise and eternity.",
        "The one whose birth You honored with the women of Paradise, from whom You drew the lights of the Imams, and over whom You placed the veil of prophethood.",
        "O Allah, send blessings upon her, blessings that elevate her station with You, enhance her honor before You, and increase her status in attaining Your pleasure.",
        "And convey to her from us greetings and peace, and grant us from Yourself through our love for her bounty, kindness, mercy, and forgiveness. Truly, You are the Possessor of gracious pardon."
    ]
}