{
    "id": "syeda-nargis-(sa)",
    "title": "Syeda Nargis (sa)",
    "language": "en",
    "text": [
        "DESC: You may visit the doyenne of this world and the Next World; namely, the mother of Imam al-Qa'im (ajtfs) - whose tomb is situated behind the tomb of our master Imam al-Hasan al-`Askari (as)",
        "INFO: Ziyarah",
        "Peace be upon Allah’s Messenger,",
        "Allah’s blessings be upon him,",
        "the veracious and honest.",
        "Peace be upon our master the Commander of the Faithful.",
        "Peace be upon the Immaculate Imams",
        "and the blessed Arguments (of Allah).",
        "Peace be upon the mother of the Imam;",
        "the lady entrusted with the secrets of the All-knowing King",
        "and the bearer of the most honorable of all beings.",
        "Peace be upon you, O veracious and well-pleased lady.",
        "Peace be upon you, O equivalent of (Prophet) Moses’ mother",
        "and daughter of (Prophet) Jesus’ Disciple.",
        "Peace be upon you, O pious and bright.",
        "Peace be upon you, O well-pleased and well-contented.",
        "Peace be upon you, O described in the Gospel,",
        "betrothed from the Honest Spirit of Allah,",
        "desired for relationship by Muhammad the chief of the Messenger,",
        "and entrusted with the secrets of the Lord of the Worlds.",
        "Peace be upon you and upon your fathers the Disciples.",
        "Peace be upon you, your husband, and your son.",
        "Peace be upon you and upon your pure spirit and body.",
        "I bear witness that you acted excellently in custody (of your son),",
        "fulfilled the trust,",
        "worked painstakingly for gaining Allah’s pleasure,",
        "acted steadfastly for the sake of Allah,",
        "kept the secret of Allah,",
        "born the representative of Allah,",
        "did meticulously in the safeguarding of the Argument of Allah,",
        "and desired for maintaining the descendants of the Messenger of Allah",
        "as you had full recognition of their rights,",
        "believed in their honesty,",
        "professed their status,",
        "acknowledged their matter,",
        "sympathized with them,",
        "and preceded their inclination to yours.",
        "I also bear witness that you passed away with full awareness of the truth,",
        "following the examples of the righteous ones,",
        "well-pleased, well-contented,",
        "pious, bright, and pure.",
        "So, may Allah be pleased with you and may He please you",
        "and decide Paradise to be your abode and dwelling.",
        "He has endued you with lots of the good things with which He has bestowed upon you",
        "and He has given you the honorable position that made you dispense with everything else.",
        "May Allah delight and gratify you",
        "with the dignity that He has granted you.",
        "INFO: You may then raise your head towards the heavens and say the following dua",
        "O Allah, to You alone have I had recourse.",
        "Your pleasure alone have I sought.",
        "Through Your representatives have I sought means to You.",
        "On Your forgiveness and forbearance have I relied.",
        "By You alone have I held fast.",
        "In the tomb of the mother of Your representative have I taken refuge.",
        "So, (please) send blessings upon Muhammad and Muhammad’s Household,",
        "make me benefit by my visit to her,",
        "keep me firm on love for her,",
        "do not deprive me of her intercession",
        "and her son’s intercession,",
        "provide me with being in her companionship,",
        "and include me with the group of her and her son",
        "as You have grant me success to visit her son and her.",
        "O Allah, I do turn my face towards You by means of the immaculate Imams",
        "and I choose as my mediation to You the blessed Arguments",
        "from the descendants of Taha and Yasin,",
        "(beseeching You) to bless Muhammad and Muhammad’s Household the pure",
        "and to make me of the tranquil, triumphant,",
        "blissful, and glorious ones",
        "on whom there is neither fear nor shall they be aggrieved.",
        "And (please) make me one of those whose deeds are admitted by You,",
        "whose affairs will be made easy by You,",
        "whose distress will be relieved by You,",
        "and whose fear will be secured by You.",
        "O Allah [I beseech You] in the name of Muhammad and the Household of Muhammad,",
        "(please) send blessings upon Muhammad and the Household of Muhammad,",
        "do not decide this visit to be the last time of my visits to her;",
        "rather, endue me with other chances to re-visit her as long as You keep me alive.",
        "If You decide to grasp my soul, then (please) include me with her group,",
        "bring me in the intercession of her son and her,",
        "forgive me and my parents",
        "as well as the believing men and women,",
        "give us good in this world",
        "and good in the Hereafter,",
        "and save us, out of Your mercy, from the chastisement of Fire.",
        "Peace be upon you all, O my masters.",
        "Allah’s mercy and blessings, too, be upon you."
    ]
}