{
    "id": "syeda-fatima-zahra-(sa)---in-medina",
    "title": "Syeda Fatima Zahra (sa) - in Medina",
    "language": "en",
    "text": [
        "Peace be upon You; O daughter of the Messenger of Allah.",
        "Peace be upon You; O daughter of the intimate servant of Allah.",
        "Peace be upon You; O daughter of the Prophet of Allah.",
        "Peace be upon You; O daughter of the most beloved of Allah.",
        "Peace be upon You; O daughter of the chosen one of Allah.",
        "Peace be upon You; O daughter of the trustee of Allah.",
        "Peace be upon You; O daughter of the best of Allah’s creations.",
        "Peace be upon You; O daughter of the best of Allah’s Prophets, Messengers and angels.",
        "Peace be upon You; O daughter of the best of created beings.",
        "Peace be upon You; O the Doyenne of all women of the world.",
        "Peace be upon You; O the lady of the intimate servant of Allah",
        "and the best of all created beings after the Messenger of Allah.",
        "Peace be upon You; O the mother of al-Hasan and al-Husayn,",
        "The two masters of the youth of Paradise.",
        "Peace be upon You; O the veracious, the martyred one.",
        "Peace be upon You; O the content, the pleaseded one.",
        "Peace be upon You; O the virtuous, the pure one.",
        "Peace be upon You; O the Paradisical human being.",
        "Peace be upon You; O Fatimah, daughter of the Messenger of Allah.",
        "So upon you be the mercy and blessings of Allah.",
        "May Allah bless you, And your soul, and your body.",
        "I bear witness that you have spent your life with full awareness of your duty towards your Lord;",
        "--------------",
        "--------------",
        "--------------",
        "--------------",
        "--------------",
        "--------------",
        "--------------",
        "--------------",
        "--------------",
        "--------------",
        "--------------",
        "INFO: Then say",
        "--------------",
        "--------------",
        "--------------",
        "--------------",
        "--------------",
        "--------------",
        "--------------",
        "--------------",
        "--------------",
        "--------------",
        "--------------",
        "--------------",
        "--------------",
        "--------------",
        "--------------",
        "--------------",
        "--------------",
        "--------------",
        "--------------",
        "--------------",
        "--------------",
        "--------------",
        "--------------",
        "--------------",
        "--------------",
        "--------------",
        "--------------"
    ]
}