{
    "id": "syeda-fatima-masooma-qom-(sa)",
    "title": "Syeda Fatima Masooma Qom (sa)",
    "language": "en",
    "text": [
        "INFO: Repeat 34 times:",
        "Allah Is The Great",
        "INFO: Repeat 33 times each of the following litanies",
        "Glory Be To Allah",
        "Praise Be To Allah",
        "INFO: Then say:",
        "Peace be upon Adam the choice of Allah.",
        "Peace be upon Noah the prophet of Allah.",
        "Peace be upon Abraham the friend of Allah.",
        "Peace be upon Moses the spoken by Allah.",
        "Peace be upon Jesus the spirit of Allah.",
        "Peace be upon you, O Allah’s Messenger.",
        "Peace be upon you, O Allah’s best creature.",
        "Peace be upon you, O elite of Allah.",
        "Peace be upon you, O Muhammad the son of `Abdullah",
        "and the seal of the Prophets.",
        "Peace be upon you, O Commander of the Faithful",
        "`Ali the son of Abu-Talib",
        "and the successor of Allah’s Messenger.",
        "Peace be upon you, O Fatimah",
        "the doyenne of the women of the worlds.",
        "Peace be upon both of you, O grandsons of the Mercy",
        "and two chiefs of the youth of Paradise.",
        "Peace be upon you, O `Ali the son of al-Husayn,",
        "the chief of the worshippers and the delight of the eye of all seers.",
        "Peace be upon you, O Muhammad the son of `Ali,",
        "the splitter of knowledge after the Prophet.",
        "Peace be upon you, O Ja`far the son of Muhammad,",
        "the veracious, dutiful, and honest.",
        "Peace be upon you, O Musa the son of Ja`far,",
        "the immaculate and ever-pure.",
        "Peace be upon you, O `Ali the son of Musa,",
        "the well-pleased and well-contented.",
        "Peace be upon you, O Muhammad the son of `Ali, the pious.",
        "Peace be upon you, O `Ali the son of Muhammad,",
        "the immaculate, sincere, and honest.",
        "Peace be upon you, O Hasan the son of `Ali.",
        "Peace be upon the next successor.",
        "O Allah, send blessings upon Your light, Your lantern,",
        "the representative of Your representative,",
        "the successor of Your successor,",
        "and the argument of You against Your creatures.",
        "Peace be upon you, O daughter of Allah’s Messenger.",
        "Peace be upon you, O daughter of Fatimah and Khadijah.",
        "Peace be upon you, O daughter of the Commander of the Faithful.",
        "Peace be upon you, O daughter of al-Hasan and al-Husayn.",
        "Peace be upon you, O daughter of Allah’s representative.",
        "Peace be upon you, O sister of Allah’s representative.",
        "Peace be upon you, O paternal aunt of Allah’s representative.",
        "Peace be upon you, O daughter of Musa the son of Ja`far.",
        "Allah’s mercy and blessings, too, be upon you.",
        "Peace be upon you.",
        "May Allah introduce us to you all in Paradise,",
        "include us with your group,",
        "allow us to approach the pond of Your Prophet,",
        "and serve us with water from the cup of your grandfather",
        "and from the hand of `Ali the son of Abu-Talib.",
        "Allah’s blessings be upon you all.",
        "I beseech Allah to show us delight and relief through you,",
        "to join us with you in the group of your grandfather",
        "Muhammad, Allah’s blessings be upon him and his Household,",
        "and never to deprive us of our recognition of you.",
        "Verily, He is Guardian and All-powerful.",
        "I seek nearness to Allah through my love for you,",
        "repudiation of your enemies,",
        "and submission to Allah,",
        "accepting Him without denial or arrogance,",
        "being fully certain of what Muhammad has brought,",
        "and showing full satisfaction with it.",
        "We, through this, only seek Your Face,",
        "O my Master Allah, and Your satisfaction",
        "as well as the Next Abode.",
        "O Fatimah, (please) intercede for me to win Paradise,",
        "for you enjoy an outstanding status with Allah.",
        "O Allah, I do beseech You to seal my life with happiness;",
        "so, (please) do not deprive me of that which I enjoy.",
        "There is neither might nor power except with Allah the All-high and All-great.",
        "O Allah, (please) respond to us",
        "and accept this from us in the name of Your generosity, almightiness,",
        "mercy, and bestowal of wellbeing.",
        "May Allah bless Muhammad and his entire Household",
        "and pour down peace on them, O most merciful of all those who show mercy."
    ]
}