{
    "id": "ziyarat-al-ashura",
    "title": "Ziyarat al-Ashura",
    "language": "en",
    "text": [
        "Peace be upon you, O Abu-`Abdullah.",
        "Peace be upon you, O son of Allah's Messenger.",
        "Peace be upon you, O choicest of Allah and son of His choicest.",
        "Peace be upon you, O son of the Commander of the Faithful",
        "and son of the chief of the Prophet's successors.",
        "Peace be upon you, O son of Fatimah",
        "the doyenne of the women of the worlds.",
        "Peace be upon you, O vengeance of Allah, son of His vengeance, and the unavenged so far.",
        "Peace be upon you and upon the souls that resided in your courtyard.",
        "Peace of Allah be upon all of you from me forever",
        "as long as I am existent and as long as there are day and night.",
        "O Abu-`Abdullah,",
        "unbearable is the sorrow",
        "and excruciating and unbearable is the misfortune of you",
        "for us and for all the people of Islam.",
        "Excruciating and unbearable has been your misfortune",
        "in the heavens for all the inhabitants of the heavens.",
        "So, may Allah curse the people who laid the basis of persecution and wronging against you, O Members of the Household.",
        "May Allah curse the people who drove you away from your position",
        "and removed you away from your ranks that Allah has put you in.",
        "May Allah curse the people who slew you.",
        "May Allah curse those who paved the way for them to do so",
        "and who made possible for them to fight against you.",
        "I repudiate them in the presence of Allah and You",
        "and I repudiate their devotees, followers, and loyalists.",
        "O Abu-`Abdullah,",
        "I am at peace with those who are at peace with you",
        "and I am at war against those who have fought against you up to the Resurrection Day.",
        "May Allah also curse the family of Ziyad and the family of Marwan.",
        "May Allah also curse the descendants of Umayyah altogether.",
        "May Allah also curse the son of Marjanah.",
        "May Allah also curse `Umar the son of Sa`d.",
        "May Allah also curse Shimr.",
        "May Allah also curse the people who saddled up, gave reins to their horses,",
        "and masked their faces in preparation for fighting against you.",
        "May my father and mother be ransoms for you.",
        "Extremely insufferable is my commiserations with you;",
        "so, I beseech Allah Who has honored your position and honored me because of you",
        "to endue me with the chance to avenge you",
        "with a (Divinely) supported leader from the Household of Muhammad,",
        "peace of Allah be upon him and his Household.",
        "O Allah, (please) make me illustrious in Your sight",
        "in the name of al-Husayn, peace be upon him, in this world and in the Hereafter.",
        "O Abu-`Abdullah,",
        "I do seek nearness to Allah, to His Messenger,",
        "to the Commander of the Faithful, to Fatimah,",
        "to al-Hasan, and to you by means of loyalty to you",
        "and by means of repudiation of those who fought against you",
        "and incurred your hostility,",
        "and repudiation of those who laid the basis of persecution and wronging against you all.",
        "I also repudiate, in the presence of Allah and His Messenger,",
        "those who laid the basis of all that,",
        "established their foundations on it,",
        "and continued in wronging and persecuting you and your adherents.",
        "In the presence of Allah and you all do I repudiate these.",
        "And I seek nearness to Allah and then to you all",
        "by means of declaring loyalty to you and to your loyalists",
        "and declaring repudiation of your enemies",
        "and those who incur animosity of you",
        "and repudiation of their adherents and followers.",
        "I am verily at peace with those who have been at peace with you,",
        "I am at war against those who fought against you,",
        "loyalist to those who have been loyalist to you,",
        "and enemy of those who have shown enmity towards you.",
        "So, I beseech Allah Who has endued me with the honor of recognizing you",
        "and recognizing your loyalists",
        "and Who conferred upon me with repudiation of your enemies,",
        "to include me with you in this world and in the Hereafter",
        "and to make firm step of honesty for me with you",
        "in this world and in the Hereafter.",
        "I also beseech Him to make me attain the praiseworthy status that you enjoy with Allah",
        "and to bestow upon me with the chance to take my own vengeance",
        "with a leader of true guidance who is (Divinely) sustained",
        "and expressing the truth from among you.",
        "I also beseech Allah in your names",
        "and in the name of the standing that you enjoy with Him",
        "to recompense me for my commiserations for you",
        "with the most favorite thing that He ever gives as compensation for misfortunes that has afflicted anyone.",
        "(Your) misfortune has been so astounding",
        "and so catastrophic for Islam",
        "and for all the heavens and the entire earth.",
        "O Allah, (please) make me in this situation of mine",
        "one of those who receive blessings, mercy, and forgiveness from You.",
        "O Allah, (please) make me live my lifetime in the same way as Muhammad and Muhammad's Household lived",
        "and make me die on the same principles on which Muhammad and Muhammad's Household died.",
        "O Allah, this day",
        "has been regarded as blessed day by the descendants of Umayyah",
        "and by the son of the liver-eater woman,",
        "the accursed and son of the accursed",
        "by the tongue of You and by the tongue of Your Prophet,",
        "Allah's peace be upon him,",
        "on every occasion and in every situation,",
        "which Your Prophet, Allah's peace be upon him, attended.",
        "O Allah, pour curses upon Abu-Sufyan, Mu`awiyah, and Yazid son of Mu`awiyah.",
        "May Your curse be upon them incessantly and everlastingly.",
        "This is the day on which the family of Ziyad and the family of Marwan gloated",
        "because they had killed al-Husayn, Allah's blessings be upon him.",
        "So, O Allah, pour frequent curses upon them",
        "and double for them the painful chastisement.",
        "O Allah, I do seek nearness to You on this day,",
        "on this occasion,",
        "and on all the days of my lifetime,",
        "by repudiating these and invoking Your curses upon them,",
        "and by declaring loyalty to Your Prophet and Your Prophet's Household,",
        "peace be upon him and them.",
        "You may then repeat the following Laan 100 times",
        "O Allah, pour curses upon the foremost persecutor",
        "who usurped the right of Muhammad and Muhammad's Household",
        "and the last follower who acceded to his deed.",
        "O Allah, pour curses upon the gang that struggled against al-Husayn",
        "and who supported each other against him, paid homage to his enemies, and participated in slaying him.",
        "O Allah, pour curses upon all of them.",
        "You may then repeat the following salam 100 times",
        "Peace be upon you, O Abu-`Abdullah",
        "and upon the souls that gathered in your courtyard.",
        "Peace of Allah be upon you from me forever",
        "as long as I am existent and as long as there are day and night.",
        "May Allah not cause this (visit) to be the last of my visit to you (all).",
        "Peace be upon al-Husayn,",
        "upon `Ali ibn al-Husayn,",
        "upon the sons of al-Husayn,",
        "and upon the companions of al-Husayn.",
        "You may then say the following",
        "O Allah, pour special curses on the foremost persecutor",
        "and begin with him first,",
        "and then pour curses on the second, the third, and the fourth.",
        "O Allah, curse Yazid fifthly,",
        "and curse `Ubaydullah ibn Ziyad, the son of Marjanah,",
        "`Umar ibn Sa`d, Shimr,",
        "the family of Abu-Sufyan, the family of Ziyad, and the family of Marwan",
        "up to the Resurrection Day.",
        "You may then prostrate yourself and say the following words",
        "O Allah, all praise be to You;",
        "the praise of those who thank You for their misfortunes.",
        "All praise be to Allah for my great misfortune.",
        "O Allah, (please) grant me the intercession of al-Husayn on the Day of Coming (to You)",
        "and make for me with You a firm step of honesty",
        "with al-Husayn and the companions of al-Husayn",
        "who sacrificed their souls in defense of al-Husayn, peace be upon him.",
        "One of the narrations state that in case one is unable to recite 100 times the complete \"Laan\" & the \"Salwaat\" - One may recite the shortened form i.e last lines of the same 100 times as under:",
        "Laan",
        "O Allah, pour curses upon all of them.",
        "Salwaat",
        "Peace be upon al-Husayn,",
        "upon `Ali ibn al-Husayn,",
        "upon the sons of al-Husayn,",
        "and upon the companions of al-Husayn."
    ]
}