{
    "id": "ziyarah-taziyah",
    "title": "Ziyarah Taziyah",
    "language": "en",
    "text": [
        "DESC: Salutation of Condolence",
        "DESC: Recited in last hours of 'Ashura Day",
        "Peace be on you, O inheritor of Adam, the select of Allah!",
        "Peace be on you, O inheritor of Noah, the prophet of Allah!",
        "Peace be on you, O inheritor of Abraham, the intimate friend of Allah!",
        "Peace be on you, O inheritor of Moses, who received direct communication from Allah!",
        "Peace be on you, O inheritor of Jesus, the Spirit of Allah!",
        "Peace be on you, O inheritor of Muhammad, the most beloved by Allah!",
        "Peace be on you, O inheritor of `Ali, the Commander of the Believers and the intimate servant of Allah!",
        "Peace be on you, O inheritor of al-Hasan, the martyr and grandson of Allah’s Messenger!",
        "Peace be on you, O son of Allah’s Messenger!",
        "Peace be on you, O son of the bringer of glad tidings and the warner",
        "and son of the chief of the prophets’ successors!",
        "Peace be on you, O son of Fatimah, the doyenne of the women of the world!",
        "Peace be on you, O Abu-`Abdullah!",
        "Peace be on you, O select of Allah and the son of His select ones!",
        "Peace be on you, O revenge of Allah and the son of His revenge!",
        "Peace be on you, O unique (in suffering tribulations) and the oppressed!",
        "Peace be on you, O guide, pure leader!",
        "and on the souls of those who presented themselves in your camp, resided in your vicinity,",
        "and came with the visitors of you.",
        "(Incessant) peace be upon you, from me, as long as I am alive and as long as there are day and night.",
        "Verily, astounding has been the calamity for us",
        "and unbearable has been the adversity for the believers, Muslims,",
        "for all the inhabitants of the heavens,",
        "and for the inhabitants of the layers of the earth.",
        "So, we are Allah’s and verily unto Him we return.",
        "And Allah’s peace, blessings, and benedictions be upon you,",
        "upon your forefathers; the pure, the pious, and the elite,",
        "and upon their offspring; the guides and well-guided.",
        "Peace be upon you O my master, upon them,",
        "upon your soul, upon their souls,",
        "upon the soil in which you are buried, and upon the soil in which they are buried.",
        "O Allah, (please do) shed over them mercy, pleasure (of You),",
        "happiness, and bounty.",
        "Peace be upon you, my master Abu-`Abdullah;",
        "O Son of the Seal of the Prophets,",
        "son of the Chief of the Prophets’ successors,",
        "and son of the doyenne of the women of the world.",
        "Peace be upon you, O martyr, son of the martyr,",
        "brother of the martyr, and father of the martyrs.",
        "O Allah, (please do) convey to him on behalf of me at this hour,",
        "on this day,",
        "at this moment,",
        "and at all time",
        "abundant greetings and salutations.",
        "Peace, mercy, and blessings of Allah be upon you,",
        "O son of the master of the nations,",
        "and upon those whom were martyred with you by such incessant greetings",
        "that endure as long as there are day and night.",
        "Peace be upon al-Husayn, the son of `Ali, the martyr.",
        "Peace be upon `Ali, the son of al-Husayn, the martyr.",
        "Peace be upon al-`Abbas, the son of the Commander of the Believers, the martyr.",
        "Peace be upon the martyrs from among the descendants of the Commander of the Believers.",
        "Peace be upon the martyrs from among the descendants of al-Hasan.",
        "Peace be upon the martyrs from among the descendants of al-Husayn.",
        "Peace be upon the martyrs from among the descendants of Ja`far and `Aqil.",
        "Peace be upon all the believers whom were martyred with them.",
        "O Allah, (please do) send blessings to Muhammad and the Household of Muhammad",
        "and convey to them abundant greetings and salutations on behalf of me.",
        "Peace be upon you, O Allah’s Messenger!",
        "May Allah confer upon you excellent consolation concerning the (tragedy) of al-Husayn, your son.",
        "Peace be upon you, O Fatimah!",
        "May Allah confer upon you excellent consolation concerning the (tragedy) of al-Husayn, your son.",
        "Peace be upon you, O Commander of the Believers!",
        "May Allah confer upon you excellent consolation concerning the (tragedy) of al-Husayn, your son.",
        "Peace be upon you, Abu-Muhammad al-Hasan!",
        "May Allah confer upon you excellent consolation concerning the (tragedy) of al-Husayn, your son.",
        "O my master, Abu-`Abdullah!",
        "I am now Allah’s and your guest",
        "and Allah’s and your neighbor!",
        "Each guest and neighbor must receive hospitality!",
        "My hospitality at this time",
        "is that you may beseech Almighty Allah",
        "to release me from Hellfire.",
        "Verily, He is Hearer of prayers, Nigh, and Responsive."
    ]
}