{
    "id": "ziyarat-arbaeen",
    "title": "Ziyarat Arbaeen",
    "language": "en",
    "text": [
        "Peace be upon the intimate servant of Allah and His most-beloved.",
        "Peace be upon the friend of Allah and His elite.",
        "Peace be upon the choice of Allah and son of His choice.",
        "Peace be upon al-Husayn the wronged and martyred.",
        "Peace be upon the captive of agonies",
        "and victim of the shed tears.",
        "O Allah, I do bear witness that he is verily Your intimate servant and son of Your intimate servant,",
        "Your choice and son of Your choice,",
        "and the winner of Your honoring.",
        "You have honored him with martyrdom,",
        "endued him with happiness,",
        "privileged him with legitimate birth,",
        "made him one of the chiefs,",
        "one of the leaders,",
        "and one of the defenders (of Your religion),",
        "gave him the inheritances of the Prophets,",
        "and chose him as argument against Your created beings and one of the Prophets’ successors.",
        "So, he called to you flawlessly,",
        "gave advices,",
        "and sacrificed his soul for You",
        "to save Your servants from ignorance",
        "and perplexity of straying off.",
        "Yet, those whom were seduced by this worldly life,",
        "who sold their share (of reward) with the lowliest and meanest,",
        "retailed their Hereafter with the cheapest price,",
        "acted haughtily, perished because of following their desires,",
        "brought to themselves Your wrath and the wrath of Your Prophet,",
        "and obeyed the dissident and hypocritical servants of You",
        "and the bearers of the burdens (of sins) who deserve Hellfire—all those supported each other against him.",
        "However, he fought against them painstakingly with steadfastness expecting Your reward",
        "until his blood was shed on account of his obedience to You",
        "and his women were violated.",
        "So, O Allah, pour heavy curses on them",
        "and chastise them with painful chastisement.",
        "Peace be upon you, O son of Allah’s Messenger.",
        "Peace be upon you, O son of the chief of the Prophets’ successors.",
        "I bear witness that you are verily the trustee of Allah and the son of His trustee.",
        "You lived with happiness,",
        "passed away with praiseworthiness,",
        "and died missed, wronged, and martyred.",
        "I also bear witness that Allah shall inevitably fulfill His promise to You,",
        "exterminate those who disappointed you,",
        "and chastise those who slew you.",
        "I also bear witness that you fulfilled your pledge to Allah",
        "and strove hard in His way until death came upon you.",
        "So, may Allah curse those who slew you.",
        "May Allah curse those who wronged you.",
        "May Allah curse the people who, when informed about that, were pleased with it.",
        "O Allah, I do ask You to witness for me that I am loyalist to those who are loyalists to him",
        "and enemy of those who are enemies of him.",
        "May my father and mother be accepted as ransoms for you, O son of Allah’s Messenger.",
        "I bear witness that you were light in the sublime loins",
        "and purified wombs;",
        "the impurities of the Ignorance Era could not object you to filth",
        "nor could its murky clothes dress you.",
        "I also bear witness that you are one of the mainstays of the religion,",
        "the supports of Muslims,",
        "and the haven of the believers.",
        "I also bear witness that you are the God-fearing, pious,",
        "pleased, immaculate,",
        "guide, and well-guided Imam.",
        "And I bear witness that the Imams from your progeny are the spokesmen of piety,",
        "the signs of guidance,",
        "the firmest handle (of Islam),",
        "and the decisive Argument against the inhabitants of the world.",
        "I also bear witness that I believe in you all and in your Return,",
        "I have full confidence in the laws of my religion and in the seals of my deeds,",
        "my heart is at peace with you all,",
        "all my affairs are based on your commands,",
        "and my support for you all is already all set",
        "until Allah permits you.",
        "So, I am with you. I am with you,",
        "not with your enemies.",
        "Allah’s blessings be upon you,",
        "upon your souls, upon your bodies,",
        "upon the present and the absent from you,",
        "and upon the apparent and the invisible from you.",
        "Respond to us, O Lord of the Worlds."
    ]
}