{
    "id": "ziyarat-ahlulbayt",
    "language": "en",
    "text": [
        "DESC: Shaykh al-Tusi, in Misbah al-Mutahajjid, and Sayyid Ibn Tawus, in Jamal al-Usbu`, have mentioned within the recommended acts on Fridays that it is recommended to visit the Ahlulbayt (as) on Fridays.",
        "DESC: Imam Ja`far al-Sadiq (peace be upon him) is reported to have said that one who intends to visit the tombs of the Holy Prophet, Imam `Ali Amir al-Mu'minin, Lady Fatimah al-Zahra', Imam al-Hasan, Imam al-Husayn, and the Holy Imams (peace be upon them all) while he is in a remote place may bathe himself on Friday, put on two clean garbs, go to a desert, - or go up to a housetop, according to another narration - and then offer a four unit prayer reciting any Surah he can recite.",
        "DESC: When he finishes the prayer, he may stand up, face the kiblah direction, and say the following:",
        "Peace be upon you, O Prophet",
        "and be upon you Allah’s mercy and blessings.",
        "Peace be upon you, O missioned Prophet,",
        "(and peace be upon you) O well-pleased successor (of the Prophet),",
        "(and peace be upon you) O grand lady,",
        "(and peace be upon you) O Luminous lady,",
        "(and peace be upon you) O two elite grandsons (of the Prophet),",
        "(and peace be upon you) O descendants—the elite signs",
        "and the well-selected trustees.",
        "Here I am devoting myself to you,",
        "to your fathers, and to your son, the Successor",
        "on the blessing of the truth.",
        "My heart is thus subservient to you",
        "and my support is prepared for you",
        "until Allah will judge about His religion.",
        "I am with you, verily with you",
        "but not with your enemy.",
        "I am one of them who believe in your superiority",
        "and I acknowledge your Return.",
        "I never deny the all-powerfulness of Allah",
        "and I do not claim but that which Allah wills.",
        "Glory be to Allah, Lord of kingdom and realm.",
        "All His creatures glorify Allah by His Names.",
        "Peace be upon your souls and your bodies.",
        "Peace and Allah’s mercy and blessings be upon you all."
    ],
    "title": "Ziyarat Ahlulbayt"
}