{
    "id": "ziyarat-jamia-kabeera",
    "language": "en",
    "text": [
        "Peace be upon you, O Household of Prophethood,",
        "location of the Divine mission,",
        "frequently visited by the angels,",
        "destination of the Divine revelation,",
        "core of mercy,",
        "treasurers of knowledge,",
        "ultimate degree of forbearance,",
        "origins of generosity,",
        "leaders of all nations,",
        "sustainers of bounties,",
        "foundations of the dutiful,",
        "pillars of the upright,",
        "maintainers of the servants (of Allah),",
        "props of the lands,",
        "doors to true faith,",
        "trustees of the All-beneficent (Allah),",
        "descendants of the Prophets,",
        "choice of the Messengers,",
        "and offspring of the select of the Lord of the worlds.",
        "Allah’s mercy and blessings, too, be upon you (all).",
        "Peace be upon the directors of right guidance,",
        "the lanterns in darkness,",
        "the patterns of piety,",
        "the owners of understanding,",
        "the endued with thought,",
        "the havens for the peoples,",
        "the inheritors of the Prophets,",
        "the perfect specimen,",
        "the most excellent call,",
        "and the arguments of Allah against the inhabitants of the world,",
        "the Hereafter, and the former world.",
        "Allah’s mercy and blessings, too, be upon you (all).",
        "Peace be upon the exponents of the recognition of Allah,",
        "the centers of Allah’s blessing,",
        "the essence of Allah’s wisdom,",
        "the keepers of Allah’s secrets,",
        "the bearers of Allah’s Book,",
        "the successors of Allah’s Prophet,",
        "and the progeny of Allah’s Messenger,",
        "may Allah send blessings upon him and his Household.",
        "Allah’s mercy and blessings, too, be upon them.",
        "Peace be upon the callers to Allah,",
        "the leaders to Allah’s pleasure,",
        "the abiders by Allah’s decree,",
        "the perfect in love for Allah,",
        "the sincere in professing Allah’s Oneness,",
        "the manifesters of Allah’s orders and prohibitions,",
        "and Allah’s honored bondmen",
        "who speak not until He has spoken",
        "and act by His command.",
        "Allah’s mercy and blessings, too, be upon them.",
        "Peace be upon the Imams, the heralds,",
        "the leaders, the guides,",
        "the chiefs, the authorities,",
        "the defenders, the protectors,",
        "the people of the Reminder (i.e. the Qur'an),",
        "the men in authority,",
        "the left ones by Allah, His select,",
        "His party, the case of His knowledge",
        "His argument, His path,",
        "His light, and His proof.",
        "Allah’s mercy and blessings, too, be upon them.",
        "I bear witness that there is no god save Allah;",
        "One and Only and having no partner with Him",
        "just as Allah has testified to His Oneness",
        "to which His angels",
        "and his knowledgeable creatures testify.",
        "There is no god save Him; the Almighty, the All-wise.",
        "I also bear witness that Muhammad is His elect servant",
        "and His approved Messenger.",
        "He sent him with right guidance and with the Religion of truth",
        "that He may cause it to prevail over all religions",
        "however much the idol-worshippers may be averse.",
        "I also bear witness that you all are the Imams, rightly guiding,",
        "well-guided, infallible,",
        "highly revered, drawn near (to Allah),",
        "pious, veracious,",
        "well-chosen, obedient to Allah,",
        "establishing His rule,",
        "putting into practice His will,",
        "and winning His honoring.",
        "He chose you on account of His (eternal) knowledge,",
        "approved of you to maintain His unseen knowledge,",
        "selected you to keep His secret,",
        "decided on you by means of His omnipotence,",
        "equipped you with His guidance,",
        "distinguished you with His clear proofs,",
        "chose you to hold His Light,",
        "supported you with His Holy spirit,",
        "and accepted you as vicegerents in His lands,",
        "arguments against His beings,",
        "supporters of His religion,",
        "keepers of His secret,",
        "hoarders of His knowledge,",
        "stores of His wisdom,",
        "interpreters of His revelation,",
        "pillars of the profession of His Oneness,",
        "witnesses on His creatures,",
        "signs for His servants,",
        "torches in His lands,",
        "and directors to His path.",
        "Allah has preserved you against slips,",
        "secured you against seditious matters,",
        "purified you from dirt,",
        "removed away from you uncleanness,",
        "and purified you with a thorough purifying.",
        "So, you have glorified His majesty,",
        "declared great His magnificence,",
        "glorified His nobility,",
        "perpetuated mentioning Him,",
        "consolidated His covenant,",
        "made firm your pledge of obedience to Him,",
        "acted sincerely to Him privately and publicly,",
        "called unto His way",
        "with wisdom and fair admonition,",
        "sacrificed yourselves for the sake of attaining His pleasure,",
        "acted patiently towards what has befallen you for His sake,",
        "performed the prayers,",
        "defrayed the poor-rate,",
        "enjoined the right,",
        "forbade the wrong,",
        "and strived in the way of Allah as exactly as striving should be",
        "until you made known His call,",
        "rendered clear His obligations,",
        "executed His provisions,",
        "propagated for the enacted laws of Him,",
        "acted out His rules,",
        "attained His pleasure through carrying out all these matters,",
        "surrendered to His will,",
        "and confirmed the truth of the past Messengers of Him.",
        "Therefore, whoever forsakes you is apostate,",
        "whoever adheres to you will attain the destination,",
        "and whoever fails to carry out the duties towards you will perish.",
        "Verily, the truth is always with you, amid you,",
        "from you, and to you.",
        "You are the people and the core of it (i.e. the truth).",
        "The inheritance of Prophethood is with you.",
        "The ultimate destination of the creatures is to you.",
        "Calling them to account is your mission.",
        "Decisive speech is with you.",
        "The verses of Allah is in your possession.",
        "His unavoidable decrees rely upon you.",
        "His light and proof are with you.",
        "His authority is to you.",
        "Whoever declares loyalty to you has in fact declared loyalty to Allah,",
        "whoever shows enmity towards you has in fact shown enmity towards Allah,",
        "whoever loves you has in fact loved Allah,",
        "whoever hates you has in fact hated Allah,",
        "and whoever holds fast to you has in fact held fast to Allah.",
        "You are the most straight path,( )",
        "the witnesses of this abode of extinction,",
        "the intercessors in the abode of permanence,",
        "the connected mercy,",
        "the stored sign,",
        "the safeguarded deposit,",
        "and the door with which people are put to test.",
        "Whoever comes to will have been saved",
        "but whoever refrains from joining you will have perished.",
        "To Allah do you invite people,",
        "towards him do you show the way,",
        "in Him do you believe,",
        "to Him do you submit,",
        "upon His command do you act,",
        "to His path do you direct,",
        "and according to His saying do you judge.",
        "Happy is he who is loyal to you,",
        "desolate is he who forsakes you,",
        "disappointed is he who denies you,",
        "straying off is he who separates himself from you,",
        "winner is he who adheres to you,",
        "secured is he who resorts to you,",
        "saved is he who gives credence to you,",
        "and rightly guided is he who takes shelter in you.",
        "As to whoever follows you, Paradise will be his abode.",
        "As to whoever dissents you, Hellfire will be his dwelling.",
        "He who denies you is unbeliever,",
        "he who makes war against you is polytheist,",
        "and he who objects to you will be in the lowest tier of the burning fire.",
        "I bear witness that all the previous was pre-decided for you",
        "and it will continue in the future;",
        "and that your souls, your light,",
        "and your form are the same;",
        "blessed and purified,",
        "and one of the other.",
        "Allah created you as lights;",
        "He then made you observe from His Throne",
        "until He endued us with the favor of your existence (among us)",
        "and then placed you in houses",
        "that He allowed to be raised",
        "and to have His Name mentioned therein.",
        "He also decided our invocation of blessings upon you",
        "and our loyalty to you",
        "to be immaculacy of our creation,",
        "purity of our souls,",
        "refinement of our manners,",
        "and forgiveness of our sins.",
        "We have thus become, with Him, of those believing in your precedence",
        "and of those known for their giving credence to you.",
        "Thus, Allah has raised you to the most principled place of the honored ones,",
        "the highest station of those drawn near to Him,",
        "and the loftiest ranks of the Messengers",
        "where none can ever reach you,",
        "nor can anyone ever surpass you,",
        "nor can anyone ever precede you,",
        "no can anyone ever look forward to reaching your positions;",
        "therefore, no archangel,",
        "commissioned Prophet,",
        "a veracious one, a martyr,",
        "a knowledgeable one, an ignorant one,",
        "an inferior, a superior,",
        "a righteous believer,",
        "a wicked sinner,",
        "an obstinate tyrant,",
        "a devilish rebel,",
        "or any other witnessing being among these classes—all of those",
        "were informed by Allah about the majesty of your issue,",
        "the importance of your standing,",
        "the greatness of your prestige,",
        "the thoroughness of your illumination,",
        "the honesty of your position,",
        "the firmness of your stance,",
        "the honor of your station and position with Him,",
        "your upstanding reputation with Him,",
        "your special position with Him,",
        "and your close location to Him.",
        "May my father, my mother,",
        "my kin, my property, and my family be ransoms for you.",
        "I beseech Allah and I beseech you all to witness for me",
        "that I believe in you all and in that in which you believe,",
        "I renounce your enemies and whatever you renounce,",
        "I am fully aware of your matter",
        "and of the deviation of those who oppose you,",
        "I am loyalist to you and to your loyalists,",
        "I hate your enemies and I show enmity towards them,",
        "I am at peace with those who make peace with you,",
        "I take the field against those who march against you,",
        "I accept as true that which you have decided as true,",
        "I prove false that which you have decided as false,",
        "I am obedient to you,",
        "I recognize your right,",
        "I confess of your superiority,",
        "I preserve your knowledge,",
        "I take refuge under your protective shelter,",
        "I profess you,",
        "I believe in your coming back (to this world),",
        "I give credence to your return,",
        "I am awaiting your issue,",
        "I am expecting your rule,",
        "I take in your sayings,",
        "I carry out your orders,",
        "I take shelter in you,",
        "I make visits to you",
        "I resort to and seek protection in your graves,",
        "I seek your intercession for me with Allah the Almighty and All-majestic,",
        "I seek nearness to Him in your names,",
        "I provide you as my means for seeking fulfillment of my desires,",
        "needs, and wishes,",
        "in all of my manners and affairs,",
        "I believe in your invisibility, visibility,",
        "presence, absence,",
        "first, and last of you;",
        "and I confide all that to you",
        "and submit to all of it with you.",
        "My heart is subservient to you,",
        "my opinion is following yours,",
        "and my support to you is all set",
        "until Allah the All-exalted restores His religion to life through you,",
        "brings you back again in His days,",
        "allows you to appear for (establishing) His justice,",
        "and gives you power to rule in His land.",
        "So, I am (always) with you, with you,",
        "but not with any one other than you.",
        "I have full faith in you,",
        "and I declare my loyalty to the last of you just as I declared it to the first of you.",
        "In the presence of Allah the Almighty and All-majestic, I repudiate",
        "your enemies,",
        "all idols, false deities,",
        "the devils, and their party who have wronged you,",
        "denied your rights,",
        "apostatized from your (divinely commissioned) leadership,",
        "usurped your inheritance,",
        "arisen doubts about you,",
        "and deviated from you,",
        "and (I repudiate) any adherence to anyone other than you,",
        "any obeyed one save you,",
        "and the leaders who call to Hellfire.",
        "May Allah make me firm forever as long as I am alive",
        "on loyalty to you,",
        "love for you, and on your religion.",
        "May He grant me success in obedience to you,",
        "endue me with your intercession,",
        "make me of the best of your loyalists",
        "who carry out all that to which you have called,",
        "and make me of those who are tracking your footsteps,",
        "taking your path,",
        "following your guidance,",
        "(and those who are) resurrected in your group,",
        "given the chance to appear again in your Return,",
        "given authority in your administration,",
        "honored to live under your sound supervision,",
        "given power in your days,",
        "and having their eyes delighted by seeing you in the morrow.",
        "May my father, mother,",
        "soul, family, and possessions be ransoms for you.",
        "Whoever desires for Allah should begin with you,",
        "whoever professes His Oneness should accept your instructions,",
        "and whoever heads for Him should make you the means to Him.",
        "O my masters, I cannot count your merits",
        "and I cannot attain the utmost of praise of you",
        "and the utmost of the description of your actual value,",
        "since you are the light of the upright ones,",
        "the guides of the pious ones,",
        "and the arguments of the Supreme Lord.",
        "With you has Allah begun creation",
        "and with you will He seal it.",
        "For your sake does He pour down rain,",
        "for your sake does He withhold the heavens from falling on the earth except by His permission,",
        "and out of consideration for you does He dismiss agonies",
        "and relieves harms.",
        "In your possession is all that which His Messengers brought down",
        "and with which His angels descended.",
        "To your forefather( ) was the Honest Spirit sent.",
        "Allah has given you that which He has not given to any one all over the worlds.",
        "All highborn ones nod down their heads before your noble lineage,",
        "all arrogant ones submit to the obedience to you,",
        "all insolent oppressors succumb to your excellence,",
        "all things are humiliated before you,",
        "the earth has been lit up with your light,",
        "and the winners have attained triumph due to their loyalty to you.",
        "Through you can the way to Paradise be taken",
        "and the ire of the All-beneficent is poured on whoever has denied your (divinely commissioned) leadership.",
        "May my father, mother,",
        "soul, family, and possessions be ransoms for you.",
        "your mention is within the mention of others.",
        "Your names are called along with other names.",
        "Your figures appear among other figures.",
        "Your souls are among other souls.",
        "Your selves are among other selves.",
        "Your traditions are among other traditions.",
        "Your graves are among other graves.",
        "But how gracious your names are!",
        "How noble your souls are!",
        "How superior your affairs are!",
        "How majestic your stations are!",
        "How dependable your covenants are!",
        "How truthful your promises are!",
        "Your words are illumination.",
        "Your affairs are (leading to) orthodoxy.",
        "Your precepts are piety.",
        "Your deeds are all good.",
        "Your habits are charity.",
        "Your nature is generosity.",
        "Your issue is truth,",
        "honesty, and lenience.",
        "Your words are judgments and decisiveness.",
        "Your views are (based upon) knowledge, temperance, and forethought.",
        "Whenever goodness is mentioned, you are its initiation,",
        "origin, branch,",
        "essence, center, and ultimate.",
        "May my father, mother, and soul be ransoms for you.",
        "How shall I describe the excellence of your merits",
        "and define the beauty of your conferrals?",
        "It is on account of you that Allah has pulled us out of degradation,",
        "removed from us the clutches of hardships,",
        "and saved us from the brink of the pit of perditions",
        "and from the Fire.",
        "May my father, mother, and soul be ransoms for you.",
        "Through our loyalty to your leadership, Allah has taught us the features of our religion",
        "and has set aright the spoiled items of our worldly lives.",
        "Through our loyalty to your leadership, the Word has been perfected,",
        "the grace has become great,",
        "and the discord has turned into alliance.",
        "Through our loyalty to your leadership, the obligatory obedience (to Allah) is accepted.",
        "To you alone are the obligatory affection,",
        "the elevated ranks,",
        "the praiseworthy standing,",
        "the renowned station with Allah the Almighty and All-majestic,",
        "the topmost prestige,",
        "the supreme station,",
        "and the admitted intercession.",
        "O our Lord, we believe in that which You have sent down",
        "and we follow the Messenger;",
        "so, write our names among those who bear witness.",
        "Our Lord, cause not our hearts to stray after You have guided us,",
        "and bestow upon us mercy from Your Presence.",
        "Lo! You, only You, are the Bestower.",
        "Glory be to our Lord",
        "for in fact the promise of our Lord immediately takes effect.",
        "O vicegerent of Allah!( )",
        "There stand between me and Allah the Almighty and All-majestic, sins",
        "that cannot be demolished except by attaining your satisfaction.",
        "Therefore, [I beseech you] in the name of the One Who has entrusted you with His secret,",
        "assigned you to supervise the affairs of His creatures,",
        "and attached the obedience to Him with the obedience to you,",
        "to (please) endue me with the favor of absolving my sins",
        "and to be my intercessors,",
        "for I am obedient to you.",
        "He who obeys you has in fact obeyed Allah,",
        "he who disobeys you has in fact disobeyed Allah,",
        "he who loves you has in fact loved Allah,",
        "and he who hates you has in fact hated Allah.",
        "O Allah, had I known interceders",
        "that are closer to You than Muhammad and his Household",
        "the virtuous and pious Imams,",
        "I would have chosen them as my intercessors.",
        "So, [I beseech You] in the name of their Right that You have made obligatory upon You,",
        "(please) include me with the group of those who recognize their Right and them",
        "and with the assembly of those who are shown mercy owing to their (i.e. Muhammad and his Household) intercession.",
        "Verily, You are the most merciful of all those who show mercy.",
        "May Allah send blessings upon Muhammad and his immaculate Household",
        "and send His thorough peace upon them.",
        "Allah is Sufficient for us! Most Excellent is He in Whom we trust."
    ],
    "title": "Ziyarat Jamia Kabeera"
}