{
    "id": "ziyarat-aimatul-momineen",
    "language": "en",
    "text": [
        "INFO: Recite this when you do Ghusl for performing the ziyarah",
        "In the Name of Allah (I begin), in Allah (I trust),",
        "in the way of Allah (I proceed),",
        "and on the creed of the Messenger of Allah.",
        "O Allah, (please do) cleanse me from the filth of sins",
        "and the dirt of defects,",
        "purify me with the water of repentance,",
        "dress me the garb of protection (against sinning),",
        "and aid me with Your compassion on account of which You may lead me to (doing) righteous deeds.",
        "You are verily the Lord of great favor.",
        "INFO: When you approach the gate of the shrine, you may say the following words",
        "All praise be to Allah Who has led me to come to His intimate servant",
        "and to visit His argument-person (against creatures)",
        "and has allowed me to enter the precinct of him (i.e. His intimate servant);",
        "thus, He has not deprived me of the opportunity to visit the tomb of him",
        "and to stay at the patio of his shrine",
        "and at the courtyard of his grave.",
        "All praise be to Allah Who has not decided for me the deprivation of that which I hope,",
        "has not prevented me against that for which I have longed",
        "and has not disappointed me as regards that which I have anticipated;",
        "rather, He has dressed me good health from Him,",
        "bestowed upon me with His grace,",
        "and granted me His honoring.",
        "INFO: If you enter the shrine, you may stop at the pure tomb and say the following words",
        "Peace be upon you, O the Imams of the believers,",
        "the chiefs of the pious,",
        "the heads of the truthful,",
        "the princes of the righteous,",
        "the leaders of the good-doers,",
        "the epitomes of the truly guided ones,",
        "the light for the cognizant,",
        "the inheritors of the Prophets,",
        "the choicest of the Prophet’s successors,",
        "the sunlight of the devout ones,",
        "the full moons of the vicegerents (of the Prophets),",
        "the (true) servants of the All-beneficent,",
        "the partners of the Qur’an,",
        "the course to the (true) faith,",
        "the essences of the realities,",
        "and the interceders for the beings.",
        "Allah’s mercy and blessings be upon you.",
        "I bear witness that You are the doors to Allah,",
        "the clues to (attaining) His mercy,",
        "the keys to His forgiveness,",
        "the clouds of His pleasure,",
        "the lanterns of the gardens of His Paradise,",
        "the carriers of His distinguishing Book,",
        "the hoarders of His knowledge,",
        "the keepers of His secret,",
        "and the place of the descent of His revelation.",
        "The trusts of prophethood are possessed by you.",
        "So are the charges of the Divine Message.",
        "You are Allah’s trustees, well-beloved,",
        "servants, and choicest ones.",
        "You are also the supporter of (the creed of) His Oneness,",
        "the pillars of glorifying Him,",
        "the callers to (the belief in) His Books,",
        "the guardians over His beings,",
        "and the custodians of His trusts.",
        "Neither the praising of the angels with all of its sincerity and reverence can precede Yours",
        "nor can any earnest suppliant and pious one compare himself to Yours.",
        "How can that be! While your hearts are these which Allah Himself has schooled with means of fear and hope for Him,",
        "made containers of thanksgiving and praising Him,",
        "secured against even accidental inattentiveness,",
        "and purified from the evil of languor.",
        "More exactly, the inhabitants of the heaves seek nearness [to Allah] through their love for you",
        "and disavowal of your enemies,",
        "and through persistent weeping for your misfortunes",
        "and imploring for Allah’s forgiveness for your adherents and supporters.",
        "I, hereby, ask Allah, my Creator, to witness for me,",
        "and I ask His angels and Prophets to witness for me, too",
        "and I ask you, too, O my masters, to witness for me",
        "that I have full faith in your (divinely commissioned) leadership,",
        "I fully believe in your Imamate,",
        "I confess of your successorship (to prophethood),",
        "I am aware of your unmatched rank,",
        "I am certain of your infallibility,",
        "I submit to your leadership,",
        "I seek nearness to Allah through my love for you",
        "and disavowal of your enemies,",
        "I know for sure that Allah has purified you from indecencies,",
        "whether open or secret,",
        "and from all suspicions, filth,",
        "all ill deeds, and ignominy.",
        "And He has granted you the pennon of the truth that whoever foregoes shall have missed the right way",
        "and whoever lags behind shall have slipped.",
        "He has imposed the obedience to you upon all beings, be them black or white.",
        "I also bear witness that you have verily fulfilled your pledge and promise to Allah",
        "and carried out all that which He stipulated on you in His Book.",
        "You also called for (following) His Path,",
        "exerted all your efforts in seeking His pleasure,",
        "led the beings to the course of Prophethood and the paths of the Divine Message,",
        "and dealt with them according to the norm of the Prophets",
        "and the customs of the Prophets’ successors.",
        "Nonetheless, none of your instructions was carried out,",
        "and none lent you any ear.",
        "So, Allah’s blessings be upon your souls and your bodies.",
        "May Allah accept my father and mother as ransoms for you, O Argument of Allah.",
        "You were certainly fed by the breast of faith,",
        "weaned on the illumination of Islam,",
        "nourished on the utter certitude,",
        "dressed the garments of infallibility,",
        "chosen and inherited the knowledge of the Book,",
        "and prompted the decisive speech.",
        "Through your position were the knowledge of the Divine Revelation and the mysteries of the interpretation (of the Qur’an) made clear.",
        "To you was the pennon of the truth delivered.",
        "You were charged with guiding the beings.",
        "To you was the pledge of Imamate given exclusively.",
        "You were assigned to preserve the religious law.",
        "I also bear witness, O my master, that you met all the qualifications of successorship,",
        "settled all your obligations as regards the obedience (to Allah),",
        "carried successfully all the burdens of Imamate,",
        "and followed the example of prophethood in endurance, exertion of all possible efforts,",
        "giving advice to the servants,",
        "suppressing your rage, and pardoning the people.",
        "You were also determined to act fairly with the creatures",
        "and to be just in all issues.",
        "You confirmed all the claims (of Allah) on the community through irrefutable proofs and through the speaking law",
        "and called to the way of Allah with wisdom and fair exhortation.",
        "You thus stood against any rise of doubt and worked on rectifying all furrows,",
        "mending the wrong, beating the stubborn evildoer,",
        "reviving the norms (of the Prophets), and annihilating the heresies",
        "until you departed this life as martyr",
        "and met the Messenger of Allah, peace be upon him and his Household, as praiseworthy.",
        "May the blessings of Allah continue on you incessantly and increasingly.",
        "INFO: You may then move to the side of the feet and say the following words",
        "O my masters! O Household of Allah’s Messenger!",
        "In your names do I seek nearness to Allah the All-majestic and All-elevated",
        "by dissenting from those who betrayed you, breached their allegiance to you,",
        "denied your leadership, renounced your position,",
        "gave up their obedience to you, abandoned the love for you,",
        "curried favor with their tyrant rulers through disavowing and rejecting you,",
        "prevented you from carrying out the religious laws, eradicating atheism,",
        "setting right the split, rejoining the scattered,",
        "meeting the deficiency, straightening the crookedness,",
        "executing the divine laws, refining Islam, and restraining sins;",
        "they stirred up the dust of wars and seditions against you,",
        "unsheathed the swords of malice against you,",
        "rent your coverings,",
        "bought wines with the khumus levy that is decided for you exclusively,",
        "and paid the alms that are decided for the poor to the clowns and jokers.",
        "All that was because of the urging practices of the licentious, the aberrant, the envious, and the oppressors;",
        "the people of breach, treachery, rebellion, and deceit;",
        "whose hearts are evil-smelling due to the filth of polytheism,",
        "and whose bodies are suffocated with the dirt of atheism.",
        "It is they who embraced hypocrisy and buckled down to dissension.",
        "So, when the Chosen Prophet, Allah’s peace be upon him and his Household, passed away, they seized the opportunity, took the occasion, and violated the sanctity.",
        "They left him bed-ridden",
        "and hurried to preach their allegiance, break the covenants that had been confirmedly taken from them,",
        "betray the Trust that had been offered to the unshakable mountains",
        "but they (i.e. the mountains) refused to undergo; rather, man, the wronging and ignorant, accepted to assume it.",
        "Man is actually dissenting, obstinate to committing grave sins,",
        "and disdaining from submission to that whose end result is praiseworthy.",
        "Hence, the lowly Bedouins and the rest of the parties (who had allied each other against the Holy Prophet) were gathered to the abode of the prophethood, Divine Message,",
        "Divine Revelation and angels,",
        "the center of the authority of the (divinely commissioned) leadership (of the Holy Imams),",
        "and the core of the Prophet’s successorship, inheritance, and Imamate.",
        "They therefore preached the covenant (that they had made) to the Chosen Prophet as regards the leadership of his brother, the sign of true guidance (namely, Imam `Ali)",
        "who alone can distinguish the path of salvation from these of perdition,",
        "and they injured the heart of the best of beings (namely, the Holy Prophet) when they oppressed and wronged his daughter; the much-loved one to him,",
        "aggrieved his dearest one; the part of his flesh and the piece of his heart,",
        "disappointed her husband, belittled him,",
        "violated his sanctities, ruptured relations of kinship with him,",
        "denied his fraternity (with the Holy Prophet), neglected his love for him,",
        "defied their (obligatory) obedience to him, denied his leadership (over them),",
        "gave even the slaves the opportunity to seize his position of leadership,",
        "and led him to swear allegiance to them under unsheathed swords and directed spears",
        "while he was extremely irritated and enormously wrathful,",
        "but very patient and self-possessed.",
        "They were asking him to swear allegiance to their rulership whose misfortune prevailed in Islam absolutely",
        "and planted sins in the hearts of the Muslims.",
        "They therefore acted insubordinately towards Salman, banished al-Miqdad,",
        "exiled Jundub, tore the abdomen of `Ammar,",
        "distorted the (true interpretation of the) Qur’an, misrepresented the religious laws, changed the place of al-maqam,",
        "gave free hand to the Released Ones to dispose of the khumus tax,",
        "set up the descendants of the accursed ones as absolute rulers over the honors and blood (of Muslims),",
        "intermixed the lawful with the unlawful,",
        "belittled faith and Islam,",
        "demolished the (Holy) Ka`bah, raided the abode of the (Holy Prophet’s) immigration on the day of al-Harrah Raid,",
        "subjected the daughters of the Emigrants and the Supporters to punishment and humiliation,",
        "caused them to dress the garments of disgrace and scandal,",
        "and allowed the suspicious people to massacre the choice Household (of the Holy Prophet),",
        "to eradicate his (i.e. the Holy Prophet) offspring, to eliminate his progeny,",
        "to capture his harem, to kill his supporters,",
        "to destroy his minbar, to turn over his object of pride,",
        "to conceal his religion, and to cut off his mention.",
        "O my masters, had the Chosen Prophet seen how the lances of the community (of him) were infixed in your hearts,",
        "how their spears were inserted into your throats,",
        "and how their swords are covered with your blood,",
        "while the sons of whores were quenching their thirst of licentiousness from your godliness,",
        "their thirst of atheism from your faith,",
        "and one of you was thrown down in the niche while his head is split by sword,",
        "another one was martyred and during his funeral procession arrows heavily stuck his coffin,",
        "another one was slain and his body was left in the wasteland while his head was raised on a spearhead,",
        "another one was enchained in the prison while fetters slept in his limbs,",
        "another one was poisoned and poison cut his intestine into parts,",
        "and your people are thus scattered; they were terminated by the slaves and the slaves’ sons!",
        "Are ordeals other than those which escorted you?",
        "Are misfortunes other than those which afflicted you?",
        "Are catastrophes other than those which affected you?",
        "Are disasters other than those which distressed you?",
        "Allah’s blessings be upon you",
        "and upon your souls and your bodies.",
        "Allah’s mercy and blessings be upon you.",
        "INFO: You may then kiss the tomb and say the following words:",
        "May Allah accept my father and mother as ransoms for you, O Household of the Chosen Prophet.",
        "We have nothing to do more than circumambulating your shrines",
        "so as to console your souls",
        "for such grave misfortunes that afflicted you",
        "and unbearable hardships that distressed you;",
        "such hardships that fixed wounds in the hearts of your adherents,",
        "installed injuries in their interiors,",
        "and implanted pains in their chests.",
        "So, we ask Allah to witness for us that we have participated with your allies and supporters",
        "who passed in time, in the bloodshed of the preachers, the wrongdoers, and the apostates",
        "and of those who slain Abu-`Abdullah the chief of the youth of Paradise, peace be upon him",
        "on that day in Karbala' yet in intentions and hearts",
        "and in feeling sorry for missing these situations that your allies and supporters witnessed and backed you.",
        "Peace from us be upon you.",
        "Allah’s mercy and blessings, too, be upon you.",
        "INFO: You may then stand between the tomb and the kiblah direction and say the following words",
        "O Allah! O Lord of the power due to which the world has been brought into existence,",
        "created, and originated under the shadow of magnificence.",
        "So, the witnesses of Your making in it have witnessed",
        "that You are Allah; there is no god save You,",
        "the Maker, Creator, and Originator of it.",
        "You have invented it from no precedent sample,",
        "on account of nothing,",
        "in nothing,",
        "not for feeling of loneliness that You may experience because there in none save You,",
        "not for any need that caused You to make it,",
        "and not for the reason that it may help You create more after it.",
        "Rather, You have formed it so that it would act as proof",
        "(on the fact) that You are too far above being made.",
        "So, the fair-minded cannot deny You",
        "and the sound knowledgeable cannot refute You.",
        "I thus beseech You by the honor of sincere belief in Your Oneness,",
        "the holiness of abidance by Your Book,",
        "and the Household of Your Prophet",
        "to send blessings upon Adam the example on Your creation, the foremost of Your Argument,",
        "the spokesman of Your omnipotence, and the representative of You on Your lands",
        "and upon Muhammad the choicest of Your choice,",
        "the evidence on the recognition of You,",
        "the profound, and the trustee on Your most hidden secrets",
        "due to Your grace that You have bestowed upon him out of Your aid;",
        "and (send blessings) upon the Prophets, the honored ones, the Prophets’ successors, and the truthful ones who came between these two;",
        "and to forgive me for the sake of this Imam, my leader.",
        "INFO: You may then put your cheek on the pure tomb and say the following supplicatory words",
        "O Allah, (I beseech You) by the position of this chief as regards his obedience to You and by the rank of him with You,",
        "do not grasp my soul suddenly, do not deprive me of repentance,",
        "make me stop at the worldly and religious matters that You have deemed forbidden,",
        "make my engagement in the affairs of my Next World distract me from the affairs of this worldly life,",
        "lead me successfully to all that which You please and like,",
        "and keep me away from following my own whims",
        "and being seduced by abortive acts and deceitful expectations.",
        "O Allah, (please do) make all my speech apposite,",
        "all my deeds correct,",
        "and all my pledges and covenants truthful and honest,",
        "add fulfillment and amiability to my oaths and promises,",
        "add righteousness and good-doing to my conduct and morals,",
        "grant me comprehensive safety,",
        "make good health encompass and include me,",
        "make Your kind making and aid direct towards me,",
        "make Your granting of success and prosperity flow towards me abundantly,",
        "make me live, O my Lord, with happiness,",
        "grasp my soul as martyr,",
        "and purify me for death and what is beyond.",
        "O Allah, add health and light to my hearing and sight,",
        "add straightness and goodness to my courses,",
        "add true guidance and insight to my belief and faith,",
        "make the Scale of deeds always before my eyes,",
        "make remembrance of You and exhortation to be my layer and cover,",
        "make ponderation and learning lessons (from others) to be my entertainment and basis,",
        "make my heart open it doors to conviction,",
        "make it the most certain thing in myself,",
        "make it prevail on my views and determinations,",
        "add true direction to my deeds,",
        "make my submission to Your decisions to be my bed and my support,",
        "and make my satisfaction with Your acts to be my utmost purpose, end result,",
        "and the furthest of my reason and intention",
        "so that I shall not fear anybody in matters appertained to my religion,",
        "I shall intend for nothing other than success in my Next Life,",
        "and I shall not hope for praise or approval for it.",
        "And (please do) make my end result to be the best of all,",
        "make my destiny to be the best of all,",
        "make my livelihood to be the most luxurious of all,",
        "lead me to the truest guidance,",
        "make my portion to be the most abundant,",
        "make my share to be the largest,",
        "and (please), O my Lord, be my guardian against all evils,",
        "my guide and leader to all decencies,",
        "and my backer and protector against all oppressors and envious ones.",
        "O Allah, to You do I resort, with You do I seek protection,",
        "in You do I trust, from You do I seek success,",
        "from You do I derive might and power,",
        "in Your hands are my life and death,",
        "under Your control are all my stillness and motions,",
        "by Your Firmest Handle do I abide, to it do I connect,",
        "on You do I rely and depend in all of my affairs,",
        "and from You do I seek salvation and redemption against the chastisement of Hell and the touch of Hellfire.",
        "So (please), decide my final house to be in the abode of Your security and honor",
        "and my success and relief to be at the hands of my masters and chiefs the Household of the Chosen Prophet.",
        "O Allah, send blessings upon Muhammad and the Household of Muhammad,",
        "forgive the believing men and women and Muslim men and women,",
        "forgive my parents, their descendants,",
        "my family members, my neighbors,",
        "and all the believing men and women for whom I concern.",
        "Verily, You are the Lord of immense favor.",
        "Peace and Allah’s mercy and blessings be upon you."
    ]
}