{
    "id": "ziyarat-al-nahiya",
    "language": "en",
    "text": [
        "Peace be upon Adam, the chosen one of Allah from among His creation.",
        "Peace be upon Seth (Shaith), the friend of Allah and His elite.",
        "Peace be upon Enoch (Idris), who established (religion) on behalf of Allah by His authority.",
        "Peace be upon Noah (Nuh), whose invocation (for punishment) was answered.",
        "Peace be upon Hud, who was assisted through Allah’s aid.",
        "Peace be upon Salih, whom Allah crowned with His generosity.",
        "Peace be upon Abraham (Ibrahim), whom Allah endowed with His friendship.",
        "Peace be upon Ishmael (Isma’il), whom Allah ransomed with a great sacrifice from His Heaven.",
        "Peace be upon Isaac (Is’haq), in whose progeny Allah placed prophethood.",
        "Peace be upon Jacob (Ya’qub), for whom Allah restored his sight by His mercy.",
        "Peace be upon Joseph (Yusuf), whom Allah rescued from the well by His majesty.",
        "Peace be upon Moses (Musa), the one for whom Allah split the sea with His Power.",
        "Peace be upon Aaron (Harun), whom Allah distinguished with his prophethood.",
        "Peace be upon Jethro (Shu’aib), whom Allah made victorious over his people.",
        "Peace be upon David (Dawud), to whom Allah turned (in mercy) after his mistake.[1]",
        "Peace be upon Solomon (Sulaiman), for whom Allah made the Jinn subservient by His majesty.",
        "Peace be upon Job (Ayyub), whom Allah cured after his (prolonged) illness.",
        "Peace be upon Jonah (Yunus), for whom Allah fulfilled the purport of His promise.",
        "Peace be upon Ezra (Uzair), whom Allah brought to life after his death.",
        "Peace be upon Zechariah (Zakariyya), who remained patient in his tribulations.",
        "Peace be upon John (Yahya), whom Allah drew near (his rank) by his martyrdom.",
        "Peace be upon Jesus (Isa), the spirit of Allah and His word.",
        "Peace be upon Muhammad, the beloved of Allah and His elite.",
        "Peace be upon the Leader of the Faithful, Ali Ibn Abi Talib, who was exclusively selected for brotherhood to him (the Prophet (PBUH&HF)).",
        "Peace be upon Fatima al-Zahra, his daughter.",
        "Peace be upon Abu Muhammad al-Hasan, the executor of (the will of) his father, and his successor.",
        "Peace be upon al-Husain, who sacrificed himself up to the last drops of the blood of his heart.",
        "Peace be upon him, who obeyed Allah secretly and openly.",
        "Peace be upon whom Allah placed a cure in the soil of his place (of martyrdom).",
        "Peace be upon the one under whose dome answer (to supplications) is guaranteed.",
        "Peace be upon the one in whose descendants are the Imams (after him).",
        "Peace be upon the son of the seal of the prophets.",
        "Peace be upon the son of the chief of the executors.",
        "Peace be upon the son of Fatima, the radiant.",
        "Peace be upon the son of Khadija, the great.",
        "Peace be upon the son of the lote-tree in the outermost boundary (of Heaven).[1]",
        "Peace be upon the son of the Garden of refuge.",
        "Peace be upon the son of Zamzam and al-Safaa.",
        "Peace be upon him, who was saturated in (his) blood.",
        "Peace be upon him, whose tents were violated.",
        "Peace be upon the fifth of the People of the Cloak.",
        "Peace be upon the loneliest of the lonely.",
        "Peace be upon the (greatest) martyr of all martyrs.",
        "Peace be upon him, who was slain by the individuals of illegitimate birth.",
        "Peace be upon the one who is at rest in Karbala.",
        "Peace be upon the one for whom the heavenly Angels wept.",
        "Peace be upon the one whose descendants are the pure.",
        "Peace be upon the chief of the religion.",
        "Peace be upon the places of the (divine) proofs.",
        "Peace be upon the Imams, the masters (of mankind).",
        "Peace be upon the bloodstained chests.",
        "Peace be upon the parched lips.",
        "Peace be upon the plucked souls.",
        "Peace be upon the snatched spirits.",
        "Peace be upon the stripped corpses.",
        "Peace be upon the pallid bodies.",
        "Peace be upon the gushing bloods.",
        "Peace be upon the dismembered limbs.",
        "Peace be upon the heads raised upon lances.",
        "Peace be upon the women (forcibly) exposed.",
        "Peace be upon the Proof of the Lord of the worlds.",
        "Peace be upon you and upon your pure ancestors.",
        "Peace be upon you and upon your martyred sons.",
        "Peace be upon you and upon your children who aided (you).",
        "Peace be upon you and upon the accompanying Angels.",
        "Peace be upon the slain and the oppressed one.",
        "Peace be upon his poisoned brother (Imam al-Hasan).",
        "Peace be upon Ali, the elder (Ali al-Akbar).",
        "Peace be upon the suckling infant (Ali al-Asghar).",
        "Peace be upon the plundered bodies.",
        "Peace be upon the family and children who were nearby (the place of martyrdom) [who were without support among strangers].",
        "Peace be upon the mangled corpses (left) in the desert.",
        "Peace be upon those who were left far from their homeland.",
        "Peace be upon those who were buried without shrouds.",
        "Peace be upon the heads severed from the bodies.",
        "Peace be upon the bereaved and the patient one.",
        "Peace be upon the oppressed one who was without a helper.",
        "Peace be upon the inhabitant of the purified soil.",
        "Peace be upon the possessor of the lofty dome.",
        "Peace be upon him, whom the Almighty purified.",
        "Peace be upon him, of whom Gabriel (Jabra’il) was proud.",
        "Peace be upon the one to whom Michael (Mika’il) spoke tenderly in the cradle.",
        "Peace be upon the one whose pact was broken.",
        "Peace be upon the one whose rights and dignity were violated.",
        "Peace be upon the one whose blood was shed unjustly.",
        "Peace be upon the one who was bathed in the blood of his wounds.",
        "Peace be upon the one who tasted the spears raining down over his body.",
        "Peace be upon the one against whom people came together and made lawful the shedding of his blood.",
        "Peace be upon the one slaughtered in public.",
        "Peace be upon the one who was buried by the strangers from (nearby) villages.",
        "Peace be upon the one whose aorta was severed.",
        "Peace be upon the defender who had no helper.",
        "Peace be upon the gray hair that was dyed (with blood).",
        "Peace be upon the cheek that struck the dust.",
        "Peace be upon the butchered body.",
        "Peace be upon the front teeth that were beaten with a rod.",
        "Peace be upon the head raised (upon a lance).",
        "Peace be upon the unclothed corpses in the desert, bitten by wild wolves[1] and around whom the beasts of prey prowled.",
        "Peace be upon you, O my master, and the Angels who flutter around your dome,",
        "surround your grave, circumambulate your courtyard, and come for your visitation.",
        "Peace be upon you! Indeed, I intended your visitation, and I am hopeful of achieving the prosperity that is with you.",
        "Salutations to you,",
        "Salutations from he who recognizes your sanctity, is a sincere (believer) in your guardianship, seeks nearness to Allah through your love, and is aloof from your enemies,",
        "Salutations from the one whose heart is wounded due to the tribulations you have suffered, and whose tears flow in your remembrance,",
        "Salutations from the one who is distressed, grief-stricken, distracted, and yielding,",
        "Salutations from the one, who, had he been present with you in that plain, would have shielded you from the sharpness of the swords with his body and sacrificed his last breath for you,",
        "would have struggled beside you, helped you against the aggressors, and redeemed you with his soul, body, wealth, and children,",
        "(Salutations from the one) whose soul is a sacrifice for yours,",
        "and whose family is a shield for yours.",
        "But as I have been hindered by the course of time and as (Allah’s) decree has prevented me from helping you,",
        "and as I could not fight those who fought you, and was not able to show hostility to those who showed hostility to you,",
        "I will, therefore, lament you morning and evening, and will weep blood in place of tears, out of my anguish for you and my sorrow for all that befell you,",
        "until I meet death from the pain of the catastrophe and the choking grief.",
        "I bear witness that you certainly established prayer, gave alms,",
        "enjoined good, forbade evil and transgression,",
        "obeyed Allah, never disobeyed Him, and held fast to Him and to His rope.",
        "Then, you pleased Him, held Him in awe, were attentive towards Him, and were responsive to Him,",
        "established the customs (of the Prophet (PBUH&HF)), extinguished turmoil (in religion),",
        "invited people to rectitude, clarified the ways of righteousness, and truly strove in the way of Allah.",
        "You were an obedient one to Allah,",
        "a follower of your grandfather, Muhammad, peace be upon him and his family,",
        "heedful of the saying of your father,",
        "quick to execute the will of your brother,",
        "an erector of the pillars of the religion, a suppressor of tyranny,",
        "an advancer on the transgressors, and a sincere exhorter for the nation,",
        "a traveler into mortal throes,",
        "a warrior against the wretched, and a maintainer of Allah’s proofs (on earth),",
        "compassionate towards Islam and Muslims,",
        "a champion of truth and most patient in adversity,",
        "a protector for the religion, and a defender of its domain.",
        "You safeguarded the right path and supported it,",
        "spread justice and promoted it,",
        "advocated the faith and manifested it,",
        "restrained and reproached the frivolous,",
        "took back (the rights) of the lowly from the privileged,",
        "and were equitable in your arbitrations between the weak and the strong.",
        "You were the springtime of the orphans, the protection of humanity, the glory of Islam,",
        "the treasure of divine laws, and a relentless ally of benevolence.",
        "You pursued the path of your grandfather and your father,",
        "resembled your brother in will,",
        "were loyal to your obligations, possessed pleasant manners,",
        "embodied generosity, and spent the darkness (of night) in prayer.",
        "You were the straightest path, the most generous of the creation, and had the brightest record.",
        "You were of great ancestry, noble descent, and lofty rank.",
        "You possessed plentiful merits, praiseworthy manners, and were abundant in endowments.",
        "You were forbearing, upright, always turning (to Allah), generous, knowledgeable, strong,",
        "a martyred Imam, grieved, repentant with earnest prayers (to Allah), dearly loved, and awesome.",
        "You were to the Messenger, peace be upon him and his family, a son,",
        "for the Quran, an authority [a savior],",
        "and for the nation, a support.",
        "You were diligent in obedience,",
        "a protector of the covenant and oath,",
        "keeping away from the paths of the debauched,",
        "sparing no effort (in fulfilling the duties),",
        "performing prolonged bowing and prostrations,",
        "abstaining from the world, like one who is departing from it,",
        "looking upon it (the world) through the eyes of one estranged (from it).",
        "Your desires from it (the world) were abstentious,",
        "your efforts were far-removed from its embellishments,",
        "your glances removed from its joys,",
        "and your desire for the hereafter was well-known,",
        "even when tyranny became wide-spread,",
        "injustice removed its veil,",
        "wickedness called upon its followers,",
        "and you were residing in the sanctuary of your grandfather,",
        "detached from the oppressors,",
        "sitting in the house and the prayer niche,",
        "unattached to (worldly) pleasures and carnal desires,",
        "and renouncing evil in your heart and on your tongue to the extent of your strength and ability.",
        "Then the knowledge demanded you for disavowal (of falsehood),",
        "and made it incumbent on you to struggle against the deviant.",
        "Therefore, you set out in company of your children, kinsfolk, followers, and supporters,",
        "disclosed the truth and clear proofs,",
        "summoned people towards Allah with wisdom and fine exhortation,",
        "ordered the establishment of the limits of divine law, and the obedience to the One Who should be worshipped,",
        "and forbade (people) from wickedness and oppression.",
        "But, they confronted you with injustice and aggression.",
        "Therefore, you resisted them after advising them and stressing over (divine) proofs against them.",
        "However, they violated your (divine) rights and oath.",
        "angered your Lord and your grandfather,",
        "and initiated battle against you.",
        "Hence, you stood firm to spear and strike,",
        "pulverized the soldiers of the transgressors, and stormed (courageously) into the dust of the battle,",
        "fighting with Thulfaqar[1] as if you were Ali, the chosen one.",
        "So when they saw you firm, fearless, and courageous,",
        "they set up their most malicious deceptions against you, and fought you with their deceit and viciousness.",
        "The accursed one (Umar Ibn Sa’d) commanded his soldiers, and thus, they prevented you from reaching or receiving water.",
        "They rushed to engage you in combat, descended swiftly upon you,",
        "showering you with arrows and stones,",
        "and moving towards you with uprooting hands.",
        "Neither they respected your rights, nor were they mindful of retribution for slaying you and your companions, and plundering your belongings.",
        "You were in the front line of the storm (of battle), enduring afflictions.",
        "Indeed, the angels of the heavens were astonished by your patience.",
        "The enemy then surrounded you from all sides,",
        "weakened you by inflicting wounds,",
        "prevented you from taking any repose,",
        "and you had no helper remaining.",
        "You were bereaved yet patient,",
        "defending your women and children,",
        "until they caused you to fall from your horse.",
        "You fell to the ground, wounded,",
        "horses trampled you with their hooves,",
        "tyrants raised their swords against you,",
        "the sweat of death appeared on your forehead,",
        "and you continually clenched and unclenched your hands,",
        "secretly gazing upon your caravan and tents,",
        "while trapped by yourself away from your children and family.",
        "(At that time,) your horse distractedly galloped towards your camp, neighing and crying.",
        "When the women saw your horse distraught,",
        "and observed your saddle contorted,",
        "they came from the tents,",
        "disheveling their hair,",
        "striking their now unveiled cheeks,",
        "calling you by lamenting and wailing,",
        "being humiliated after being honored,",
        "hastening to where you lay wounded.",
        "At that time Shimr (L) was sitting on your chest,",
        "quenching his sword with (the blood of) your throat,",
        "grabbing your beard with his hand,",
        "as he slew you with his sword.",
        "Your faculties faded,",
        "your breath became shallow and ceased,",
        "and your head was raised onto a spear.",
        "Your family were captured like slaves,",
        "bound with iron chains atop camels,",
        "with midday heat scorching their faces.",
        "They were driven across deserts and wastelands,",
        "with their hands chained to their necks,",
        "and were paraded around the markets.",
        "Woe be unto the wicked transgressors!",
        "Certainly, by killing you, they have killed Islam,[1]",
        "disrupted (the truth of) prayer and fasting,",
        "revoked the (prophetic) customs and the (divine) laws,",
        "destroyed the pillars of faith,",
        "distorted the verses of the Quran,",
        "and brutally rushed into tyranny and aggression.",
        "Certainly, (by this event,) the Messenger of Allah (PBUH&HF)was wronged, left alone, and denied vengeance,",
        "the Book of Allah, the mighty and the majestic, was again abandoned,",
        "truth was betrayed when you were forcibly overcome,",
        "And with your loss, call for Allah’s glorification and His Unity,",
        "His prohibitions, sanctions, revelation, and interpretation were lost.",
        "After you, alteration, distortion, infidelity, abandonment (of the Islamic laws), vagary, misguidance, turmoil and falsehood became prevalent.",
        "The announcer of your martyrdom came near the grave of your grandfather, the Messenger (PBUH&HF),",
        "gave the news to him with tears flowing, saying:",
        "0 the Messenger of Allah! Your brave grandson was slain,",
        "and abuse of your family and supporters were deemed lawful.",
        "After you, your progeny were captured,",
        "and adversity befell your family and your offspring.",
        "Indeed, the Messenger (PBUH&HF) became distressed and his depressed heart wept,",
        "The Angels and the prophets offered their condolences to him for your martyrdom,",
        "Your mother, al-Zahra, became distressed and bereft of you,",
        "Legions of favored Angels came in waves to offer their condolences to your father, the Leader of the Faithful,",
        "Mourning commemorations were held for you in the utmost exalted place Heaven,",
        "and the dark-eyed Maidens (of Paradise) hit their own heads and faces in grief,",
        "The skies and their inhabitants wept,",
        "as did Paradise and its keepers,",
        "the mountains and their surroundings,",
        "the oceans and their fishes,",
        "the heavens and their servants,",
        "the House (Ka'ba), and the Station (of Abraham),",
        "the Sacred Monument,",
        "and Mecca and its sanctuary.",
        "INFO: The Ziarat continue in the form of a prayer",
        "O Allah! By the sanctity of this exalted place (the tomb of Imam al-Husain (PBUH)),",
        "bestow blessings upon Muhammad and the family of Muhammad,",
        "assemble me in their company,",
        "and admit me to Paradise by their intercession.",
        "My Allah! I implore You, O He who is the quickest of the reckoners!",
        "O the most generous of the generous and the wisest of judges!",
        "By Muhammad, the seal of the prophets, Your Messenger to all the worlds,",
        "By his brother and cousin, the uprooter of hidden polytheism, the distinguished and learned, Ali, the Prince of the Faithful,",
        "By Fatima, the chief of women of the worlds,",
        "By al-Hasan, the purified one and the protection of the pious,",
        "By Abi Abdillah, al-Husain, the most honored martyr,",
        "By his slain children and oppressed family,",
        "By Ali Ibn al-Husain, the ornament of the worshippers,",
        "By Muhammad Ibn Ali, the direction of those who turn to Allah,",
        "By Ja’far Ibn Muhammad, the most truthful,",
        "By Musa Ibn Ja’far, the discloser of the proofs,",
        "By Ali Ibn Musa, the helper of the religion,",
        "By Muhammad Ibn Ali, the exemplar of those who accepted guidance,",
        "By Ali Ibn Muhammad, the most ascetic,",
        "By Hasan Ibn Ali, the inheritor of the appointed ones,",
        "By the Proof upon all creation (al-Mahdi),",
        "Bless Muhammad and the family of Muhammad,",
        "the most truthful and devoted ones (who are) the family ofTaha and Yasin,[1]",
        "and place me on the Day of Judgment among those who are safe, confident,",
        "triumphant, happy, and felicitous.",
        "O Allah! Destine me to be amongst the submitters,",
        "Join me with the righteous,[1]",
        "Ordain for me (offspring with) truthful tongue among the last generation,[2]",
        "Make me victorious over the transgressors,",
        "Suffice me the deception of the envious,",
        "Turn away from me the evil plans of the schemers,",
        "Hold back from me the hands of the oppressors,",
        "Gather me with the blessed masters in the utmost exalted place of Heaven,",
        "along with whom You have bestowed favor, from among the prophets, the truthful, the martyrs, and the righteous,[]",
        "By Your mercy, O the most merciful of the merciful.",
        "INFO: The dua continues",
        "O Allah! I implore You by Your infallible Prophet,",
        "by Your definite judgment, and Your concealed preventive wisdom,",
        "by this grave which is the place of congregation and in which lies the infallible Imam, the slaughtered, and the oppressed,",
        "that You dispel from me all that grieves me,",
        "divert from me the harm of the decisive foreordained plan,",
        "and give me refuge from the Hellfire with scorching winds.",
        "My Allah! Honor me with Your bounties,",
        "Make me content with Your apportionment,",
        "Encompass me with Your munificence and generosity,",
        "And keep me far off from Your requital scheme and Your wrath.",
        "O Allah! Protect me from errors,",
        "Make me firm in speech and action,",
        "Extend for me the period (of life),",
        "Relieve me from pain and ailments,",
        "Make me achieve, through my masters and Your grace, the best of wishes.",
        "O Allah! Bless Muhammad and the family of Muhammad and accept my repentance and my return,",
        "Have mercy upon my weeping,",
        "Lessen my lapses,",
        "Relieve my distress,",
        "Forgive me my mistake,",
        "And improve my (righteousness) through my children.",
        "My Allah! Do not leave for me, in this exalted and honored place of martyrdom, any sin but that You forgive,",
        "Nor any defect but that You conceal,",
        "Nor any grief but that You remove,",
        "Nor any sustenance but that You extend,",
        "Nor any (spiritual) status but that You cause to prosper,",
        "Nor any corruption but that which You correct,",
        "Nor any wish but that You fulfill,",
        "Nor any supplication but that You answer,",
        "Nor any pressure but that You relieve,",
        "Nor any dispersed (believers) but that You reunify,",
        "Nor any matter but that You complete,",
        "Nor any wealth but that You increase,",
        "Nor any character but that You improve,",
        "Nor any charity but that You repay,",
        "Nor any condition but that You cause to improve,",
        "Nor any envious (one) but that You suppress,",
        "Nor any enemy but that You destroy,",
        "Nor any evil but that You suffice,",
        "Nor any ailment but that You cure,",
        "Nor any distant (one) but that You bring near,",
        "Nor any scattering but that You reunite,",
        "Nor any request but that You grant.",
        "O Allah! I ask You for the goodness of this transitory world,",
        "and the reward of the hereafter.",
        "O Allah! Suffice me with what You made lawful from the unlawful,",
        "and with Your grace from all other creatures.",
        "My Allah! I ask You for beneficial knowledge,",
        "a humble heart,",
        "unequivocal certitude,",
        "pure action,",
        "beautiful patience,",
        "and a bountiful reward.",
        "O Allah! Grant me gratitude of Your blessing upon me,",
        "Increase Your favor and munificence on me,",
        "Make my speech amongst people effective,",
        "my deeds elevated and worthy of being delivered to You,",
        "my righteous works followed (by others),",
        "and my enemy quelled,",
        "O Allah! Send blessings upon Muhammad and the family of Muhammad, the best of the creations, day and night,",
        "Spare me from the evil of the wicked,",
        "Purify me from sins and burdens,",
        "Give me refuge from Hell-fire,",
        "Settle me in the House of rest (Paradise),",
        "And forgive me and all my faithful brothers and sisters,",
        "By Your mercy, O the most merciful of the merciful!"
    ],
    "title": "Ziyarat al-Nahiya"
}