{
    "id": "ziyarat-jamia-saghira",
    "language": "en",
    "text": [
        "Peace be upon Allah's friends and well-chosen ones!",
        "Peace be upon Allah's trustees and beloved ones!",
        "Peace be upon Allah's supporters and representatives!",
        "Peace be upon the centers of the recognition of Allah!",
        "Peace be upon the places of mentioning Allah!",
        "Peace be upon the demonstrators of Allah's orders and prohibitions!",
        "Peace be upon the callers to Allah!",
        "Peace be upon those settling down at Allah's pleasure!",
        "Peace be upon those obeying Allah sincerely!",
        "Peace be upon those guiding to Allah!",
        "Peace be upon those the loyalty to whom is loyalty to Allah,",
        "the hostility towards whom is hostility towards Allah,",
        "the recognition of whom is recognition of Allah,",
        "ignorance of whom is ignorance of Allah,",
        "sticking to whom is sticking to Allah,",
        "and abandonment of whom is abandonment of Allah the Almighty and All-majestic.",
        "And I call Allah to witness that I am at peace with those with whom you are at peace",
        "and at war with those with whom you are at war.",
        "I believe in your secret and open affairs",
        "and I am relegating all that to you.",
        "May Allah curse the enemy of Muhammad's Household,",
        "including the jinn and mankind,",
        "and I disavow them in the presence of Allah.",
        "May Allah bless Muhammad and his Household.",
        "INFO: You may then invoke Almighty Allah’s blessings upon the Holy Prophet and his Household, by mentioning their names respectively. You may also invoke Almighty Allah’s curse on their enemies and then pray Him for any thing you wish for yourself as well as the believing men and women.",
        "INFO: In the last paragraph of the tradition, the Imam (as) has ordered us to invoke blessings upon the Holy Prophet Muhammad (صلى الله عليه وآله وسلم) and his Household and to mention their names one after another."
    ]
}