{
    "id": "ziyarat-rajabiyah-at-shrines",
    "language": "en",
    "text": [
        "All praise be to Allah Who has allowed us to visit the shrine of His Saints in Rajab",
        "and made obligatory upon us fulfilling our duties towards them.",
        "May Allah send blessings to Muhammad, the divinely selected,",
        "and upon his Successors—the doors to Him.",
        "O Allah, just as You have allowed us to visit their shrines,",
        "please do fulfill for us the promises You have made with them,",
        "include us with them,",
        "and include us with those whom shall not be prevented from drinking from the (Divine) Pool",
        "in the abode of eternity and perpetuity.",
        "Peace be upon you all.",
        "I have turned my face towards you and directed to you",
        "carrying my request and need with me,",
        "which is the release of my neck from Hellfire",
        "and the settlement with you in the Abode of Final Settlement",
        "with your pious adherents (Shi`ah).",
        "Peace be upon you all for that you persevered in patience.",
        "Now how excellent is the final home!",
        "I hereby beg you and put my hope in you as regards the matters in which you have the right to act",
        "and recompense.",
        "Truly, through you only are the hopeless restored to good condition,",
        "the ailed healed,",
        "and that which the wombs absorb and that which they grow.",
        "Verily, I have full faith in your Secret",
        "and I am fully submissive to your words;",
        "I thus beg you in the name of Allah",
        "to make me return having my requests responded,",
        "met, accepted,",
        "given success, and settled,",
        "and set aright all my needs and all my affairs towards you.",
        "Peace be upon you from one who bids you farewell",
        "and puts all his needs with you,",
        "praying to Allah for another visit to you,",
        "since his hope is never cut off from you.",
        "I also pray Him to make my departure successful",
        "to a productive place,",
        "a fruitful area,",
        "comfort, and luxurious up to the befalling of death.",
        "I also pray Him for the best destiny and abode in the Eternal Bliss,",
        "the affluent living,",
        "the perpetual fruit,",
        "the drinking from the pure drink,",
        "and the divine spring whose drink is refreshing and thirst-quenching that is never bored or fed up.",
        "Allah’s mercy, blessings, and salutations be upon you incessantly",
        "until I return to your presence",
        "and win the honor of visiting you again",
        "and the honor of being resurrected with your group.",
        "Allah’s mercy, blessings, benedictions, and salutations be upon you,",
        "for Allah alone is Sufficient for us! Most Excellent is He in Whom we trust!"
    ]
}