{
    "id": "eid-al-mubahila",
    "title": "Eid al-Mubahila",
    "language": "ar",
    "text": [
        "INFO: Narration 1",
        "DESC: 💠 Description",
        "DESC: It's reported by Sayyed ibn Tawus from Imam Sadiq (as)",
        "DESC: 💠 Method",
        "DESC: • It's a 2 rakah prayer,",
        "DESC: • In each rakah Recite [Sura Fatiha](Quran:1),",
        "DESC: • then 10 times [Sura Ikhlaas](Quran:112),",
        "DESC: • then 10 times [Ayat al-Kursi](Quran:2:255),",
        "DESC: • then 10 times [Sura Qadr](Quran:97)",
        "INFO: Narration 2",
        "DESC: 💠 Description",
        "DESC: It's reported by Sayyed ibn Tawus",
        "DESC: 💠 Method",
        "DESC: • It's a 2 rakah prayer,",
        "DESC: • In each rakah Recite [Sura Fatiha](Quran:1),",
        "DESC: • then any surah,",
        "DESC: • then 70 times \"Astaghfirullah\",",
        "DESC: • then say this dua,",
        "الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ‌ فاطِرِ السَّماواتِ وَ الْأَرْضِ‌ وَ الْحَمْدُ لِلَّهِ الَّذِي‌ لَهُ ما فِي السَّماواتِ وَ الْأَرْضِ‌",
        "وَ الْحَمْدُ لِلَّهِ الَّذِي خَلَقَ السَّماواتِ وَ الْأَرْضَ وَ جَعَلَ الظُّلُماتِ وَ النُّورَ",
        "الْحَمْدُ لِلَّهِ الَّذِي عَرِّفْنِي مَا كُنْتُ بِهِ جَاهِلًا وَ لَوْ لَا تَعْرِيفُكَ إِيَّايَ لَكُنْتُ مِنَ الْهَالِكِينَ",
        "إِذْ قُلْتَ وَ قَوْلُكَ الْحَقُ‌ قُلْ لا أَسْئَلُكُمْ عَلَيْهِ أَجْراً إِلَّا الْمَوَدَّةَ فِي الْقُرْبى‌ فَبَيَّنْتَ لِيَ الْقَرَابَةَ",
        "وَ قُلْتَ‌ إِنَّما يُرِيدُ اللَّهُ لِيُذْهِبَ عَنْكُمُ الرِّجْسَ أَهْلَ الْبَيْتِ وَ يُطَهِّرَكُمْ تَطْهِير",
        "اً فَبَيَّنْتَ لِيَ الْبَيْتَ بَعْدَ الْقَرَابَةِ ثُمَّ قُلْتَ وَ قَوْلُكَ الْحَقُّ بِتَفَضُّلِكَ عَلَى خَلْقِكَ وَ أَرَدْتَ مَعْرِفَتَهُمْ بِالْبَيْتِ وَ الْقَرَابَةِ",
        "فَقُلْتَ وَ قَوْلُكَ الْحَقُ‌ فَقُلْ تَعالَوْا نَدْعُ أَبْناءَنا وَ أَبْناءَكُمْ وَ نِساءَنا وَ نِساءَكُمْ‌ وَ أَنْفُسَنا وَ أَنْفُسَكُمْ ثُمَّ نَبْتَهِلْ فَنَجْعَلْ لَعْنَتَ اللَّهِ عَلَى الْكاذِبِينَ‌ مِنْ بَعْدِ ذَلِكَ",
        "فَلَكَ الشُّكْرُ يَا رَبِّ وَ لَكَ الْمَنُّ حَيْثُ هَدَيْتَنِي وَ أَرْشَدْتَنِي حَتَّى لَمْ يَخْفَ عَلَيَّ الْأَهْلُ وَ الْبَيْتُ وَ الْقَرَابَةُ حَتَّى عَرَّفْتَنِي نِسَاءَهُمْ وَ أَوْلَادَهُمْ وَ رِجَالَهُمْ",
        "اللَّهُمَّ إِنِّي أَتَقَرَّبُ إِلَيْكَ بِذَلِكَ الْمَقَامِ الَّذِي لَا يَكُونُ أَعْظَمَ فَضْلًا لِلْمُؤْمِنِينَ وَ لَا أَكْثَرَ رَحْمَةً بِمَعْرِفَتِكَ إِيَّاهُمْ وَ إِخْرَاجِهِمْ عَنِ الشُّبُهَاتِ فَلَوْ لَا هَذَا",
        "الْمَقَامُ الْمَحْمُودُ الَّذِي أَنْقَذْتَنَا وَ دَلَلْتَنَا إِلَى اتِّبَاعِ الْمُحَقِّقِينَ مِنْ أَهْلِ بَيْتِ نَبِيِّكَ وَ عِتْرَتِهِ",
        "[الصَّادِقِينَ عَنْكَ الَّذِينَ عَصَمْتَهُمْ مِنْ لَغْوِ الْمَقَالِ وَ مَدَانِسِ الْأَفْعَالِ لِخَصْمِ أَهْلِ الْإِسْلَامِ وَ ظَهَرَتْ كَلِمَةُ أَهْلِ الْإِلْحَادِ وَ فِعْلِ أُولِي الْعِنَادِ]",
        "فَلَكَ الْحَمْدُ وَ الْمَنُّ وَ الشُّكْرُ عَلَى نَعْمَائِكَ وَ أَيَادِيكَ",
        "اللَّهُمَّ فَصَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ الَّذِينَ افْتَرَضْتَ عَلَيْنَا طَاعَتَهُمْ وَ ثَبِّتْنَا بِالْقَوْلِ الَّذِي عَرَّفُونَا",
        "وَ اجْزِ مُحَمَّداً وَ آلَهُ عَلَيْهِمُ السَّلَامُ مِنَّا أَفْضَلَ الْجَزَاءِ وَ أَدْخِلْنَا فِي شَفَاعَتِهِمْ دَارَ كَرَامَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ",
        "اللَّهُمَّ هَؤُلَاءِ أَهْلُ الْكِسَاءِ وَ الْعَبَاءِ يَوْمَ الْمُبَاهَلَةِ وَ مَنْ دَخَلَ مِنَ الْإِنْسِ وَ الْمَلَائِكَةِ الْمُقَرَّبِينَ اجْعَلْهُمْ شُفَعَاءَنَا",
        "أَسْأَلُكَ بِحَقِّ ذَلِكَ الْمَقَامِ أَنْ تَغْفِرَ لِي وَ تَرْحَمَنِي وَ تَتُوبَ عَلَيَ‌ إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ‌",
        "اللَّهُمَّ إِنِّي أُشْهِدُكَ أَنَّ أَرْوَاحَهُمْ وَ طِينَتَهُمْ وَاحِدَةٌ وَ هُمُ الشَّجَرَةُ الَّتِي طَابَ أَصْلُهَا وَ أَغْصَانُهَا وَ أَوْرَاقُهَا",
        "اللَّهُمَّ فَارْحَمْنَا بِحَقِّهِمْ فَإِنَّكَ أَقَمْتَهُمْ حُجَجاً عَلَى خَلْقِكَ وَ دَلَائِلَ عَلَى مَا يُسْتَدَلُّ بِوَحْدَانِيَّتِكَ وَ بَاباً إِلَى الْمُعْجِزَاتِ بِعِلْمِكَ الَّذِي يَعْجِزُ عَنْهُ الْخَلْقُ غَيْرُهُمْ",
        "وَ أَنْتَ الْمُتَفَضِّلُ عَلَيْهِمْ حَيْثُ أَقَمْتَهُمْ مِنْ بَيْنِ خَلْقِكَ وَ نَقَلْتَهُمْ مِنْ عِبَادِكَ فَجَعَلْتَهُمْ مُطَهَّرِينَ أُصُولًا وَ فُرُوعاً وَ مَثْبَتاً [مُبِيناً]",
        "ثُمَّ أَكْرَمْتَهُمْ بِنُورِكَ حَتَّى فَضَّلْتَهُمْ مِنْ بَيْنِ أَهْلِ زَمَانِهِمْ وَ الْأَقْرَبِينَ إِلَيْهِمْ فَخَصَصْتَهُمْ بِوَحْيِكَ وَ أَنْزَلْتَ عَلَيْهِمْ كِتَابَكَ وَ أَمَرْتَنَا بِالتَّمَسُّكِ بِهِمَا",
        "اللَّهُمَّ فَإِنَّا قَدْ تَمَسَّكْنَا بِكِتَابِكَ وَ بِعِتْرَةِ نَبِيِّكَ الَّذِينَ أَقَمْتَهُمْ لَنَا دَلِيلًا وَ عَلَماً وَ أَمَرْتَنَا بِاتِّبَاعِهِمْ",
        "اللَّهُمَّ إِنَّا قَدْ تَمَسَّكْنَا فَارْزُقْنَا شَفَاعَتُهُمْ حِينَ يَقُولُ الْخَاطِئُونَ‌ فَما لَنا مِنْ شافِعِينَ وَ لا صَدِيقٍ حَمِيمٍ‌",
        "اللَّهُمَّ اجْعَلْنَا مِنَ الصَّادِقِينَ [بِهِمْ‌] وَ المنظرين [وَ الْمُنْتَظِرِينَ‌] لِشَفَاعَتِهِمْ وَ لَا تُضِلَّنَا بَعْدَ إِذْ هَدَيْتَنَا آمِينَ رَبَّ الْعَالَمِينَ"
    ]
}