{
    "id": "tahajjud---salatul-layl",
    "title": "Tahajjud - Salatul Layl",
    "language": "ar",
    "text": [
        "DESC: Night Prayer To be offered after Midnight. It consists up of 11 Rak’ats.",
        "INFO: Nawafilatul-Layl x 4",
        "DESC: The first 8 Rak’ats are prayed as normal (like Fajr) in pairs of 2 Rak’ats each with the niyyah of \"Nawafilatul-Layl\"",
        "INFO: Salatul Shif’a",
        "DESC: The next 2 Rak’ats are prayed (like Fajr) with the Niyyah of \"Salatul Shif’a\"",
        "INFO: Salatul Witr",
        "DESC: The remaining 1 Rak’at is prayed (as below) with the Niyyah of \"Salatul Witr\"",
        "DESC: After Niyyah and say Takbiratul Ihram Recite the following surah:-",
        "DESC: • [Surah Al-Hamd](Quran:1) - Once",
        "DESC: • [Surah Ikhlas](Quran:112) - three times",
        "DESC: • [Surah Falaq](Quran:113) - once",
        "DESC: • [Surah Naas](Quran:114) - once",
        "DESC: Say Takbir and raise hands for Qunoot and You may recite any Dua or Rabbana or the following",
        "لآ اِلَهَ اِلاَّ اللّهُ الْحَلِيْمُ الْكَرِيْمُ",
        "لآ اِلَهَ اِلاَّ اللّهُ الْعَلِيُّ الْعَظِيْمُ",
        "سُبْحَانَ اللّهِ رَبِّ السَّمَاوَاتِ السَّبْعِ",
        "وَ رَبِّ الاَرْضِيْنَ السَّبْعِ",
        "وَ مَا فِيْهِنَّ وَ مَا بَيْنَهُنَّ وَ",
        "رَبُّ الْعَرْشِ الْعَظِيْمِ",
        "وَ الْحَمْدُ لِلّهِ رَبِّ الْعَالَمِيْنَ",
        "DESC: Then, pray for forgiveness of 40 people who are either dead or living in the following manner:",
        "...اَللّهُمَّ اغْفِرْ ل",
        "DESC: Continuing with the Qunoot, recite the Istighfar 70 times:",
        "اَسْتَغْفِرُ اللّهَ رَبِّي وَ اَتُوْبُ اِلَيْهِ",
        "DESC: Still continuing qunoot, recite the following Dua 7 times:",
        "هذَا مَقَامُ الْعَآئِذِ بِكَ مِنَ النَّارِ",
        "DESC: Continuing qunoot yet further , recite 300 times:",
        "اَلْعَفْوَ",
        "DESC: Finally, the following should be said once:",
        "رَبِّ اغْفِرْ لِي وَ ارْحَمْنِي وَ تُبْ عَلَيَّ اِنَّكَ اَنْتَ التَّوَّابُ الرَّحِيْمُ",
        "DESC: Complete the Rukuh and Sujood and end the prayer with Salaam",
        "DESC: • Recite Tasbih of Syeda Fatemah Zahra (peace be upon her); 34 times - Allahu Akbar, 33 times - Al-Hamdu Lillah, 33 times - Subhanallah",
        "DESC: • Followed by Sajdah of Shukr. reciting 5 times:",
        "سُبُّوحٌ قُدُّوسٌ رَبُّ الْمَلاَئِكَةِ وَالرُّوحِ",
        "DESC: • Next, recite [Ayatul Kursi](Quran:2:255)",
        "DESC: • Finally, for the second time, perform Sajdah of Shukr reciting 5 times:",
        "سُبُّوحٌ قُدُّوسٌ رَبُّ الْمَلاَئِكَةِ وَالرُّوحِ"
    ]
}