{
    "id": "eid-al-ghadeer---from-iqbal-amaal",
    "title": "Eid al-Ghadeer - from Iqbal Amaal",
    "language": "ar",
    "text": [
        "INFO: After Ghusl and wearing clothes",
        "اللَّهُمَّ إِنَّ هَذَا الْيَوْمَ الَّذِي شَرَّفْتَنَا فِيهِ بِوَلَايَةِ وَلِيِّكَ عَلِيٍّ صلوات لله عليه",
        "وَ جَعَلْتَهُ أَمِيرَ الْمُؤْمِنِينَ",
        "وَ أَمَرْتَنَا بِمُوَالاتِهِ وَ طَاعَتِهِ",
        "وَ أَنْ نَتَمَسَّكَ بِمَا يُقَرِّبُنَا إِلَيْكَ",
        "وَ يُزْلِفُنَا لَدَيْكَ أَمْرُهُ وَ نَهْيُهُ",
        "اللَّهُمَّ قَدْ قَبِلْنَا أَمْرَكَ وَ نَهْيَكَ",
        "[وَ سَمِعْنَا] وَ أَطَعْنَا لِنَبِيِّكَ",
        "وَ سَلَّمْنَا وَ رَضِينَا",
        "فَنَحْنُ مَوَالِي عَلِيٍّ صلوات لله عليه وَ أَوْلِيَائِهِ كَمَا أَمَرْتَ نُوَالِيهِ",
        "وَ نُعَادِي مَنْ يُعَادِيهِ",
        "وَ نَبْرَأُ مِمَّنْ يَبْرَأُ مِنْهُ",
        "وَ نُبْغِضُ مَنْ أَبْغَضَهُ",
        "وَ نُحِبُّ مَنْ أَحَبَّهُ",
        "وَ عَلِيٌّ صَلَّى اللَّهُ عَلَيْهِ مَوْلَانَا كَمَا قُلْتَ وَ إِمَامُنَا بَعْدَ نَبِيِّنَا صَلَّى اللَّهُ عَلَيْهِ وَ آلِهِ كَمَا أَمَرْتَ",
        "INFO: For Almighty Allah’s protection against Satan",
        "DESC: From the Holy Prophet (saww) as cited by Sayyed ibn Tawus in Iqbal",
        "بسم الله الرحمن الرحيم",
        "بِسْمِ اللَّهِ خَيْرِ الْأَسْمَاءِ بِسْمِ اللَّهِ رَبِّ الْآخِرَةِ وَ الْأُولَى وَ رَبِّ الْأَرْضِ وَ السَّمَاءِ",
        "ذِي لَا يَضُرُّ مَعَ اسْمِهِ كَيْدُ الْأَعْدَاءِ وَ بِهَا تُدْفَعُ كُلُّ الْأَسْوَاءِ وَ بِالْقَسَمِ بِهَا يُكْفَى مَنِ اسْتَكْفَى",
        "اللَّهُمَّ أَنْتَ رَبُّ كُلِّ شَيْ‌ءٍ وَ خَالِقُهُ وَ بَارِئُ كُلِّ مَخْلُوقٍ وَ رَازِقُهُ",
        "وَ مُحْصِي كُلِّ شَيْ‌ءٍ وَ عَالِمُهُ، وَ كَافِي كُلِّ جَبَّارٍ وَ قَاصِمُهُ",
        "وَ مُعِينُ كُلِّ مُتَوَكِّلٍ عَلَيْهِ وَ عَاصِمُهُ وَ بِرُّ كُلِّ مَخْلُوقٍ وَ رَاحِمُهُ",
        "لَيْسَ لَكَ ضِدٌّ فَيُعَانِدُكَ [فيعادك‌] وَ لَا نِدٌّ فَيُقَاوِمُكَ وَ لَا شَبِيهٌ فَيُعَادِلُكَ",
        "تَعَالَيْتَ عَنْ ذَلِكَ عُلُوّاً كَبِيراً",
        "اللَّهُمَّ بِكَ اعْتَصَمْتُ وَ اسْتَقَمْتُ وَ إِلَيْكَ تَوَجَّهْتُ وَ عَلَيْكَ اعْتَمَدْتُ",
        "يَا خَيْرَ عَاصِمٍ وَ أَكْرَمَ رَاحِمٍ وَ أَحْكَمَ حَاكِمٍ وَ أَعْلَمَ عَالِمٍ",
        "مَنِ اعْتَصَمَ بِكَ عَصَمْتَهُ وَ مَنِ اسْتَرْحَمَكَ رَحِمْتَهُ",
        "وَ مَنِ اسْتَكْفَاكَ كَفَيْتَهُ وَ مَنْ تَوَكَّلَ [عَلَيْكَ‌] أَمِنْتَهُ وَ هَدَيْتَهُ",
        "سَمْعاً لِقَوْلِكَ يَا رَبِّ وَ طَاعَةً لِأَمْرِكَ [بِأَمْرِكَ‌]",
        "اللَّهُمَّ أَقُولُ وَ بِتَوْفِيقِكَ أَقُولُ وَ عَلَى كِفَايَتِكَ أَعُولُ",
        "وَ بِقُدْرَتِكَ أَطُولُ وَ بِكَ أَسْتَكْفِي وَ أَصُولُ‌",
        "فَاكْفِنِي اللَّهُمَّ وَ أَنْقِذْنِي وَ تَوَلَّنِي وَ اعْصِمْنِي وَ عَافِنِي وَ امْنَعْ مِنِّي وَ خُذْ لِي وَ كُنْ لِي بِعَيْنِكَ وَ لَا تَكُنْ عَلَيَّ",
        "اللَّهُمَّ أَنْتَ رَبِّي عَلَيْكَ تَوَكَّلْتُ وَ إِلَيْكَ أَنَبْتُ وَ إِلَيْكَ الْمَصِيرُ",
        "وَ أَنْتَ عَلَى كُلِّ شَيْ‌ءٍ قَدِيرٌ",
        "INFO: At noon",
        "DESC: Sit down with tranquility and say the following words",
        "الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ‌",
        "كَمَا فَضَّلَنَا فِي دِينِهِ عَلَى مَنْ جَحَدَ وَ عَنَدَ",
        "وَ فِي نَعِيمِ الدُّنْيَا عَلَى كَثِيرٍ مِمَّنْ عَمَدَ",
        "وَ هَدَانَا بِمُحَمَّدٍ نَبِيِّهِ صَلَّى اللَّهُ عَلَيْهِ وَ آلِهِ",
        "وَ شَرَّفَنَا بِوَصِيِّهِ وَ خَلِيفَتِهِ فِي حَيَاتِهِ وَ بَعْدَ مَمَاتِهِ أَمِيرِ الْمُؤْمِنِينَ ص",
        "اللَّهُمَّ إِنَّ مُحَمَّداً صَلَّى اللَّهُ عَلَيْهِ نَبِيُّنَا [كَمَا] أَمَرْتَ",
        "وَ عَلِيّاً صَلَّى اللَّهُ عَلَيْهِ مَوْلَانَا كَمَا أَقَمْتَ",
        "وَ نَحْنُ مَوَالِيهِ وَ أَوْلِيَاؤُهُ"
    ]
}