{
    "id": "naad-e-ali",
    "title": "Naad e Ali",
    "language": "ar",
    "text": [
        "INFO: Naad e Ali",
        "نَادِ عَلِيّاً مَظْهَرَ الْعَجَائِبِ،",
        "تَجِدْهُ عَوْناً لَكَ فِي النَّوَائِبِ،",
        "كُلُّ هَمٍّ وَ غَمٍّ سَيَنْجَلِي،",
        "بِعَظْمَتِكَ يَا اَللهُ نُبُوَّتِكَ يَا مُحَمَّدُ",
        "بِوَلايَتِكَ يَا عَلِيُّ يَا عَلِيُّ يَا عَلِيُّ",
        "INFO: Longer Version 1",
        "نَادِ عَلِيًّا مَظْهَرَ الْعَجَائِبِ تَجِدْهُ عَوْنًا لَّكَ فِىْ النَّوَآئِبِ",
        "كُلَّ هَمٍّ وَّ غَمِّ إِلَى اللهِ حَاجَتِىٌ وَ عَلَيْهِ مُعَوَّلِىُّ",
        "كُلُّمَا رَمَيْتُ مُتَقَاضِىُ فِىُ اللهِ يَدُ اللهِ وَلِىُّ",
        "اللّهِلِى أَدْعُوْكَ كُلَّ هَمِّ وَغَمِّ سَيَنْجَلِىُ بِعَظَمَتِكَ",
        "يَا أَلَلْهُ بِنُبُوَّتِكَ يَا مُحَمَّدُ بِلَا يَتِكَ يَا عَلِىُّ يَا عَلِىُّ",
        "كُبَرُ اللهُ أَكْبَرُ أَنَا مِنْ شَرِّ أَعْدَآئِكَ بَرِىُءٌ",
        "اللّهُ صَمَدِىُ بِحَقِّ ِيَّاكَ نَعُبُدُ وَإِيَّاكَ نَسْتَعِيْنُ",
        "يَا أَبَا الْغَيْثِ أَغْشُنِىُّ يَا عَلِىُّ أَدْرِكْنِى",
        "يَا قَاهِرَ الْعَدُةِّ وَيَا وَلِيَّ الوَلِيِّ يَا مَظُهَرَ الْعَجَائِبِ",
        "يَا مُرْتَضَى عَلِيٍّ يَا قَهَّارُ تَقَهَّرْتَ بِْلقَهَرِ",
        "وَالقَهَرُ فِىْ قَهْرِ قَهْرِكَ يَا ذَا الْبَطْشِ الشَّدِيْدِ",
        "آَنْتَ الْقَاهِرُ الْجَبَّارُ الْمُهْلِكُ المُنْتَقِمُ الْقَوِىُّ",
        "وَ أُفَوِّضُ أَمْرِىٌ إِلَى اللْهِ إِنَّ اللّهَ بَصِيرٌ بِالْعِبَادِ",
        "حَسْبِىَ اللهُ وَ نِعْمَ الْوَكِيْلُ نِعْمَ الْمَوْلى وَنِعْمَ النَّصِيْرُ",
        "INFO: Longer Version 2",
        "نادِ عَلیاً مَظهَرَ العَجائِب تَجِدهُ عَوناً لَکَ فِی النَوّائِب",
        "لی اِلی اللهِ حاجَتی وَ عَلَیهِ مُعَوَّلی",
        "کُلَّما اَمَرتَهُ وَ رَمَیتَ مُنقَضی فی ظِللّ اللهِ وَ یضِللُ اللهُ لی",
        "اَدعُوکَ کُلَّ هَمٍ وَغَمًّ سَینجَلی بِعَظَمَتِکَ یا اللهُ",
        "بِنُبُوَّتِکَ یا مُحَمَّدَ بِوِلایتِکَ یاعَلِی یا عَلِی یا عَلِی",
        "اَدرِکنی بِحقِّ لُطفِکَ الخَفی",
        "اللهِ اَکبَرُ اَنا مِن شَرِّ اَعدائکَ بَریءٌ",
        "اللهُ صَمَدی مِن عِندِکَ مَدَی وَعَلَیکَ مُعتَمَدی",
        "بِحقِّ إِیاکَ نَعبُدُ وَ إِیاکَ نَستَعینُ",
        "یا اَبالغَیثِ اَغِثنی یا اَبَاالَحَسَنَین اَدرِکنی",
        "یاسَیفَ اللهُ اَدرِکنی یابابَ اللهِ اَدرِکنی",
        "یاحُجَّهَ اللهِ اَدرِکنی یا وَلِی اللهِ اَدرِکنی",
        "بِحَقَّ لُطفِکَ الخَفی یا قَهّارُ تَقَهَّرتَ بِالقَهرِ",
        "وَ القَهر ُفی قَهرِ قَهرکَ یا قَهارُ یا قاهِرَ العَدُوّ",
        "یامَظهَرَ العَجائِبِ یامُرتَضی عَلِی",
        "رَمَیتَ مِن بَغی عَلَی بِسَهمِ اللهِ وَسَیفِ اللهِ القاتِلِ",
        "اُفَوَّضُ اَمری اِلی اللهِ اِنَّ اللهُ بَصَیرٌ بِالعَبادِ",
        "وَ اِلحُکُم اِلهٌ واحِدٌ لا اِلهَ اِلاّ هُوَ الرَّحمنُ الرَّحیمُ",
        "یاغیاثَ المُستَغیینِ یا دَلیلَ المُتَحیرِینَ",
        "یا اَمانَ الخائِفینَ یا مُعینَ المُتَوَکِلینَ",
        "یا رَاحِمَ المَساکینَ یا اِلهَ العالَمَینَ بِرَحمَتِکَ",
        "وَصَلَّی اللهُ عَلی سَیدِنا مُحَمَّدٍ وَالِهِ اَجمَعین",
        "وَ الحَمدُ اللهِ رَبِّ العالَمینَ"
    ]
}