{
    "id": "eid-al-ghadeer",
    "title": "Eid al-Ghadeer",
    "language": "en",
    "text": [
        "INFO: Introduction",
        "DESC: It's recommended to offer this salah before Dhuhr near noon for it was at that hour that the event of Ghadeer took place.",
        "DESC: Those who perform this salah recieve the reward of someone who had been present on the day of Ghadeer with the Holy Prophet (saww) and sworn allegiance to him, as regards to the divinely commissioned leadership (wilayah) of Imam Ali (as).",
        "INFO: Salah",
        "DESC: • It's 2 rakah salah",
        "DESC: • In 1st rakah, recite [Sura Fatihah] and [Sura Qadr]",
        "DESC: • In 2nd rakah, recite [Sura Fatihah] and [Sura Ikhlaas]",
        "INFO: After salah",
        "DESC: 💠 Prostrate (Do Sajdah) and say 100 times",
        "Thanks be to Allah.",
        "DESC: 💠 Then say the following dua",
        "O Allah, I beseech You in the name of that all praise be to You,",
        "alone, without having any partner,",
        "and that You are One, One and Only, and eternally Besought of all;",
        "You beget not nor are You begotten,",
        "and there is none like You;",
        "and that Muhammad is Your servant and Messenger,",
        "Your blessings be upon him and his Household.",
        "O He Who is in a state every day!",
        "Just as You decided to confer upon me with Your favor",
        "when You included me with those to whom You responded,",
        "the company of Your religion,",
        "and the company of those who pray You,",
        "You had led me to this in the beginning of Your creation of me",
        "as a sign of Your favoring, generosity, and magnanimity.",
        "Then, You followed the favor with another favor,",
        "the magnanimity with another magnanimity,",
        "and the generosity with another generosity,",
        "on account of Your kindness and mercy,",
        "so You renewed all that for me over again",
        "after You renewed my creation",
        "while I was a thing quite forgotten,",
        "oblivious, unmindful, and heedless.",
        "So, You completed Your grace",
        "when You made me remember that,",
        "bestowed this favor upon me,",
        "and guided me to it.",
        "So, (please) may one of Your decisions,",
        "O my God, Master, and Sustainer,",
        "be that You perfect this for me and never deprive me of it",
        "until You cause me to die on this faith",
        "and You are pleased with me.",
        "For, verily, You are the worthiest Benefactor",
        "of perfecting Your grace for me.",
        "O Allah, we have listened, obeyed,",
        "and answered Your call on account of Your favor to us.",
        "So, all praise be to You.",
        "Your forgiveness, O our Lord, we seek",
        "and to You is the return.",
        "We believe in Allah, alone;",
        "there is no partner with Him,",
        "and (we believe) in His Messenger, Muhammad,",
        "may Allah’s blessings be upon him and his Household,",
        "we trust and respond to the caller of Allah,",
        "we followed the Messenger as regards the loyalty to our master,",
        "and the master of the believers,",
        "the commander of the believers,",
        "`Ali, the son of Abu-Talib,",
        "Allah’s servant and His Messenger’s brother,",
        "the grandest veracious,",
        "the claim on His creation,",
        "by him, He supported His Prophet",
        "and His religion, the manifest true.",
        "(We believe in him as) the sign of Allah’s religion,",
        "the keeper of His knowledge,",
        "the container of Allah’s unseen affairs,",
        "the carrier of Allah’s secrets,",
        "the trustee of Allah on His creatures,",
        "and His witness on His created beings.",
        "O Allah, O our Lord, surely, we have heard a preacher",
        "calling to the faith, saying, “Believe in your Lord.” So, we did believe.",
        "Our Lord! Forgive us therefore our faults,",
        "cover our evil deeds,",
        "and make us die with the righteous ones.",
        "Our Lord! And grant us what You have promised us by Your messengers;",
        "and disgrace us not on the Day of Resurrection.",
        "Surely, You do not fail to perform the promise.",
        "Because we, O our Lord, on account of Your grace and kindness,",
        "responded to Your caller",
        "followed the Messenger, believed him,",
        "trusted the Master of the Believers,",
        "and denied the idols (Jibt) and false deities (Taghut).",
        "So, (please) join us with those whom we chose to join",
        "and put us in the group of our Imams,",
        "for we do believe in them with absolute belief,",
        "and to them we do submit.",
        "We believe in their secret and open affairs,",
        "their present and their absent ones,",
        "and their living and their dead ones.",
        "We consent to them as our imams,",
        "leaders, and chiefs.",
        "And we stop at them",
        "in all of our affairs with Allah, excluding all other creatures of Him.",
        "We do not seek any substitutes of them,",
        "and we do not betake ourselves any friends other than them.",
        "We, before Allah, disapprove",
        "all those who made war with them,",
        "from jinn and men,",
        "from the past and the coming generations.",
        "We deny the idols, the false deities,",
        "the four pagans,",
        "their partisans, their followers,",
        "and all those who support them",
        "from jinn and human beings",
        "from the first of time to the last of it.",
        "O Allah, we call You to witness",
        "that we profess all that professed by Muhammad and the Household of Muhammad,",
        "Allah’s blessings be upon him and them.",
        "We say only that which they say",
        "and we believe in only that in which they believe.",
        "What they say is our saying,",
        "what they profess is what we profess,",
        "what they reject is what we reject,",
        "those to whom they adhere are they to whom we adhere,",
        "those whom they oppose are they whom we oppose,",
        "those whom they curse are they whom we curse,",
        "those whom they condemn are they whom we condemn,",
        "and those to whom they pray for mercy are they to whom we pray for mercy.",
        "We believe in, submit to,",
        "accept, and follow our masters,",
        "Allah’s blessings be upon them.",
        "O Allah, so, perfect this for us and do not deprive us of it.",
        "Make it well-established and fixed with us",
        "and do not make it temporal (belief).",
        "Make us live on it (no matter how long You will make us to live)",
        "and cause us to die on it (when You decide to terminate our lives).",
        "Muhammad’s Household are our Imams;",
        "so, we follow them",
        "and act loyally to them.",
        "We oppose their enemy, the enemy of Allah;",
        "so, (please) include us with them in this world and the Hereafter,",
        "and make us of those drawn near (to You),",
        "for we are satisfied with that.",
        "O most Merciful of all those who show mercy!",
        "DESC: 💠 Prostrate again and say 100 times",
        "All praise be to Allah.",
        "DESC: 💠 Prostrate again and say 100 times",
        "Thanks be to Allah."
    ]
}