{
    "id": "eid-al-mubahila",
    "title": "Eid al-Mubahila",
    "language": "en",
    "text": [
        "INFO: Narration 1",
        "DESC: 💠 Description",
        "DESC: It's reported by Sayyed ibn Tawus from Imam Sadiq (as)",
        "DESC: 💠 Method",
        "DESC: • It's a 2 rakah prayer,",
        "DESC: • In each rakah Recite Sura Fatiha,",
        "DESC: • then 10 times Sura Ikhlaas,",
        "DESC: • then 10 times Ayat al-Kursi,",
        "DESC: • then 10 times Sura Qadr",
        "INFO: Narration 2",
        "DESC: 💠 Description",
        "DESC: It's reported by Sayyed ibn Tawus",
        "DESC: 💠 Method",
        "DESC: • It's a 2 rakah prayer,",
        "DESC: • In each rakah Recite Sura Fatiha,",
        "DESC: • then any surah,",
        "DESC: • then 70 times \"Astaghfirullah\",",
        "DESC: • then say this dua,",
        "xxx",
        "xxx",
        "“Praise be to God who taught me what I was ignorant of. Were it not due to Your Teaching, I would have been of the ruined ones.",
        "When You said the following and indeed whatever you say is right, \"No reward do I ask of you for this except the love of those near of kin.\"",
        "And You clarified what was meant by „the love of those near of kin‟ when You said, \"And Allah only wishes to remove all abomination from you, ye members of the Family, and to make you pure and spotless.\"2",
        "Then You clarified „the Family‟ and said the following - indeed whatever You say is right - as a favor to Your Creatures to let them recognize the Family,",
        "\"Come! let us gather together,- our sons and your sons, our women and your women, ourselves and yourselves: Then let us earnestly pray, and invoke the curse of Allah on those who lie!\"",
        "O' Lord! Thanks to You. Thank You since You Guided me and directed me such that even their family, household and relatives were not hidden from us, and You let me know their women, children and men.",
        "O' my God! I seek nearness to You by this position nobler than which there is no position for the believers to get to know You.",
        "xxx",
        "xxx",
        "Were it not for this noble rank by which You saved us and directed by to follow the path of the rightful ones from the Progeny of Your Prophet, we would not be saved. So all praise and gratitude belongs to You for all Your Bounties and Help.",
        "O' my God! Please bestow Your Blessings on Muhammad and his Progeny - those whose obedience You made incumbent upon us. Please make us steadfast in words that they taught us.",
        "O' my God! Please bestow the best of Your Rewards on Muhammad (MGB) and include us in their intercession in Your House of Nobility. O' the Most Compassionate, Most Merciful.",
        "O' my God! These are people of he robe and the cloak on the Invocation (\"Al-Mubahile\") day and those of the people and the nearby-stationed angels who enter it. Please let them intercde on our behalf.",
        "I ask You for the sake of this rank to forgive me, have mercy on me and accept my repentance. Verily You are the Ever-Relenting, the Merciful!",
        "O' my God! I take You as witness that their spirits and nature are one. It is a tree whose roots, branches and leaves prosper.",
        "O' my God! Please have mercy on us for their sake. As indeed You established them as proofs for Your Creatures, reasons that point to Your Oneness, gates to Your Miracles through Your Knowledge that people other than them are unable to attain.",
        "Indeed You have honored them as You have chosen them from amongst Your Creatures and have transferred them from your other worshippers for You have purified their roots, branches and their place of development.",
        "Then You have honored them with Your Light so as to let them be the most honored amongst those of their era and and You have made them unique by bestowing on them Your Revelations and have sent down Your Book to them and have ordered us to adhere to them.",
        "O' my God! We indeed adhere to Your Book and the Itrat (Household) of Your Prophet - that which You established as a proof and sign for us, and ordered us to follow them.",
        "xxx",
        "O' my God! Indeed we adhere! O' God! Please bless me with their intercession, and do not let us go astray after You have guided us. Amen. O' lord of the Two Worlds.”",
        "xxx"
    ]
}