{
    "id": "isteghfar",
    "title": "Isteghfar",
    "language": "en",
    "text": [
        "INFO: Namaz-e-Isteghfar - 1",
        "DESC: The Messenger of Allah (saww) said:",
        "DESC: If your sustenance reduces and you have difficulties in your affairs you must remove them by asking your needs from the Almighty with the help of Namaz and Isteghfar.",
        "DESC: It is 2 rakats. In each rakat after [Surah Hamd](Quran:1) recite [Surah Qadr](Quran:97) once and then say \"Astaghfirullaah\" 15 times. Then go into the ruku and after the recitation of the ruku say \"Astaghfirullaah\" 10 times. Rise up from the ruku and again say \"Astaghfirullaah\" 10 times. Go into the first Sajdah and after the recitation of the Sajdah say \"Astaghfirullaah\" 10 times. Arise from the first Sajdah and again say \"Astaghfirullaah\" 10 times. Go into the second Sajdah and repeat like the first Sajdah. Get up from the second Sajdah and say \"Astaghfirullaah\" 10 times. In the similar manner complete the 2nd rakat and conclude the prayer.",
        "DESC: Insha Allah everything would be all right.",
        "INFO: Namaz-e-Isteghfar - 2",
        "DESC: This is four rakat prayer. In the first rakat after [Surah Hamd](Quran:1) recite [Ayatul Kursi](Quran:2:255) once. In the second rakat after [Surah Hamd](Quran:1) recite [Surah Tawheed](Quran:112) once. In the third rakat after [Surah Hamd](Quran:1) recite [Surah Falaq](Quran:113) once. In the fourth rakat after [Surah Hamd](Quran:1) recite [Surah Naas](Quran:114) once. After concluding the prayer recite \"Astaghfirullaah\" 10 times.",
        "DESC: The Messenger of Allah (saww) said:",
        "DESC: If one recites this prayer on Saturday before noon the Almighty Allah forgives all his sins.",
        "INFO: Namaz-e-Isteghfar - 3",
        "DESC: The easiest Namaz-e-Isteghfar is two rakats. In each rakat after [Surah Hamd](Quran:1) recite [Surah Tawheed](Quran:112) sixty times. Insha Allah the sins would be forgiven.",
        "INFO: Namaz-e-Isteghfar - 4",
        "DESC: The Messenger of Allah (saww) said:",
        "DESC: If one desires that his sins are forgiven he should pray two rakat Namaz on Tuesday eve. In the first rakat after [Surah Hamd](Quran:1) recite [Surah Qadr](Quran:97) once and in the second rakat after [Surah Hamd](Quran:1) recite [Surah Tawheed](Quran:112) seven times. After concluding the prayer recite \"Astaghfirullaah\". Insha Allah the Almighty Allah would forgive the sins.",
        "INFO: Namaz-e-Isteghfar - 5",
        "DESC: The Messenger of Allah (saww) said:",
        "DESC: If one recites 10 rakats prayer on Tuesday in the following way that in every rakat after [Surah Hamd](Quran:1) he recites [Ayatul Kursi](Quran:2:255) once and [Surah Tawheed](Quran:112) seven times; the Almighty Allah shall forgive the sins of all his life.",
        "INFO: Namaz-e-Isteghfar - 6",
        "DESC: Recite two rakats prayer. In the first rakat after [Surah Hamd](Quran:1) recite [Surah Qadr](Quran:97) thrice and in the second rakat after [Surah Hamd](Quran:1) recite [Surah Zilzaal](Quran:99) thrice. After concluding the prayer recite 100 times: \"Astaghfirullaah Rabbi wa atoobo ilaihe\".",
        "INFO: Namaz-e-Tawbah",
        "DESC: The Messenger of Allah (saww) emerged from his house on Sunday the 2nd of Zilqad and said:",
        "DESC: O people! Who among you intends to perform Tawbah?",
        "DESC: The people replied: All of us would like to do Tawbah.",
        "DESC: The Messenger of Allah (saww) said:",
        "DESC: Perform the Ghusl (bath) and Wuzu (ablution) and recite four rakats prayer. In each rakat after [Surah Hamd](Quran:1) recite [Surah Tawheed](Quran:112) thrice and [Surah Falaq](Quran:113) and [Surah Naas](Quran:114) once each and after the prayer do Isteghfar and then say: Laa hawla wa laa quwwata illa billaahil a'liyyil a'zeem. Then say: Yaa A'zeezo yaa ghaffooro ighfirli zunoobi wa zunooba Jamee'il mo-mineena wal mo-minaate. Fa innahu laa yaghfiro illa ant.",
        "DESC: And the Holy Prophet (saww) said:",
        "DESC: No servant of my Ummat performs this prayer that a caller does not calls out from the sky: O slave of Allah! This deed has been elevated and your repentance (Tawbah) has been accepted and your sins are forgiven.",
        "DESC: An angel will call out beneath the heavens: O slave of Allah! Congratulations to you and your family members.",
        "DESC: An angel would call out: Your enemy would be satisfied with you on the day of Judgment. Another angel would call out: O slave of Allah! You would leave this world with faith. You would not be arrested. Your grave shall be expansive and illuminated.",
        "DESC: Another angel would call out: O slave of Allah! Your parents are happy with you though they were dissatisfied with you before. Your parents and your descendants shall get salvation and there shall be increase in the livelihood in the world and the hereafter.",
        "DESC: Hazrat Jibraeel (a.s.) would call out: At the time of death I would come with the Angel of death and would be kind to you and you shall not have any problem. Your body would not be pained at the time the soul is taken out.",
        "DESC: The people asked: O Messenger of Allah (saww), how should one perform this if one desires to perform it in any other month? The Prophet (s.a.) replied:",
        "DESC: In the same way with the merits.",
        "DESC: And said: Jibraeel has taught me these words on the night of ascension (Shab-e-Me'raj)."
    ]
}