{
    "id": "nafilah",
    "title": "Nafilah",
    "language": "en",
    "text": [
        "INFO: Description",
        "DESC: 💠 The number of the Rak'ats everyday excluding Friday, is 34.",
        "DESC: • 2 Rak'ats for Fajr",
        "DESC: • 8 Rak'ats for Zuhr",
        "DESC: • 8 Rak'ats for Asr",
        "DESC: • 4 Rak'ats for Maghrib",
        "DESC: • 2 Rak'ats for Isha",
        "DESC: • 11 Rak'ats of Tahajjud (Salat al-Layl)",
        "DESC: 💠 As an obligatory precaution, the Nafilah for Isha prayers should be offered while sitting, and therefore its 2 Rak'ats are counted as one. But on Friday, 4 Rak'ats are added to the 16 Rak'ats of the Zuhr and the Asr Nafilah, and it is preferable that all these 20 Rak'ats are offered before the Zuhr sets in.",
        "DESC: 💠 All Nafilah prayers can be offered while sitting, but then, certain Fuqaha say that 2 Rak'ats prayed sitting should be counted as one Rak'at. For example, if a person wishes to offer Zuhr Nafilah which consists of 8 Rak'ats, in a sitting posture, he should offer 16 Rak'ats. And if he wishes to offer Witr prayers while sitting, he should offer two prayers of 1 Rak'at each. This later preference is not known from any sources; however, they may be followed with the hope of earning divine pleasure.",
        "DESC: 💠 Zuhr Nafilah and Asr Nafilah should not be offered when one is on a journey, and one may offer Isha Nafilah with the intention of Raja'",
        "INFO: The timings of daily Nafilah prayers",
        "DESC: • The Zuhr Nafilah is offered before Zuhr prayers. Its time is from the commencement of the time of Zuhr, up to the time when the shadow of indicator equals 2/7th of its length. For example, if an indicator is 7 yards long, and the shadow appearing after Zuhr reaches 2 yards, the Nafilah time would end. He should now offer Zuhr prayers.",
        "DESC: • The Asr Nafilah are offered before Asr prayers, and its time is till the moment when the shadow of an indicator appearing after Zuhr, reaches of 4/7th of its length. In case a person wishes to offer Zuhr and Asr Nafilah after their recommended time, he can offer the Zuhr Nafilah after Zuhr prayers, and the Asr Nafilah after Asr prayers, but as a precaution, he will not make niyyat of Ada or Qadha.",
        "DESC: • The Maghrib Nafilah should be offered after Maghrib prayers, and one should make an effort to offer it in time after Maghrib. However, if one delays offering Maghrib Nafilah till redness in the western sky disappears, then it would be better to offer Isha prayers at that moment.",
        "DESC: • The time for Isha Nafilah is from the completion of Isha prayers till midnight. It is better to offer it immediately, after Isha prayers.",
        "DESC: • The Fajr Nafilah is offered before the Fajr prayers, and its time commences when Namaz-e-Shab has been completed, till the time of Namaz-e-Fajr draws near. But if someone delays it till redness is seen in the eastern sky, then it is better to pray namaz of Fajr.",
        "DESC: • The time for Namaz-e-Shab is from midnight till Adhan for Fajr prayers, and it is better to offer it nearer the time of Fajr prayers.",
        "DESC: • A traveller (i.e. one on a journey), and a person who finds it difficult to offer Namaz-e-Shab after midnight, can offer it before midnight.",
        "INFO: Rules of Recommended prayers",
        "DESC: 1. All the recommended prayers are performed in units of two rakat, except for Namaz-e-Witr, which is only one rakat and Namaze-e-Aaraabi which is two rakat once and four rakat twice.",
        "DESC: 2. In recommended prayers leaving some prayers, it is not necessary to recite the second Surah.",
        "DESC: 3. It is allowed to even intentionally break a recommended prayer.",
        "DESC: 4. In recommended prayers if one forgetfully has increased a rukn the prayer does not become invalid.",
        "DESC: 5. Doubt between first and second rakat does not make the recommended prayer invalid, one has the choice of considering whichever rakat one desires to consider.",
        "DESC: 6. The nafila prayers can be offered in the sitting position also but it is better to consider two rakats offered in sitting position equivalent to one rakat offered standing.",
        "DESC: 7. The nafila of Zuhr and Asr must not be recited on a journey but the nafila of Isha can be offered with the intention of gaining proximity of Allah that perhaps it be accepted by Him.",
        "DESC: 8. It is better that an obligatory prayer be offered in a Masjid however there is no such command about the recommended prayers.",
        "DESC: 9. There is no Sajdah Sahv in recommended prayers.",
        "DESC: 10. If the recommended prayers are not offered in the prescribed time its Qaza can be performed later.( In case Qaza is also not done one can offer in charity 750 gms of of food to poor for each 2 rakat of Nafilah prayer or atleast 1500 gms of food for each day of Nafilah -Shaikh Ehsan)",
        "DESC: 11. Recommended prayers can be offered while one is walking or on a vehicle and if one recites the recommended prayers in these two positions it is not necessary that he should face the Qibla.",
        "DESC: 12. Recommended prayers can be offered standing, sitting, lying down or walking. In these same positions the ruku and sajdah can be performed by gesturing with the head, but one should try to face the Qibla.",
        "DESC: 13. Motionlessness of the body is not a necessary condition in recommended prayers. And if one forgetfully increases or decreases a rukn the prayer is not invalidated.",
        "DESC: 14. One can make a vow to nazr for performing a recommended prayer and in such circumstances one can perform the prayer sitting, standing or walking. But if at the time of making a nazr one says that he would offer it stting then in the opinion of Imam Khomeini there is doubt in making such a nazr.",
        "DESC: It is mentioned in traditions that the Almighty Allah expressed pride to the Angels that look at my slave, he is performing that which I have not made incumbent on him.",
        "INFO: Doubts in Recommended prayers",
        "DESC: If a person doubts about the number of Rak'ats in a Mustahab prayer and if the higher side makes the prayers void, he should decide on the lesser side of the doubt. For example, if he doubts whether he has performed 2 Rak'ats or 3 in Nafilah of Fajr prayers, he should decide that he has performed 2 Rak'ats. But if the higher side does not invalidate the prayers, like, if he doubts whether he has performed 2 Rak'ats or 1, he is free to decide either way, and his prayers will be valid. (Tauzeehul Masael Agha Seestani, Masla no. 1202)",
        "DESC: Omission of a Rukn invalidates Nafilah (Mustahab prayers), but addition of a Rukn does not invalidate it. Hence, if the person offering Nafilah prayers forgets to perform any part, and remembers when he has entered into another Rukn, he should return to perform the forgotten part and then re-enter the Rukn. For example, if he remembers during Ruku that he has not recited Surah al-Hamd, he should return to recite Surah al-Hamd, and then go into Ruku again. (1203)",
        "DESC: If a person doubts whether he has performed any Rukn or non-Rukn part of Nafilah prayers, he should perform it if its stage has not passed, and if it has, then he should ignore the doubt. (1204)",
        "DESC: If in a Mustahab prayer of two Rak'ats, a person suspects that he has offered 3 Rak'ats or more, he should ignore his doubt, and his prayers are in order. If, he suspects that he has offered 2 Rak'ats or less, then as an obligatory precaution, he should pay heed to that suspicion. For example, if he suspects that he has performed one Rak'at only, as a precaution, he will perform another Rak'at. (1205)",
        "DESC: If a person in Nafilah prayers performs an act which, if he had performed in an obligatory prayers, it would have been necessary for him to do Sajdatus Sahv, or if he forgets one Sajdah, it will not be necessary to perform Sajdatus Sahv, or give qadha for the Sajdah, after the Nafilah is over. (1206)",
        "DESC: If a person doubts whether he has offered a particular Mustahab prayer or not, and if that prayer does not have a fixed time, like, the prayers of Ja'far Tayyar, he should decide that he has not offered it. The position is the same if that prayer has a fixed time, like Nafilah of daily prayers, and a person doubts before its time lapses, whether he has offered it or not. However, if he doubts after its time has gone, he should ignore his doubt. (1207)"
    ]
}