{
    "id": "tahajjud---salatul-layl",
    "title": "Tahajjud - Salatul Layl",
    "language": "en",
    "text": [
        "DESC: Night Prayer To be offered after Midnight. It consists up of 11 Rak’ats.",
        "INFO: Nawafilatul-Layl x 4",
        "DESC: The first 8 Rak’ats are prayed as normal (like Fajr) in pairs of 2 Rak’ats each with the niyyah of \"Nawafilatul-Layl\"",
        "INFO: Salatul Shif’a",
        "DESC: The next 2 Rak’ats are prayed (like Fajr) with the Niyyah of \"Salatul Shif’a\"",
        "INFO: Salatul Witr",
        "DESC: The remaining 1 Rak’at is prayed (as below) with the Niyyah of \"Salatul Witr\"",
        "DESC: After Niyyah and say Takbiratul Ihram Recite the following surah:-",
        "DESC: • [Surah Al-Hamd](Quran:1) - Once",
        "DESC: • [Surah Ikhlas](Quran:112) - three times",
        "DESC: • [Surah Falaq](Quran:113) - once",
        "DESC: • [Surah Naas](Quran:114) - once",
        "DESC: Say Takbir and raise hands for Qunoot and You may recite any Dua or Rabbana or the following",
        "There is none worth worshipping but Allah Who is Forbearing and Generous",
        "There is none worth worshipping but Allah Who is Most High and Great",
        "Glory be to Allah, Who is the Sustainer of the seven heavens and of the seven earth",
        "And Who is the Sustainer of all the things",
        "in them, and between them,",
        "And Who is the Lord of the great ‘Arsh (Divine Center of Authority & Power)",
        "And all praise for Allah, the Sustainer of the worlds.",
        "DESC: Then, pray for forgiveness of 40 people who are either dead or living in the following manner:",
        "O Allah, forgive (Name)…",
        "DESC: Continuing with the Qunoot, recite the Istighfar 70 times:",
        "I seek forgiveness of Allah my Lord and I turn to Him",
        "DESC: Still continuing qunoot, recite the following Dua 7 times:",
        "This is the position of one who seeks refuge in You from the fire [of Hell]",
        "DESC: Continuing qunoot yet further , recite 300 times:",
        "(I ask for) forgiveness",
        "DESC: Finally, the following should be said once:",
        "Lord, forgive me and have mercy on me, and turn to me, Surely You are the Oft-returning, the Merciful",
        "DESC: Complete the Rukuh and Sujood and end the prayer with Salaam",
        "DESC: • Recite [Tasbih of Syeda Fatemah Zahra (sa)]([[dhikr:tasbih---syeda-fatima-az-zahra-(sa)]])",
        "DESC: • Followed by Sajdah of Shukr. reciting 5 times:",
        "All Glorious, All Holy, Lord of the Angels and the Spirit.",
        "DESC: • Next, recite [Ayatul Kursi](Quran:2:255)",
        "DESC: • Finally, for the second time, perform Sajdah of Shukr reciting 5 times:",
        "All Glorious, All Holy, Lord of the Angels and the Spirit."
    ]
}