{
    "id": "hadith-al-kisa",
    "title": "Hadith al-Kisa",
    "language": "ar",
    "text": [
        "DESC: From Shaykh `Abdullah ibn Nurullah al-Bahrani has recorded in his book entitled `Awalim al-`Ulum through an authentic chain of authority that Jabir ibn `Abdullah al-Ansari said that he heard from Syeda Fatimah az-Zahra (sa), the daughter of the Holy Messenger of Allah (saww)",
        "بِسْمِ ٱللَّـهِ ٱلرَّحْمَـٰنِ ٱلرَّحِيمِ",
        "اَللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ",
        "عَنْ فاطِمَةَ الزَّهْراءِ عَلَيْهَا اَلسلام بِنْتِ رَسُول ِاللّه صَلَّى اللهُ عَلَيْهِ وَآلِهِ أَنَّها قالَتْ :",
        "دَخَلَ عَلَيَّ أَبِي رَسُولُ اللّهِ صَلَّى اللهُ عَلَيْهِ وَآلِهِ فِي بَعْضِ الاْيَّامِ فَقالَ:",
        "السَّلامُ عَلَيْكِ يَا فاطِمَةُ",
        "فَقُلْتُ: عَلَيْكَ السَّلامُ",
        "قالَ: إِنِّي أَجِدُ فِي بَدَنِي ضُعْفا",
        "فَقُلْتُ لَهُ: أُعِيذُكَ بِاللّهِ يَا أَبَتاهُ مِنَ الضُّعْفِ",
        "فَقَالَ: ”يَا فَاطِمَةُ! ٱئْتِينِي بِٱلْكِسَاءِ ٱلْيَمَانِيِّ فَغَطِّينِي بِهِ.",
        "فَأَتَيْتُهُ بالْكِساءِ الْـيَمانِي فَغَطَّيْتُهُ بِهِ",
        "وَصرْتُ أَنْظُرُ إِلَيْهِ وَإِذا وَجْهُهُ يَتَلَأَلَؤُ",
        "كَأَنَّهُ الْبَدْرُ فِي لَيْلَة تَمامِهِ وَكَمالِهِ",
        "فَمَا كانَتْ إِلاّ ساعَةً وَإِذا بِوَلَدِيَ الْحَسَنِ عليه السلام قَدْ أَقْبَلَ",
        "وَقالَ: السَّلامُ عَلَيْكِ يَا أُمَّاهُ",
        "فَقُلتُ: وَعَلَيْكَ السَّلامُ يَا قُرَّةَ عَيْنِي وَثَمَرَةَ فُؤَادِي",
        "فَقَالَ: يَا أُمَّاهُ إِنِّي أَشَمُّ عِنْدَكِ رائِحَةً طَيِّبَةً",
        "كَأَنَّها رائِحَةُ جَدِّي رَسُولِ اللّه صَلَّى اللهُ عَلَيْهِ وَآلِهِ",
        "فَقُلْتُ: نَعَمْ إِنَّ جَدَّكَ تَحْتَ الْكِساءِ",
        "فَأَقْبَلَ الْحَسَنُ نَحْوَ الْكِساءِ وَقالَ: السَّلامُ عَلَيْكَ يَا جَدَّاهُ يَا رَسُولَ اللّهِ",
        "أَتَأْذَنُ لِي أَنْ أَدْخُلَ مَعَكَ تَحْتَ الْكِساءِ",
        "فَقالَ: وَعَلَيْكَ السَّلامُ يَا وَلَدِي وَيَا صاحِبَ حَوْضِي",
        "قَدْ أَذِنْتُ لَكَ ِ",
        "فَدَخَلَ مَعَهُ تَحْتَ الْكِساء",
        "فَمَا كانَتْ إِلاَّ ساعَةً وَإِذا بِوَلَدِيَ الْحُسَيْنِ قَدْ أَقْبَلَ وَقالَ",
        "السَّلامُ عَلَيْكِ يَا أُمَّاهُ.",
        "فَقُلْتُ: وَعَلَيْكَ السَّلامُ يَا وَلَدِي وَيَا قُرَّةَ عَيْنِي وَثَمَرَةَ فُؤَادِي.",
        "فَقَالَ لِي: يَا أُمَّاهُ إِنِّي أَشَمُّ عِنْدَكِ رائِحَةً طَيِّبَةً",
        "كَأَنَّها رائِحَةُ جَدِّي رَسُولِ اللّهُ صَلَّى اللهُ عَلَيْهِ وَآلِهِ.",
        "فَقُلْتُ: نَعَمْ إِنَّ جَدَّكَ وَأَخاكَ تَحْتَ الْكِساءِ.",
        "فَدَنَا الْحُسَيْنُ نَحْوَ الْكِساءِ",
        "وَقالَ: السَّلامُ عَلَيْكَ يَا جَدَّاهُ السَّلامُ عَلَيْكَ يَا مَنِ اخْتارَهُ اللّهُ",
        "أَتَأْذَنُ لِي أَنْ أَكُونَ مَعَكُما تَحْتَ الْكِساءِ",
        "فَقالَ: وَعَلَيْكَ السَّلامُ يَا وَلَدِي",
        "وَيَا شافِعَ أُمَّتِي قَدْ أَذِنْتُ لَكَ.",
        "فَدَخَلَ مَعَهُما تَحْتَ الْكِساء",
        "فَأَ قْبَلَ عِنْدَ ذلِكَ أَبُو الْحَسَنِ عَلِيُّ بْنُ أَبِي طالِبٍ",
        "وَقالَ: السَّلامُ عَلَيْكِ يَا بِنْتَ رَسُولِ اللّهِ.",
        "فَقُلْتُ: وَعَلَيْكَ السَّلامُ يَا أَبَا الْحَسَنِ وَيَا أَمِيرَ الْمُؤْمِنِينَ.",
        "فَقالَ: يَا فاطِمَةُ إِنِّي أَشَمُّ عِنْدَكِ رائِحَةً طَيِّبَةً",
        "كَانَّهَا رائِحَةُ أَخِي وَابْنِ عَمِّي رَسُولِ اللّه صَلَّى اللهُ عَلَيْهِ وَآلِهِ.",
        "فَقُلْتُ: نَعَمْ هَا هُوَ مَعَ وَلَدَيْكَ تَحْتَ الْكِساءِ",
        "فَأَقْبَلَ عَلِيٌّ نَحْوَ الْكِساءِ",
        "وَقالَ: السَّلامُ عَلَيْكَ يَا رَسُولَ اللّهِ",
        "وأَتَأْذَنُ لِي أَنْ أَكُونَ مَعَكُمْ تَحْتَ الْكِساءِ",
        "قالَ لَهُ: وَعَلَيْكَ السَّلامُ يَا أَخِي ويَا وَصِيِّي",
        "وَخَلِيفَتِي وَصاحِبَ لِوَائِي قَدْ أَذِنْتُ لَكَ",
        "فَدَخَلَ عَلِيٌّ تَحْتَ الْكِساءِ",
        "ثُمَّ أَتَيْتُ نَحْوَ الْكِساءِ",
        "وَقُلْتُ: السَّلامُ عَلَيْكَ يَا أَبَتاهُ يَا رَسُولَ اللّهِ",
        "أَتَأْذَنُ لِي أَنْ أَكُونَ مَعَكُمْ تَحْتَ الْكِساءِ",
        "قالَ: وَعَلَيْكِ السَّلامُ يَا بِنْتِي وَيَا بِضْعَتِي قَدْ أَذِنْتُ لَكِ",
        "فَدَخَلْتُ تَحْتَ الْكِساءِ",
        "فَلَمَّا اكْتَمَلْنا جَمِيعاً تَحْتَ الْكِساءِ أَخَذَ أَبِي رَسُولُ اللّه بِطَرَفَي الْكِساءِ",
        "وَأَوْمَأَ بِيَدِهِ ٱلْيُمْـنٰى إِلَى السَّماءِ وَقالَ:",
        "اللّهُمَّ إِنَّ هَؤُلاءِ أَهْلُ بَيْتِي وَخاصَّتِي وَحامَّتِي",
        "لَحْمُهُمْ لَحْمِي وَدَمُهُمْ دَمِي",
        "يُؤْلِمُنِي مَا يُؤْلِمُهُمْ",
        "وَيَحْزُنُنِي مَا يَحْزُنُهُمْ",
        "أَنَا حَرْبٌ لِمَنْ حارَبَهُمْ",
        "وَسِلْمٌ لِمَنْ سالَمَهُمْ",
        "وَعَدُوٌّ لِمَنْ عَاداهُمْ",
        "وَمُحِبٌّ لِمَنْ أَحَبَّهُمْ",
        "إِنَّهُمْ مِنِّي وَأَنَا مِنْهُمْ",
        "فَاجْعَلْ صَلَواتِكَ وَبَرَكاتِكَ وَرَحْمَتَكَ",
        "وَغُفْرانَكَ وَرِضْوانَكَ عَلَيَّ",
        "وَعَلَيْهِمْ وَأَذْهِبْ عَنْهُمُ الرِّجْسَ وَطَهِّرْهُمْ تَطْهِيراً.",
        "فَقالَ اللّهُ عَزَّ وَجَلَّ:",
        "يَا مَلائِكَتِي وَيَا سُكَّانَ سَمَاواتِي",
        "إِنِّي إمَا خَلَقْتُ سَماءً مَبْنِيَّةً وَلاَ أَرْضاً مَدْحِيَّةً وَلاَ قَمَراً مُنِيراً",
        "وَلاَ شَمْساً مُضِيئَةً وَلاَ فَلَكاً يَدُورُ وَلاَ بَحْراً يَجْرِي وَلاَ فُلْكاً يَسْرِي",
        "إِلاَّ فِي مَحَبَّةِ هَؤلاءِ الْخَمْسَةِ الَّذِينَ هُمْ تَحْتَ الْكِساءِ.",
        "فَقالَ الاْمِينُ جَبْرائِيلُ: يَارَبِّ وَمَنْ تَحْتَ الْكِساءِ",
        "فَقالَ عَزَّ وَجَلَّ:",
        "هُمْ أَهْلُ بَيْتِ النُّبُوَّةِ وَمَعْدِنُ الرِّسالَةِ",
        "هُمْ فاطِمَةُ وَأَبُوها وَبَعْلُها وَبَنُوها.",
        "فَقالَ جَبْرائِيلُ: يَارَبِّ أَتَأْذَنُ لِي أَنْ أَهْبِطَ إِلَى الاْرْضِ",
        "لأِكُونَ مَعَهُمْ سادِساً",
        "فَقالَ اللّهُ: نَعَمْ قَدْ أَذِنْتُ لَكَ.",
        "فَهَبَطَ الاْمِينُ جَبْرائِيلُ وَقالَ: السَّلامُ عَلَيْكَ يَا رَسُولَ اللّهِ",
        "الْعَلِيُّ الاْعْلى يُقْرِئُكَ السَّلام َوَيَخُصُّكَ بِالتَّحِيَّةِ وَالاْكْرامِ",
        "وَيَقُوْلُ لَكَ :وَعِزَّتِي وَجَلالِي",
        "إِنِّي مَا خَلَقْتُ سَماءً مَبْنِيَّةً",
        "وَلاَ أَرْضاً مَدْحِيَّةً وَلاَ قَمَراً مُنِيراً وَلاَ شَمْساً مُضِيئَةً",
        "وَلاَ فَلَكاً يَدُورُ وَلاَ بَحْراً يَجْرِي وَلاَ فُلْكاً يَسْرِي",
        "إِلاَّ لاِجْلِكُمْ وَمَحَبَّتِكُمْ",
        "وَقَدْ أَذِنَ لِي أَنْ أَدْخُلَ مَعَكُمْ",
        "فَهَلْ تَأْذَنُ لِي يَا رَسُولَ اللّه",
        "فَقالَ رَسُولُ اللّه: وَعَلَيْكَ السَّلامُ يَا أَمِينَ وَحْي اللّهِ",
        "فإِنَّهُ نَعَمْ قَدْ أَذِنْتُ لَكَ.",
        "فَدَخَلَ جَبْرائِيلُ مَعَنا تَحْتَ الْكِساءِ",
        "فَقالَ لاِبِي: إِنَّ اللّهَ قَدْ أَوْحَى إِلَيْكُمْ يَقُولُ:",
        "إِنَّمَا يُرِيدُ اللّهُ لِيُذْهِبَ عَنْكُمُ الرِّجْسَ",
        "أَهْلَ الْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيراً.",
        "فَقالَ عَلِيٌّ لاِبِي: يَا رَسُولَ اللّه أَخْبِرْنِي مَا لِجُلُوسِنا",
        "هذَا تَحْتَ الْكِساءِ مِنَ الْفَضْلِ عِنْدَ اللّهُ",
        "فَقالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَآلِهِ:",
        "وَالَّذِي بَعَثَنِي بِالْحَقِّ نَبِيَّاً",
        "وَاصْطَفانِي بِالرِّسالَةِ نَجِيّاً",
        "مَا ذُكِرَ خَبَرُنا هذَا فِي مَحْفِلٍ مِنْ مَحافِلِ",
        "أَهْلِ الاْرْضِ وَفِيهِ جَمْعٌ مِنْ شِيعَتِنا وَمُحِّبِينا",
        "إِلاَّ وَنَزَلَتْ عَلَيْهِمُ الرَّحْمَةُ",
        "وَحَفَّتْ بِهِمُ الْمَلائِكَةُ وَاسْتَغْفَرَتْ لَهُمْ إِلى أَنْ يَتَفَرَّقُوا.",
        "فَقالَ عَلِيٌّ عَلَيْهِ السَّلامُ: إِذنْ وَاللّهِ فُزْنَا وَفازَ شِيعَتُنا وَرَبِّ الْكَعْبَةِ.",
        "فَقالَ أَبِي رَسُولُ اللّهِ صَلَّى اللهُ عَلَيْهِ وَآلِهِ:",
        "يَا عَلِيُّ وَالَّذِي بَعَثَنِي بِالْحَقِّ نَبِيّاً",
        "وَاصْطَفَانِي بِالرِّسالَةِ نَجِيّاً",
        "مَا ذُكِرَ خَبَرُنا هذَا فِي مَحْفِلٍ مِنْ مَحَافِلِ أَهْلِ الاْرْضِ",
        "وَفِيهِ جَمْعٌ مِنْ شِيعَتِنا وَمُحِبِّينا",
        "وَفِيهِمْ مَهْمُومٌ إِلاَّ وَفَرَّجَ اللّهُ هَمَّهُ",
        "وَلاَ مَغْمُومٌ إِلاَّ وَكَشَفَ اللّهُ غَمَّهُ",
        "وَلاَ طالِبُ حاجَةٍ إِلاَّ وَقَضَى اللّهُ حاجَتَهُ.",
        "فَقالَ عَلِيٌّ عَلَيْهِ السَّلامُ: إِذن وَاللّه فُزْنا وَسُعِدْنا وَكَذلِكَ شِيعَتُنا",
        "فازُوا وَسُعِدُوا فِي الدُّنْيا وَالاْخِرَةِ وَرَبِّ الْكَعْبَةِ.",
        "اَللَّهُمَّ صَلِّ عَلَىٰ مُحَمَّدٍ وَآلِ مُحَمَّدٍ"
    ]
}