{
    "id": "hadith-al-kisa",
    "title": "Hadith al-Kisa",
    "language": "en",
    "text": [
        "DESC: From Shaykh `Abdullah ibn Nurullah al-Bahrani has recorded in his book entitled `Awalim al-`Ulum through an authentic chain of authority that Jabir ibn `Abdullah al-Ansari said that he heard from Syeda Fatimah az-Zahra (sa), the daughter of the Holy Messenger of Allah (saww)",
        "In the Name of Allāh,the All-beneficent, the All-merciful.",
        "O' Allāh send Your blessings on Muhammad and the family of Muhammad.",
        "Fatimatuz-Zahra, the daughter of the Prophet (s), peace be on them, is to have thus related ( an event ) :",
        "My father, the Prophet (s) of Allah, came to my house one day and said to me:",
        "\"Peace be on you, Fatimah\"",
        "I replied : \"And upon you be peace\"",
        "Then he said : \"I feel weakness in my body\"",
        "I said : \"May Allah protect you from weakness, father\"",
        "He said : \"Fatimah, please bring the Yemeni cloak and cover me with it\"",
        "So, I brought the Yemeni cloak and covered him with it.",
        "Then, I looked at him and saw that his face was shining",
        "like a full moon with its glory and splendor",
        "After a while, my son Hasan came in",
        "and said : \"Peace be on you, mother\"",
        "I replied : \"And upon you be peace, O light of my eyes, and the delight of my heart\"",
        "He then said : \"O Mother! I smell a fragrance so sweet",
        "and so pure as that of my grandfather, the Prophet (s) of Allah\"",
        "I replied : \"Yes. Your grandfather is underneath the cloak\"",
        "Hasan went near the cloak and said : \"Peace be on you, my grandfather, the Prophet (s) of Allah;",
        "May I enter the cloak with you?\"",
        "He replied : \"And upon you be peace, my son and the master of my fountain (Kauthar),",
        "you are given the permission to enter\"",
        "So, Hasan entered the cloak with him",
        "After a while, my Husain came in and said :",
        "\"Peace be on you, mother\"",
        "I replied : \"And upon you be peace, O light of my eyes, and the delight of my heart\"",
        "He then said : \"O Mother! I smell a fragrance so sweet",
        "and so pure as that of my grandfather, the Prophet (s) of Allah\"",
        "I replied : \"Yes. Your grandfather and your brother are underneath the cloak\"",
        "Husain stepped towards the cloak",
        "and said : \"Peace be on you, my grandfather, the Chosen of Allah;",
        "May I enter the cloak with you?\"",
        "He replied : \"And upon you be peace, my son",
        "and interceder of my followers, you are given the permission to enter\"",
        "So, Husain entered the cloak with them.",
        "After a while, Abul Hasan, Ali bin Abi Talib came in",
        "and said : \"Peace be on you, O daughter of the Prophet (s) of Allah\"",
        "I replied : \"And upon you be peace, O father of Hasan, and the Commander of the faithful\"",
        "He then said : \"O Fatima! I smell a fragrance so sweet and so pure",
        "as that of my brother and my cousin, the Prophet (s) of Allah\"",
        "I replied: \"Yes. He is underneath the cloak with your two sons\"",
        "So, Ali went near the cloak",
        "and said : \"Peace be on you, Prophet (s) of Allah;",
        "May I enter the cloak with you?\"",
        "He replied : \"And upon you be peace, my brother, my successor,",
        "my successor, and my standard bearer, you are given the permission to enter\"",
        "So, Ali entered the cloak with them.",
        "Then I stepped forward",
        "and said : \"Peace be on you, my father, O Prophet (s) of Allah;",
        "May I enter the cloak with you?\"",
        "He replied : \"And upon you be peace, my daughter, O part of myself; you are given the permission to enter\"",
        "So, I entered the cloak with them.",
        "Getting together underneath the cloak, my father, the Prophet (s) of Allah, held the two ends of the cloak",
        "and raised his right hand towards the heavens and prayed :",
        "\"O Allah, these are the people of my Household (Ahlul-Bayt). They are my confidants and my supporters.",
        "Their flesh is my flesh and their blood is my blood.",
        "Whoever hurts them, hurts me too.",
        "Whoever displeases them, displeases me too.",
        "I am at war with those who are at war with them.",
        "I am at peace with those who are at peace with them.",
        "I am the enemy of their enemies",
        "and I am the friend of their friends.",
        "They are from me and I am from them.",
        "O Allah! Bestow Your Blessings, Benevolence,",
        "Forgiveness and Your pleasure upon me and upon them.",
        "And keep them away from impurity (and flaws) and keep them thoroughly purified\"",
        "Then the Lord, Almighty Allah said :",
        "\"O My angels! O Residents of My Heavens,",
        "verily, I have not created the erected Sky, the stretched earth, the illuminated moon,",
        "the bright sun, the rotating planets, the flowing seas and the sailing ships,",
        "but for the love of these Five underneath the cloak\"",
        "Gabriel, the trusted angel, asked : \"Who are under the cloak?\"",
        "The Almighty answered :",
        "\"They are the Household of the Prophet (s) and the assets of Prophet hood.",
        "They are : Fatimah, her father, her husband and her two sons\"",
        "Gabriel said : \"O Lord, May I fly to earth",
        "to be the sixth of them?\"",
        "Allah replied: \"Yes. You are given the permission\"",
        "Gabriel, the trusted, landed near them and said : \"Peace be on you, O Prophet (s) of Allah.",
        "The All-Highest conveys His peace on you and His greetings",
        "and says: \"By My Honor and Glory, O My angels! O Residents of My Heavens,",
        "verily, I have not created the erected Sky,",
        "the stretched earth, the illuminated moon, the bright sun,",
        "the rotating planets, the flowing seas and the sailing ships,",
        "but for your sake and love\"",
        "and Allah has given me permission to enter the cloak with you.",
        "May I join you, O Prophet (s) of Allah?\"",
        "The Prophet (s) replied : \"And peace be on you, O trusted bearer of Allah's Revelations!",
        "you are granted the permission\"",
        "So, Gabriel entered the cloak with us",
        "and said to my father : Allah sends His Revelations to you;",
        "\"Verily Allah's desire is to keep you away from impurity (and flaws),",
        "O People of Household (Ahlul-Bayt) and keep you thoroughly purified\"",
        "Then Ali said to my father : \"O Prophet (s) of Allah, tell me",
        "what significance has Allah given for getting together underneath this cloak ?\"",
        "The Prophet (s) replied :",
        "\"By Him who rightfully appointed me a Prophet (s)",
        "and chose me a Messenger for the salvation of the mankind.",
        "whenever and wherever an assembly",
        "of our followers and friends mention this event,",
        "Allah will bestow on them His Blessings and Mercy;",
        "angels will encircle them asking Allah the remission of their sins until the assembly disperses",
        "So Ali said : \"Verily, by the Lord of Kabaa! we and our followers are the winners\"",
        "Then my father replied :",
        "\"By Him who rightfully appointed me a Prophet",
        "and chose me a Messenger for the salvation of the mankind,",
        "whenever and wherever an assembly",
        "our followers and friends mentions this event,",
        "there shall remain none grieved but Allah will remove his grief,",
        "there shall remain none distressed but Allah will dispel his distress,",
        "there shall remain none wish-seeker but Allah will grant his wish.\"",
        "`Ali, peace be upon him, said, \"Then, we have won and attained pleasure. I swear it by Allah. So have our adherents;",
        "they have won and attained pleasure in this world and in the Hereafter. I swear it by the Lord of the Ka`bah.\"",
        "O' Allāh send Your blessings on Muhammad and the family of Muhammad."
    ]
}