{
    "id": "salawat---after-asr-on-friday",
    "title": "Salawat - after Asr on Friday",
    "language": "en",
    "text": [
        "DESC: Recited after Asr prayer on Friday",
        "INFO: Salawat",
        "DESC: Recite 100 times",
        "O Allah, bless Muhammad and the Household of Muhammad and hasten their Relief.",
        "INFO: From Imam al-Sadiq (as)",
        "DESC: • To invoke Almighty Allah’s blessings upon the Prophet and his Household in the time between the Dhuhr and `Asr Prayers (on Fridays) is equal (in reward) to seventy rakats.",
        "DESC: • One who says the following invocation after the `Asr Prayer on Fridays will be awarded the reward of the righteous deeds of all men and jinn on that day:",
        "DESC: • One who repeats this invocation 10 times immediately after the `Asr Prayer on Fridays will receive the blessings of the angels up to the next Friday and the very hour.",
        "O Allah, bless Muhammad and the Household of Muhammad—",
        "the Successors and the pleased—",
        "with the best of Your blessings,",
        "and confer upon them",
        "with the best of your favors.",
        "And peace be upon them",
        "and upon their souls and bodies;",
        "and Allah’s mercy and blessings be upon them.",
        "DESC: Adding to this, Shaykh al-Tusi says that it is recommended to repeat the following invocation 100 times at that time:",
        "The blessings of Allah, His angels,",
        "His prophets, His messengers,",
        "and all of His creatures",
        "be upon Muhammad and the Household of Muhammad.",
        "And peace be upon him and upon them",
        "and upon their souls and bodies.",
        "So be Allah’s mercy and blessings.",
        "INFO: By Shaykh al-Kulayni (in al-Kafi)",
        "DESC: • When you complete the Asr Prayer on Friday, say the following invocation. Almighty Allah will record for him 100,000 rewards, erase 100,000 of his evil doings, grant him 100,000 requests, and elevate him 100,000 ranks",
        "DESC: • He adds that if one repeats the same invocation 7 times, Almighty Allah will give him rewards as many as His servants, accept his deeds on that day, and place light between his eyes on the Resurrection Day",
        "O Allah, bless Muhammad and the Household of Muhammad",
        "the Successors and the pleased",
        "with the best of Your blessings,",
        "and confer upon them",
        "with the best of your favors.",
        "And peace be upon him and them",
        "and Allah’s mercy and blessings be also upon them.",
        "INFO: From Imam al-Sadiq (as) - 2",
        "O Allah, O He Who is the most magnanimous of all those who may grant!",
        "O He Who is the best of all those who are asked!",
        "O He Who is the most Merciful of all those whose mercy may be sought!",
        "O Allah, send blessings to Muhammad and his Household among the foremost generations,",
        "send blessings to Muhammad and his Household among the last generations,",
        "send blessings to Muhammad and his Household among the Highest Chiefs,",
        "and send blessings to Muhammad and his Household among the Messengers.",
        "O Allah, (please) grant Muhammad and his Household",
        "the right of mediation, preference,",
        "honor, loftiness,",
        "and the grand rank.",
        "O Allah, I believed in Muhammad,",
        "may Allah’s blessings be upon him and his Household, while I have not seen him;",
        "so, do not deprive me of seeing him on the Resurrection Day,",
        "confer upon me with the favor of accompanying him,",
        "cause me to die while I follow his creed,",
        "and allow me to drink from his Pool",
        "a drink that is quenching,",
        "palatable, and pleasant,",
        "after which I will never be thirsty.",
        "Verily, You have power over all things.",
        "O Allah, I believe in Muhammad,",
        "may Allah’s blessings be upon him and his Household, while I have not seen him;",
        "so, (please) show me his face in the gardens of Paradise.",
        "O Allah, convey to Muhammad,",
        "may Allah’s blessings be upon him and his Household,",
        "many greetings and compliments from me."
    ]
}