{
    "id": "salawat---imam-hassan(as)-&-imam-hussain-(as)",
    "title": "Salawat - Imam Hassan(as) & Imam Hussain (as)",
    "language": "en",
    "text": [
        "O Allah, (please) send blessings upon al-Hasan and al-Husayn,",
        "Your two servants and friends,",
        "the two sons of Your Messengers, the two grandsons of Mercy,",
        "and the two chiefs of the youth of Paradise,",
        "with the most excellent blessings that You have ever sent upon any of the sons of the Prophets and the Messengers.",
        "O Allah, (please) send blessings upon al-Hasan the son of the chief of the Prophets",
        "and the successor of the Commander of the Faithful.",
        "Peace be upon you, O son of Allah's Messenger.",
        "Peace be upon you, O son of the chief of the Prophets’ successors.",
        "I bear witness that you are verily the son of the Commander of the Faithful,",
        "the trustee of Allah, and the son of His trustee.",
        "You lived upright and persecuted",
        "and passed away as martyr.",
        "And I bear witness that you are verily the pure,",
        "guiding, and well-guided leader.",
        "O Allah, (please) send blessings upon him",
        "and convey to his soul and body",
        "at this hour the best greeting and salutation from me.",
        "O Allah, (please) send blessings upon al-Husayn the son of `Ali,",
        "the oppressed, the martyr,",
        "the slain by the unbelievers, and the thrown down by the sinful people.",
        "Peace be upon you, O Abu-`Abdullah.",
        "Peace be upon you, O son of Allah's Messenger.",
        "Peace be upon you, O son of the Commander of the Faithful.",
        "I bear witness with full conviction that you are verily the trustee of Allah and the son of His trustee.",
        "You were killed wrongly and you passed away as martyr.",
        "I also bear witness that Allah the All-exalted is the One Who shall avenge You",
        "and shall fulfill His promise to You of support and victory",
        "through exterminating your enemies and demonstrating your call (to the true guidance).",
        "I also bear witness that you fulfilled your covenant with Allah,",
        "strove hard for His sake,",
        "and served Allah sincerely until death came upon you.",
        "May Allah curse the people who killed you.",
        "May Allah curse the people who disappointed you.",
        "May Allah curse the people who incited people against you.",
        "I release myself before Allah the All-exalted from those who belied you,",
        "belittled your right, and allowed themselves to shed your blood.",
        "May my father and mother be ransoms for you.",
        "Allah's curse be on those who killed you.",
        "Allah's curse be on those who let you down.",
        "Allah's curse be on those who heard your call (for help), but they refrained from responding to you or supporting you.",
        "Allah's curse be on those who captured your women.",
        "I disavow them all before Allah and disavow those who adhered to them,",
        "those who kept up with them, and those who helped them against you.",
        "I also bear witness that you and the Imams from your descendants are the word of piety,",
        "the door to true guidance, the firmest handle,",
        "and the argument against the inhabitants of this world.",
        "I also bear witness that I have full faith in you,",
        "I have conviction in your standing,",
        "and I always follow you in myself,",
        "in the laws of my religion, in my sealing deeds,",
        "in my tour, and in my settlement in this worldly life and the Hereafter."
    ]
}