{
    "id": "dua-ahad",
    "title": "Dua Ahad",
    "language": "en",
    "text": [
        "DESC: Spplication of Allegiance (Ahad) to Imam Mahdi (ajtfs)",
        "DESC: Imam Sadiq (as) narrates that “one who recites this supplication for 40 mornings; he will be counted amongst the helpers of Imam Mahdi (ajtfs)",
        "O Allah the Lord of the Great Light,",
        "the Lord of the Elevated Throne,",
        "the Lord of the swollen ocean,",
        "the Revealer of the Torah, the Gospel, and the Psalms,",
        "the Lord of shade and heat,",
        "the Revealer of the Great Qur'an,",
        "and the Lord of the Archangels,",
        "the Prophets, and the Messengers:",
        "O Allah, I beseech You in Your Noble Name,",
        "in the Light of Your Luminous Face",
        "and Your Eternal Kingdom.",
        "O Ever-living! O Self-Subsistent!",
        "I beseech You in the name of Your Name with which the heavens and the earth have lit up",
        "and in Your Name with which the past and the coming generations have become upright!",
        "O He Who has been always alive before the existence of all living things!",
        "O He Who shall be alive after the extinction of all living things!",
        "O He Who has been always alive even when there was nothing else alive!",
        "O He Who revives the dead ones and causes the living ones to die!",
        "O Ever-living! There is no god save You.",
        "O Allah, convey to our master Imam al-Mahdi, the guide who is to undertake Your orders,",
        "may Allah’s blessings be upon him and upon his immaculate fathers,",
        "on behalf of all of the believing men and women",
        "in the east and west of the earth",
        "and in plains, mountains,",
        "lands, and seas,",
        "and on behalf of my parents",
        "(convey to him) blessings that are as weighty as Allah’s Throne,",
        "as much as the ink of His Words,",
        "and as many as that which is counted by His knowledge and encompassed by His Book.",
        "O Allah, I update to him in the beginning of this day",
        "and throughout the days of lifetime a pledge,",
        "a covenant, and allegiance to which I commit myself",
        "and from which I neither convert nor change.",
        "O Allah, (please do) make me of his supporters,",
        "sponsors, defenders,",
        "and those who hurry in carrying out his instructions,",
        "those who comply with his orders,",
        "those who uphold him,",
        "those who precede others to implementing his will,",
        "and those who will be martyred before him.",
        "O Allah, if death that You have made inevitably and certainly incumbent upon Your servants stands between me and him,",
        "then (please do) take me out of my grave using my shroud as dress,",
        "unsheathing my sword,",
        "holding my lance in my hand,",
        "and responding to the call of the Caller who shall announce (his advent) in urban areas and deserts.",
        "O Allah, (please do) show me his magnificent mien",
        "and his praiseworthy forehead,",
        "delight my eyes by letting me have a look at him.",
        "And (please) expedite his relief,",
        "make his reappearance easy,",
        "clear a spacious space for him,",
        "guide me to follow his course,",
        "give success to his issues,",
        "and confirm his strength.",
        "O Allah, construct Your lands through him",
        "and refresh Your servants through him,",
        "For You have said, and true are Your words:",
        "“Corruption has appeared in the land and the sea",
        "on account of what the hands of men have wrought.”",
        "So, O Allah, (please) show us Your vicegerent,",
        "the son of Your Prophet,",
        "and the namesake of Your Messenger,",
        "peace be upon him and his Household,",
        "so that he shall tear up any wrong item that he will face",
        "and shall confirm and approve of the truth.",
        "O Allah, (please) make him the shelter to whom Your wronged servants shall resort,",
        "the supporter of those who cannot find any supporter save You,",
        "the reviver of the laws of Your Book that have been suspended,",
        "and the constructor of all signs of Your religion and instructions of Your Messenger,",
        "peace be upon him and his Household, that he will see.",
        "O Allah, (please) include him with those whom You protect from the domination of the aggressors.",
        "O Allah, (please) delight Your Prophet Muhammad,",
        "peace be upon him and his Household,",
        "as well as all those who followed him in his promulgation by making (us) see him,",
        "and (please) have mercy upon our humiliation after him.",
        "O Allah, (please) relieve this community from the (current) grief through presenting him",
        "and expedite his advent for us:",
        "“Surely, they think it to be far off, and We see it nigh.”",
        "[do all that] In the name of Your mercy; O most merciful of all those who show mercy.",
        "DESC: You may then slap your right thigh with your hand three times and, at each time, say the following:",
        "(We pray for Your) earliest advent, earliest advent, O Patron of the Age."
    ]
}