{
    "id": "dua-al-husayn-(as)---ashura,-3rd-shaban",
    "title": "Dua al-Husayn (as) - Ashura, 3rd Shaban",
    "language": "en",
    "text": [
        "INFO: Introduction",
        "DESC: Dua al-Husayn, which is the last prayer he (as) said when his enemies surrounded him in large numbers on the Day of Ashura (the tenth of Muharram):",
        "DESC: Ibn `Ayyash has reported al-Husayn ibn `Ali ibn Sufyan al-Bazufi as saying that he heard Imam Ja`far al-Sadiq (as) saying this prayer on the 3rd Sha`ban, the birthday of Imam al-Husayn (as).",
        "INFO: Dua",
        "O Allah, You are verily the Elevated in position,",
        "the Magnificent in omnipotence,",
        "the Mighty in prowess,",
        "the Self-Sufficient from the creatures,",
        "the Ample in pride,",
        "the Powerful over all that which You want,",
        "the Close in mercy,",
        "the Truthful in promise,",
        "the Opulent in favors,",
        "the Sympathetic in ordeals,",
        "the Nigh when Your are prayed,",
        "the All-encompassing of all that which You have created,",
        "the Accepter of the repentance of him who repents to You,",
        "the Powerful to do whatever You want,",
        "the Taker in all that which You decide,",
        "the Thankful for those who thank You,",
        "and the Rememberer of those who mention You.",
        "I pray You for I need You,",
        "I desire for You for I am in want of You,",
        "I resort to You for I am terrified,",
        "I weep before You for I am distressed,",
        "I seek Your aid for I am weak,",
        "and I depend upon You for I trust in none save You.",
        "(Please do) decide between our people and us with the truth,",
        "for they have deceived us, cheated us,",
        "disappointed us, betrayed us, and killed us.",
        "We are the progeny of Your Prophet",
        "and the sons of Your beloved one;",
        "namely, Muhammad the son of `Abdullah,",
        "whom You have chosen for the Divine Mission",
        "and for keeping Your Revelation.",
        "So, (please) prepare a way out and a relief for us,",
        "out of Your mercy, O most Merciful of all those who show mercy!"
    ]
}