{
    "id": "dua-nudba",
    "title": "Dua Nudba",
    "language": "en",
    "text": [
        "DESC: Calling out to Imam Mahdi (ajtfs)",
        "DESC: Recited on Friday Mornings - Eids",
        "All praise be to Allah the Lord of the worlds.",
        "May Allah send blessings upon our master Muhammad His Prophet",
        "and upon his Household and may He salute them with thorough salutation.",
        "O Allah, all praise be to You",
        "for Your decree that has been applied",
        "to Your vicegerents whom You have purely selected for Yourself and Your religion;",
        "as You have chosen for them the abundance of what You have in possession;",
        "that is the enduring pleasure",
        "that neither vanishes nor diminishes,",
        "after You had already stipulated on them to renounce",
        "all the ranks of this lowly world",
        "along with all of its embellishments and ornaments,",
        "and they accepted this stipulation.",
        "As You knew that they would fulfill this stipulation,",
        "You accepted and drew them near to You.",
        "You thus provided them with sublime mention",
        "and obvious approval,",
        "made Your angels descend to them,",
        "honored them with Your revelations,",
        "supported them with Your knowledge,",
        "and made them the channel to You",
        "and the means to winning Your pleasure.",
        "Therefore, You made some of them dwell in Your Garden",
        "until You decided to take him out of there.",
        "You bore another one on in Your Ark",
        "and saved him and those who believed with him",
        "from perdition, out of Your mercy.",
        "You took another one as Your intimate friend",
        "and when he asked You to leave behind him a truthful mention, You responded to him",
        "and made that (mention) to be eminent.",
        "You spoke to another one from a tree directly",
        "and decided his brother to be his protector and representative.",
        "You made another one to be born without a father,",
        "gave him clear-cut proofs",
        "and aided him with the Sacred Spirit.",
        "For each of them, You gave a code of law,",
        "decided a certain course,",
        "and finely chose successors;",
        "well-trustworthy successors one after another,",
        "each for a certain period,",
        "in purpose of establishing Your religion",
        "and acting as arguments against Your servants,",
        "so that the truth should never leave its position",
        "and the wrong should never overcome the people of the truth",
        "and so that none should claim, saying,",
        "“If only You had sent to us a warning messenger",
        "and established for us a guiding person,",
        "we should have followed Your signs before that we met humiliation and disgrace!”",
        "You then ended the matter with Your most-beloved and well-select one, Muhammad,",
        "may Allah bless him and his Household.",
        "He was—as exactly as You have chosen—",
        "the master of all those whom You created,",
        "the best of all those whom You selected,",
        "the most favorite of all those whom You pointed out,",
        "and the noblest of all those on whom You decided.",
        "So, You preferred him to Your prophets,",
        "sent him to the two dependents (men and jinn) from Your servants,",
        "enabled him to tread on the east and the west of Your lands,",
        "made subservient to him the Buraq (the celestial sumpter),",
        "raised him to Your heavens,",
        "and entrusted with him the knowledge of whatever passed",
        "and whatever shall come to pass up to the extinction of Your creatures.",
        "You then granted him victory by means of awe & majesty",
        "ordered (Archangels) Gabriel and Michael",
        "as well as the marked angels to surround him,",
        "and promised him to make his faith prevail all other faiths",
        "however much the polytheists may be averse.",
        "You did all that after You had settled him in an honest position among his people,",
        "made for him and them the first house",
        "ever located for the people; that is the house in Bakkah,",
        "blessed and guidance for the worlds.",
        "In it, there are clear-cut proofs.",
        "It is the standing-place of Abraham,",
        "and whoever enters it will be secured.",
        "You also said, “Allah only desires to keep away the uncleanness from you,",
        "O people of the House,",
        "and to purify you a thorough purifying.”",
        "You then decided the reward of Muhammad,",
        "Your blessings be upon him and his Household,",
        "to be the love for them; as in Your Book",
        "You said, “Say: I do not ask of you any reward for it",
        "but love for my near relatives.”",
        "You also said, “Whatever reward I have asked of you, that is only for yourselves.”",
        "You also said, “I do not ask you aught in return",
        "except that he who wills, may take the way to his Lord.”",
        "They (i.e. the Prophet’s Household) have therefore been the way to You",
        "and the course to Your pleasure.",
        "When his (i.e. the Prophet) days passed,",
        "he appointed as successor his vicegerent `Ali the son of Abu-Talib,",
        "Your blessings be upon both of them and their Household,",
        "because he (the Prophet) was the warner",
        "and `Ali was the guide for every people.",
        "So, he (the Prophet) said in the presence of the people,",
        "“As for each one who has taken me as his master,",
        "`Ali is now his master.",
        "O Allah, guard any one who is loyal to `Ali,",
        "be the enemy of any one who antagonizes him,",
        "support any one who supports him,",
        "and disappoint any one who disappoints him.”",
        "He also said, “As for any one who has considered me as his Prophet, `Ali is now his commander.”",
        "He also said, “`Ali and I are of the same tree,",
        "while all the other peoples are from various trees.”",
        "He endued him (i.e. `Ali) with the position that (Prophet) Aaron had with regard to (Prophet) Moses,",
        "saying, “Your position to me is as same as Aaron’s position to Moses (in every thing)",
        "except that there shall be no prophet after me.”",
        "He gave him in marriage his daughter the doyenne of the women of the worlds.",
        "He allowed him (alone) to do whatever he himself is allowed to do in his Mosque.",
        "He closed all the doors (to the Mosque) except his (i.e. `Ali) door.",
        "He then entrusted with him his knowledge and his wisdom,",
        "saying, “I am the city of knowledge,",
        "and `Ali is its door.",
        "So, whoever wants this city and wisdom,",
        "must come to it from its door.”",
        "He then said (to `Ali), “You are my brother, successor, and inheritor.",
        "Your flesh is part of my flesh,",
        "your blood is part of my blood,",
        "your peace is my peace,",
        "your war is my war,",
        "and faith is mixed with your flesh and blood",
        "as same as it is mixed with my flesh and blood.",
        "On the morrow, you shall be my vicegerent on the (Divine) Pond.",
        "You also settle my debts",
        "and fulfill my commitments.",
        "Your Shi`ah (i.e. adherents) shall be on pulpits of light,",
        "white-faced, around me in Paradise.",
        "They are my neighbors (therein).",
        "Were it not for you `Ali,",
        "true believers would not be recognized after me.”",
        "Hence, he (i.e. `Ali), after the Prophet, was true guidance against straying off,",
        "light against blindness,",
        "the firmest rope of Allah,",
        "and His straight path.",
        "None would precede him in blood relation (with the Prophet)",
        "or any priority in a religious affair,",
        "and none would ever match him in any item of virtue.",
        "He patterned after the Messenger,",
        "may Allah’s blessings be upon both of them and their Household.",
        "He fought for the sake of true interpretation (of the Qur'an).",
        "The blame of any blamer would never stop him from doing anything for the sake of Allah.",
        "He thus exterminated the villains of the Arabs,",
        "killed their heroes,",
        "and eradicated their ferocious fighters.",
        "He therefore filled in their hearts with malice",
        "from the battles of Badr, Khaybar, and Hunayn as well as others.",
        "Therefore, they clang inseparably to opposing him",
        "and attached upon dissenting him",
        "until he had to kill the preachers, the unjust, and the apostates.",
        "When he passed away",
        "and he was killed by the most miserable of all of the late generations who will be attached to the most miserable of the past generations,",
        "the decree of Allah’s Messenger,",
        "may Allah bless him and his Household,",
        "about the leadership of the successive guiding ones was not carried out;",
        "rather, the people insisted on detesting him",
        "and agreed unanimously on rupturing their relations with him",
        "and moving away his descendants (from leadership),",
        "except for a few ones who fulfilled the duty of observing their rights.",
        "Many (of `Ali’s descendants) were therefore slain,",
        "many others were taken as captives,",
        "and many others were banished.",
        "Decrees were thus applied to them",
        "in a form expected to grant them excellent reward for that.",
        "Verily, the earth is Allah’s;",
        "He gives it in inheritance to whomever of His servants that He wishes;",
        "and the end result shall be for the pious.",
        "All glory be to our Lord.",
        "Most certainly, the promise of our Lord shall come to pass.",
        "Allah shall never fail to fulfill His promise.",
        "He is the Almighty, the All-wise.",
        "For the immaculate ones from the household of Muhammad and `Ali,",
        "may Allah bless both of them and their household,",
        "let weepers weep.",
        "For them too, let lamenters lament.",
        "For the like of them, let tears be shed,",
        "screamers scream,",
        "yellers yell,",
        "and wailers wail.",
        "Where is al-Hasan? Where is al-Husayn?",
        "Where are the sons of al-Husayn;",
        "a virtuous one after another,",
        "and a veracious one after another?",
        "Where is the course (to Allah) after a course?",
        "Where is the best after the best?",
        "Where are the rising suns?",
        "Where are the shining moons?",
        "Where are the brilliant stars?",
        "Where are the authorities of the religion",
        "and the foundations of knowledge?",
        "Where is the left by Allah",
        "that is always represented by individuals from the guiding (Prophetic) offspring?",
        "Where is the one prepared for cutting off the roots of the wrongdoers?",
        "Where is the one awaited for mending every unevenness and crookedness?",
        "Where is the one hoped for removing oppression and aggression?",
        "Where is the one spared for refreshing the duties and traditions?",
        "Where is the one chosen for restoring the faith and the code of law?",
        "Where is the one expected to restore to life the Book and its provisions?",
        "Where is the reviver of the elements of the religion and its people?",
        "Where is the one shattering the arms of the aggressors?",
        "Where is the one demolishing the edifices of polytheism and hypocrisy?",
        "Where is the one annihilating the people of wickedness,",
        "disobedience, and tyranny?",
        "Where is the one uprooting the branches of error and insurgence?",
        "Where is the one effacing the traces of evasiveness and personal desires?",
        "Where is the one severing the ropes of fabrication and forgery?",
        "Where is the one terminating the insolent defiant and persistent rebels?",
        "Where is the one tearing up the people of obstinacy, misleading, and atheism?",
        "Where is the one ennobling the saints and humiliating the enemies?",
        "Where is the one bringing together (all scattered) words to piety?",
        "Where is the door of Allah from which Allah is come?",
        "Where is the Face of Allah towards whom the saints turn their faces.",
        "Where is the means of access that is connectedly extended between the earth and the heavens.",
        "Where is the patron of the Conquest Day",
        "and the stretcher of the pennon of true guidance?",
        "Where is the one reunifying the dispersed parts of uprightness and contentment?",
        "Where is the one demanding with the vengeance of the Prophets and their sons?",
        "Where is the one demanding with the blood of the one slain in Karbala'?",
        "Where is the one granted aid against whomever transgresses and forges lies against him?",
        "Where is the distressed who is answered when he prays?",
        "Where is the forepart of the creatures who enjoys dutifulness and piety?",
        "Where is the son of the well-chosen Prophet,",
        "the son of `Ali the well-pleased,",
        "the son of Khadijah the glittery lady,",
        "and the son of Fatimah the grand lady?",
        "May my father and mother be ransoms for you.",
        "May my soul be protection and shield for you.",
        "O son of the chiefs drawn near!",
        "O son of the most honorable, outstanding ones!",
        "O son of the guiding and well-guided ones!",
        "O son of the ever-best refined ones!",
        "O son of the all-liberal and all-select ones!",
        "O son of the immaculate and purified ones!",
        "O son of the ample-giving, finely elected ones!",
        "O son of the bounteous, most honorable ones!",
        "O son of light-giving full moons!",
        "O son of beaming lanterns!",
        "O son of piercing flames!",
        "O son of luminous stars!",
        "O son of patent ways!",
        "O son of obvious signs!",
        "O son of perfect knowledge!",
        "O son of renowned traditions!",
        "O son of well-established features!",
        "O son of well-known miracles!",
        "O son of widely witnessed demonstrations!",
        "O son of the straight path!",
        "O son of the great news!",
        "O son of him who is elevated and full of wisdom in the original of the Book with Allah.",
        "O son of signs and manifestations!",
        "O son of apparent points of evidence!",
        "O son of clear-cut and dazzling substantiations!",
        "O son of conclusive arguments!",
        "O son of superabundant bounties!",
        "O son of Taha and the decisive (verses)!",
        "O son of Yasin and al-Dhariyat (the winnowing winds)!",
        "O son of al-Tur (the Mount of Revelation) and al-`ªdiyat (the running steeds)!",
        "O son of him who drew near and then bowed;",
        "he therefore was the measure of two bows or closer still;",
        "nearness and closeness to the Most High and Most Exalted (Lord)!",
        "How I wonder! Where has farness taken you?",
        "Or which land or soil is carrying you?",
        "Is it on (Mount) Radwa or elsewhere on (Mount) Dhi-Tuwa?",
        "It is hard for me that I can see all creatures but I can neither see you",
        "nor can I hear any whisper or confidential talk from you!",
        "It is hard for me that ordeals encompass you, not me",
        "and neither cry nor complaint from me can rally round you!",
        "May my soul be ransom for you; for although you are hidden from us, you have never forsaken us.",
        "May my soul be ransom for you; for although you are away, you have never been away from us.",
        "May my soul be ransom for you; for you are the wish of an eager",
        "believing man or woman who mention you and miss you.",
        "May my soul be ransom for you; for you are an unmatched pioneer of dignity.",
        "May my soul be ransom for you; for you are an unrivaled origin of glory.",
        "May my soul be ransom for you; for you are unparalleled center of bounties.",
        "May my soul be ransom for you; for you are unequaled in all-inclusive honor.",
        "Until when will I be bewildered about you, O my master, and until when?",
        "In what kind of statement and in what kind of talk can I describe you?",
        "It is hard for me that I can receive answers and words, but you cannot.",
        "It is hard for me that I weep for you but the others disappoint you.",
        "It is hard for me that what has happened afflict you other than all the others.",
        "Is there any helper with whom I may lament and bewail as much as I wish?",
        "Is there any aggrieved one whom I can help in grief when he becomes tired?",
        "Is there any eye moling out and thus my eye may help it to mol out more?",
        "Is there any way to meet you, O son of Ahmad (the Prophet)?",
        "Will our day be promised to catch your day and we will thus achieve our hope?",
        "When will we be able to join your refreshing springs and we will then be satiated?",
        "When will we quench our thirst from your fresh water,",
        "because thirst has been too long?",
        "When will we accompany you in coming and going so that our eyes will be delighted?",
        "When will you see us and we see you spreading the pennon of victory?",
        "Can it be that we surround you while you are leading the groups,",
        "after you will have filled in the earth with justice,",
        "tasted your enemies humiliation and punishment,",
        "annihilated the insolent defiant and the deniers of the truth,",
        "cut off the roots of the arrogant,",
        "eradicated the sources of the wrongdoers,",
        "and we keep on saying, “All praise be to Allah the Lord of the worlds?”",
        "O Allah, You are verily the reliever from agonies and ordeals.",
        "To You do I complain about the transgressions against me, for You alone are worthy of receiving complaints,",
        "and You are alone the Lord of the Hereafter and this world.",
        "So, (please) aid Your agonized worthless servant, O Aide of those who seek aid,",
        "grant him (i.e. Your servant) chance to see his master, O Lord of mighty prowess,",
        "remove from him misfortune and anguish, in the name of his master,",
        "and satisfy his thirst, O He Who is established on the Throne",
        "and He to Whom is the return and the final goal.",
        "O Allah, we are Your servants who are fervently willing to meet Your vicegerent,",
        "who reminds of You and Your Prophet;",
        "and whom You have created as haven and refuge for us,",
        "You have appointed as foundation and source of protection for us,",
        "and whom You have made to be the leader of the believers among us.",
        "So, (please) convey to him greetings and salutations from us,",
        "endue us with more honor, O my Lord, through that,",
        "decide his settlement among us to be settlement and dwelling for us,",
        "and perfect Your bounty by making him occupy the leading position before us",
        "so that You shall allow us to enter the gardens of Your Paradise",
        "and to accompany the martyrs from among Your elite ones.",
        "O Allah, (please) send blessings upon Muhammad and the Household of Muhammad;([1])",
        "and send blessings upon Muhammad his grandfather and Your messenger;",
        "the senior master,",
        "upon his father the junior master,",
        "upon his grandmother the grand veracious lady",
        "Fatimah the daughter of Muhammad,",
        "peace be upon him and his Household,",
        "upon his dutiful fathers whom You have chosen (over all others),",
        "and upon him with such most favorable, most perfect,",
        "most thorough, most permanent,",
        "most abundant, and most plentiful",
        "blessings that You have ever sent upon any of Your elite ones",
        "and well-chosen ones among Your creatures.",
        "And (please) bless him with such blessings whose number is infinite,",
        "whose quantity is never-ending,",
        "and whose time is interminable.",
        "O Allah! Through him, establish all rights,",
        "refute the entire wrong,",
        "grant triumph to Your loyalists,",
        "humiliate Your enemies,",
        "establish, O Allah, between him and us",
        "a connection that leads us to accompany his ancestors,",
        "include us with those who will take their vengeance",
        "and keep constant under their shadow,",
        "help us fulfill our duties towards him,",
        "exert all efforts in obedience to him",
        "and avoiding disobeying him,",
        "bestow upon us with the favor of attaining his pleasure,",
        "and grant us his kindness, mercy,",
        "prayer (for us), and his goodness",
        "in an amount due to which we will gain a good deal of Your mercy",
        "and achievement with You.",
        "And, through him, render our prayers admitted,",
        "our sins forgiven,",
        "and our supplications responded.",
        "And, through him too, make our sustenance expanded for us,",
        "our distresses relieved,",
        "and our needs granted.",
        "And (please) receive us with Your Noble Face,",
        "approve of our seeking nearness to You,",
        "and have a merciful look at us",
        "by which we will win perfect honor with You;",
        "and, after that, do not ever take it away from us, in the name of Your magnanimity,",
        "and give us a drink from the Pond of his grandfather,",
        "may Allah bless him and his Household,",
        "from his own cup and with his own hand,",
        "such a replete, satiating,",
        "pleasant, and wholesome drink",
        "after which we shall never suffer from thirst.",
        "O most merciful of all those who show mercy!"
    ]
}