{
    "id": "dua-kumayl",
    "title": "Dua Kumayl",
    "language": "en",
    "text": [
        "DESC: Imam Ali (as) advised Kumayl Ibn Ziyad Nakha'i (ra) to recite this \"Du'a\" on the eve of (i.e. evening preceding) every Friday, or once a month or at least once in every year so that, added Imam Ali(AS), \"Allah may protect thee from the evils of the enemies and the plots contrived by impostors. O' Kumayl! in consideration of thy companionship and understanding, I grant thee this honour of entrusting this \"Du'a\" to thee.\"",
        "In the Name of Allah, the All-merciful, the All-compassionate",
        "O Allah, I ask You by Your mercy, which embraces all things;",
        "And by Your strength, through which You dominatest all things,",
        "And toward which all things are humble",
        "And before which all things are lowly;",
        "And by Your invincibility through which You overwhelmest all things,",
        "And by Your might, which nothing can resist;",
        "And by Your tremendousness, which has filled all things;",
        "by Your force, which towers over all things;",
        "And by Your face, which subsists after the annihilation of all things,",
        "And by Your Names, which have filled the foundations of all things;",
        "And by Your knowledge, which encompasses all things;",
        "And by the light of Your face, through which all things are illumined!",
        "O Light! O All-holy!",
        "O First of those who are first",
        "And O Last of those who are last!",
        "O Allah, forgive me those sins which tear apart safeguards!",
        "O Allah, forgive me those sins which draw down adversities!",
        "O Allah, forgive me those sins which alter blessings!",
        "O Allah forgive me those sins which hold back supplication!",
        "O Allah forgive me those sins which cut down the hopes!",
        "O Allah, forgive me those sins which draw down tribulation!",
        "O Allah, forgive me every sin I have committed and every mistake I have made!",
        "O Allah, verily I seek nearness to You through remembrance of You,",
        "And I seek intercession from You with Yourself,",
        "And I ask You through Your munificence to bring me near to Your proximity,",
        "And to provide me with gratitude toward You",
        "And to inspire me with Your remembrance.",
        "O Allah, verily I ask You with the asking of a submissive, abased and lowly man to show me forbearance, to have mercy on me",
        "And to make me satisfied and content with Your appointment and [make me] humble in every state.",
        "O Allah, I ask You the question of one whose indigence is extreme,",
        "And who has stated to You in difficulties his need",
        "And whose desire for what is with You has become great.",
        "O Allah, Your force is tremendous, Your place is lofty,",
        "And Your plan is hidden, Your command is manifest,",
        "And Your domination is overwhelming, Your power is unhindered",
        "And escape from Your governance is impossible.",
        "O Allah, I find no forgiver of my sins,",
        "Nor concealer of my ugly acts",
        "Nor transformer of any of my ugly acts into good acts but You",
        "There is no god but You!",
        "Glory be to You, and Thine is the praise!",
        "I have wronged myself,",
        "And I have been audacious in my ignorance",
        "And I have depended upon Your ancient remembrance of me and Your favour toward me.",
        "O Allah! O my Protector!",
        "How many ugly things You hast concealed!",
        "How many burdensome tribulations You hast abolished!",
        "And how many stumbles You hast prevented!",
        "And how many ordeals You hast repelled!",
        "And how much beautiful praise, for which I was unworthy, You hast spread abroad!",
        "O Allah, my tribulation is tremendous,",
        "And my bad state is excessive,",
        "And my acts are inadequate,",
        "And my fetters have tied me down,",
        "And my far-fetched hopes have held me back from my gain",
        "And this world with its delusions, my own soul with its offences and my delay have deceived me.",
        "O my Master! So I ask You by Your might not to let my evil works and acts veil my supplication from You,",
        "And not to disgrace me through the hidden things You knowest of my secrets",
        "And not to hasten me to punishment for what I have done in private:",
        "My evil acts in secrecy and my misdeeds",
        "And my continuous negligence and my ignorance",
        "And my manifold passions and my forgetfulness.",
        "And by Your might, O Allah, be kind to me in all states",
        "And be gracious to me in all affairs!",
        "My God and my Lord! Have I any but You from whom to ask removal of my affliction and regard for my affairs!",
        "My God and my Protector! You put into effect through me a decree in which I followed the caprice of my own soul",
        "And [I] did not remain wary of adorning my enemy.",
        "So he deluded me through my soul's caprice and therein destiny favoured him",
        "So, in what was put into effect through me in that situation, I transgressed some of Your statutes",
        "And disobeyed some of Your commands.",
        "So Thine is the argument against me in all of that",
        "I have no argument in what Your destiny put into effect through me therein",
        "nor in what Your decree and Your tribulation imposed upon me.",
        "Now I have come to You, My God, after my shortcoming and my immoderation toward myself,",
        "Proffering my excuse, regretful,",
        "Broken, apologizing,",
        "Asking forgiveness, repenting,",
        "Acknowledging, submissive, confessing.",
        "I find no place to flee from what occurred through me,",
        "Nor any place of escape to which I may turn in my affairs,",
        "Other than Your acceptance of my excuse and Your entering me into the compass of Your mercy.",
        "O Allah, so accept my excuse,",
        "Have mercy upon the severity of my affliction",
        "And release me from the tightness of my fetters,",
        "My Lord, have mercy upon the weakness of my body, the thinness of my skin and the frailty of my bones.",
        "O You who gave rise to my creation, to the remembrance of me, to the nurture of me, to goodness toward me and to nourishment on me,",
        "Bestow upon me for the sake of Your having given rise [to me] with generosity and Your previous goodness to me!",
        "O Allah, my Master and my Lord!",
        "Canst You see Yourself tormenting me with Your fire after I have professed Your Unity",
        "And after the knowledge of You my heart has embraced,",
        "And the remembrance of You my tongue has constantly mentioned",
        "And the love of You to which my mind has clung,",
        "And after the sincerity of my confession and my supplication, humble before Your lordship?",
        "Far be it from You! You art more generous than that You shouldst squander him whom You hast nurtured,",
        "Or banish him whom You hast brought nigh,",
        "Or drive away him whom You hast given an abode",
        "Or submit to tribulation him whom You hast spared and shown mercy.",
        "Would that I knew, my Master, My God and my Protector,",
        "Whether You wilt give the Fire dominion over faces fallen down prostrate before Your Tremendousness,",
        "And over tongues voicing sincerely the profession of Your Unity and giving thanks to You in praise,",
        "And over hearts acknowledging Your Divinity through verification,",
        "And over minds encompassing knowledge of You until they have become humble",
        "And over bodily members speeding to the places of Your worship in obedience and beckoning for Your forgiveness in submission.",
        "No such opinion is held of You! Nor has such been reported - thanks to Your bounty — concerning You,",
        "O All-generous! My Lord,",
        "And You knowest my weakness before a little of this world's tribulations and punishments,",
        "And before those ordeals which befall its inhabitants,",
        "Even though it is a tribulation and ordeal whose stay is short, whose subsistence is but little and, whose period is but fleeting.",
        "So how can I endure the tribulations of the next world and the great ordeals that occur within it?",
        "For it is a tribulation whose period is long, whose station endures and whose sufferers are given no respite,",
        "Since it only occurs as a result of Your wrath, Your vengeance and Your anger,",
        "And these cannot be withstood by the heavens and the earth.",
        "O Master, so what about me?!",
        "For I am Your weak, lowly, base, wretched and miserable slave.",
        "My God! My Lord! My Master! My Protector!",
        "For which things would I complain to You?",
        "And for which of them would I lament and weep?",
        "For the pain and severity of chastisement?",
        "Or for the length and period of tribulation?",
        "So if You takest me to the punishments with Your enemies,",
        "And gatherest me with the people of Your tribulation",
        "And separatest me from Your friends and saints,",
        "Then suppose, My God, my Master, my Protector and my Lord that I am able to endure Your chastisement,",
        "How can I endure separation from You?",
        "And suppose that I am able to endure the heat of Your fire,",
        "How can I endure not gazing upon Your generosity?",
        "Or how can I dwell in the Fire while my hope is Your pardon?",
        "So by Your might, my Master and my protector, I swear sincerely, if You leavest me with speech,",
        "I will lament to You from the midst of the Fire's inhabitants with lamentation of the hopeful;",
        "I will cry to You with the cry of those crying for help;",
        "I will weep to You with the weeping of the bereft;",
        "And I will call to You, Where art You, O Sponsor of the believers,",
        "O Goal of the hopes of Your knowers,",
        "O Aid of those who seek assistance,",
        "O Friend of the hearts of the sincere",
        "And O God of all the world's inhabitants!",
        "Canst You see Yourself — Glory be to You My God, and Thine is the praised — hearing within the Fire the voice of a slave surrendered to You,",
        "Imprisoned there because of his violations,",
        "Tasting the favour of its torment because of his disobedience,",
        "And confined within its levels because of his sin and crime,",
        "While he laments to You with the lament of one hopeful for Your mercy,",
        "And calls to You with the tongue of those who profess Your Unity",
        "And entreats You by Your lordship!",
        "My Protector, so how should he remain in the chastisement, while he has hope for Your previous clemency?",
        "Or how should the Fire cause him pain while he expects Your bounty and mercy?",
        "Or how should its flames burn him, while You hearest his voice and seest his place?",
        "Or how should its groaning encompass him, while You knowest his weakness?",
        "Or how should he be convulsed among its levels, while You knowest his sincerity?",
        "Or how should its keepers torture him while he calls out to You, O Lord?",
        "Or how should he have hope of Your bounty in freeing him from it, while You abandonest him within it?",
        "Far be it from You! That is not what is expected of You,",
        "Nor what is well-known of Your bounty,",
        "Nor it is similar to the goodness and kindness You hast shown to those who profess Your Unity.",
        "So I declare with certainty that were it not for what You hast decreed concerning the chastisement of Your deniers",
        "And what You hast foreordained concerning the everlasting home of those who stubbornly resist,",
        "You wouldst make the Fire, all of it, coolness and safety,",
        "And no one would have a place of rest or abode within it.",
        "But You—holy are Your Names—hast sworn that You wilt fill it with the unbelievers,",
        "Both Jinn and men together,",
        "And that You wilt place those who stubbornly resist therein forever.",
        "And You— majestic is Your eulogy— said at the beginning and wernt gracious through kindness as a favour,",
        "(What? Is he who has been believer like unto him who has been ungodly? They are not equal)",
        "My God and my Master! So I ask You by the power You hast apportioned",
        "And by the decision which You hast determined and imposed and through which You hast overcome him toward whom it has been put into effect,",
        "That You forgivest me in this night and at this hour",
        "Every offence I have committed,",
        "And every sin I have performed,",
        "And every ugly thing I have concealed",
        "And every folly I have enacted",
        "Whether I have hidden or announced it,",
        "Or I have concealed it or manifested it",
        "And every evil act which You hast commanded the Noble Writers to record,",
        "Those whom You hast appointed to watch over what appears from me",
        "And whom You hast made, along with my bodily members, witness against me.",
        "And You wast Yourself the Watcher over me from behind them,",
        "And the Witness of what is hidden from them",
        "But through Your mercy You concealed it",
        "And through Your bounty You veiled it.",
        "[And I ask You] that You bestowest upon me an abundant share of every good You sendest down,",
        "Or kindness You conferrest,",
        "Or goodness You unfoldest,",
        "Or provision You spreadest out,",
        "Or sin You forgivest,",
        "Or error You coverest.",
        "My Lord! My Lord! My Lord!",
        "My God! My Master! My Protector! Owner of my bondage!",
        "O He in whose hand is my forelock!",
        "O He who knows my affliction and my misery!",
        "O He who is aware of my poverty and indigence!",
        "My Lord! My Lord! My Lord!",
        "I ask You by Your Truth and Your Holiness",
        "And the greatest of Your Attributes and Names,",
        "That You makest my times in the night and the day inhabited by Your remembrance,",
        "And joined to Your service",
        "And my works acceptable to You,",
        "So that my works and my litanies may all be a single litany",
        "And my occupation with Your service everlasting.",
        "My Master! O He upon whom I depend!",
        "O He to whom I complain about my states!",
        "My Lord! My Lord! My Lord!",
        "Strengthen my bodily members in Your service,",
        "And fortify my ribs in determination",
        "And bestow upon me earnestness in my fear of You",
        "And continuity in my being joined to Your service",
        "So that I may move easily toward You in the battlefields of the foremost",
        "And hurry to You among the prominent",
        "And desire fervently Your proximity among the fervently desirous",
        "And move nearer to You with the nearness of the sincere",
        "And fear You with the fear of those who have certitude",
        "And gather with the believers in Your vicinity.",
        "O Allah, whoever desires evil for me, desire [it] for him!",
        "whoever deceives me-deceive him!",
        "And make me one of the most excellent of Your slaves in Portion from You,",
        "And the nearest of them in station to You",
        "And the most elected of them in proximity to You.",
        "For that cannot be attained except by Your bounty.",
        "And grant generously to me through Your munificence,",
        "And incline toward me with Your splendour",
        "And protect me with Your mercy!",
        "And make my tongue remember You without ceasing",
        "And my heart enthralled by Your love!",
        "And be gracious to me by answering me favourably,",
        "And nullify my slips",
        "And forgive my lapses!",
        "For You hast decreed Your worship for Your servants",
        "And commanded them to supplicate You",
        "And assured them that they would be answered.",
        "So toward You, my Lord, I have turned my face",
        "And toward You, my Lord, I have extended my hand.",
        "So by Your might, comply with my supplication",
        "And make me attain my desires!",
        "Do not severe my hoping for Your Favours",
        "And spare me the evil of my enemies from among the jinn and men!",
        "O He, whose pleasure is quickly achieved!",
        "Forgive him who owns nothing but supplication",
        "For You dost what You wilt.",
        "O He whose Name is a remedy,",
        "And whose remembrance is a cure,",
        "And whose obedience is wealth!",
        "Have mercy upon him whose capital is hope",
        "And whose weapon is tears!",
        "O Ample in blessings!",
        "O Repeller of adversities!",
        "O Light of those who are lonely in the darkness!",
        "O Knower who was never taught!",
        "Bless Muhammad and Muhammad's household!",
        "And do with me what is worthy of You!",
        "And Allah bless His messenger and the holy Imams of his household",
        "And give them abundant peace!"
    ]
}