{
    "id": "dua-alqama-(safwan)---after-ziyarat-ashura",
    "title": "Dua Alqama (Safwan) - after Ziyarat Ashura",
    "language": "en",
    "text": [
        "DESC: This dua is recited after Ziyarat al-Ashura",
        "O Allah! O Allah! O Allah!",
        "O He Who responds to the prayer of the distressed!",
        "O He Who relieves the agonies of the agonized!",
        "O Aide of the callers for aid!",
        "O Helper of those who cry for help!",
        "O He Who is nearer to me than my life-vein!",
        "O He Who intervenes between man and his heart!",
        "O He Who is in the Highest Position and in the Clear Horizon!",
        "O He Who is all-beneficent and all-merciful and is established on the Throne!",
        "O He Who knows the stealthy looks and that which the breasts conceal!",
        "O He from Whom no secret can remain hidden!",
        "O He Whom is not confused by the many voices (that pray Him)!",
        "O He Whom is not confounded by the many requests (that are raised to Him)!",
        "O He Who is not annoyed by the insistence of those who entreat Him persistently!",
        "O He Who overtakes every attempt of escape!",
        "O Reunifier of every scattering thing!",
        "O Re-originator of the souls after death!",
        "O He Who is in a state every moment!",
        "O Grantor of requests!",
        "O Reliever of agonies!",
        "O Conferrer of demands!",
        "O Bestower of desires!",
        "O Savior from sufferings!",
        "O He Who can save from all things",
        "and nothing in the heavens or in the earth can save from Him!",
        "I beseech You in the name of Muhammad the seal of the Prophets,",
        "`Ali the commander of the faithful,",
        "Fatimah the daughter of Your Prophet,",
        "al-Hasan, and al-Husayn,",
        "for I turn my face towards You in their names at this very situation of mine,",
        "I make them my means to You,",
        "I seek their intercession for me with You,",
        "I beseech You in the name of Your duty towards them, I adjure You, and I beg You earnestly,",
        "in the name of the status that they enjoy with You,",
        "the value that they enjoy in Your sight,",
        "in the name of the thing by which You have preferred them over all the other beings,",
        "in the name of Your Name that You have placed with them",
        "and given them exclusively other than all the other beings,",
        "and through which You have distinguished them",
        "and demonstrated their distinctive precedence over all the other beings so uniquely",
        "that their preference has exceeded all the distinctive features of all the other beings;",
        "I beseech You (in the name of all that) to send blessings upon Muhammad and the Household of Muhammad,",
        "to relieve me from my distress,",
        "grief, and agony,",
        "to make up for me all my distressing affairs,",
        "to help me settle my debts,",
        "to safeguard me against poverty,",
        "to safeguard me against scarcity,",
        "to make me dispense with begging from the created beings,",
        "to spare me from the distress of what I anticipate to distress me,",
        "the difficulty of what I anticipate to be difficult for me,",
        "the toughness of what I anticipate to be hard for me (to deal with),",
        "the evil of what I anticipate to be evil,",
        "the conspiracy of whom I anticipate to plot conspiracy (against me),",
        "the tyranny of whom I anticipate to treat me tyrannically,",
        "the injustice of whom I anticipate to be unjust to me",
        "the domination of whom I anticipate to dominate me,",
        "the trickery of whom I anticipate to trick me,",
        "and the authority of whom I anticipate to seize me,",
        "and to ward off from me the trickeries of the deceivers",
        "and the cunning of the devious.",
        "O Allah, stand for me against him who intends evil for me,",
        "intrigue against him who intends to conspire against me,",
        "turn away from me his trickeries, cunning,",
        "influence, and evil desires,",
        "and prevent him against me in any way You choose and at any time You choose.",
        "O Allah, (please) preoccupy him against me",
        "by means of poverty that You never cut down,",
        "ordeals that You never recover,",
        "neediness that You never stop,",
        "ailment that You never heal,",
        "humility that You never change into dignity,",
        "and destitution that You never cut down.",
        "O Allah, (please) strike him with humility in the center of his eyes,",
        "interleave poverty to his own house,",
        "place ailment and disease in his body",
        "so that You will preoccupy him with an engrossing, relentless preoccupation,",
        "make him fail to remember me in the same was as he has failed to remember You,",
        "divert from me his hearing, sight,",
        "tongue, hand,",
        "leg, heart,",
        "and all of his organs,",
        "place in him sickness in all these (organs),",
        "and do not heal him so that all these (sicknesses) will preoccupy him relentlessly",
        "from me and from mentioning me.",
        "And spare me, O Savior, from all that which cannot be spared by anyone other than You,",
        "for You are verily the Savior; and there is no savior other than You,",
        "You are verily the Reliever, and there is no reliever other than You,",
        "You are verily the Succorer, and there is no succorer other than You,",
        "and You are verily the Shelterer, and there is no shelterer other than You.",
        "Disappointed is he whose shelterer is other than You,",
        "whose recourse to anywhere other than You,",
        "whose resort is anywhere other than You,",
        "whose way out is anywhere other than You,",
        "whose haven is anywhere other than You,",
        "and whose savior from any created being is anyone other than You.",
        "You are verily my trust, my hope,",
        "my resort, my way out,",
        "my haven, and my savior.",
        "With You do I commence",
        "and through You do I seek success.",
        "In the name of Muhammad and the Household of Muhammad",
        "do I turn my face towards You, seek means to You, and seek intercession to You.",
        "So, I beseech You, O Allah! O Allah! O Allah!",
        "Yours is all praise and Yours is all thanks.",
        "To You is my complaint and You are the Besought for help.",
        "So, I beseech You, O Allah! O Allah! O Allah!",
        "In the name of Muhammad and the Household of Muhammad",
        "to send blessings upon Muhammad and the Household of Muhammad",
        "and to relieve my distress, grief, and agony",
        "in this situation of mine",
        "in the same way as You have relieved the distress, grief, and agony of Your Prophet",
        "and saved him from the horrors of his enemy.",
        "So, (please) relieve me in the same way as You did to him,",
        "dispel my worries in the same way as You did to him,",
        "save me in the same way as You did to him,",
        "drive away from me the horror of what I anticipate to horrify me,",
        "the encumbrance of what I anticipate to overburden me,",
        "and the distress of what I anticipate to distress me",
        "without making me suffer any encumbrance due to all that.",
        "And make me leave having all my requests granted",
        "and having all my distresses relieved,",
        "including the affairs of this world and the Hereafter.",
        "O Commander of the Faithful!",
        "O Abu-`Abdullah!",
        "Peace of Allah be upon you both from me forever",
        "as long as I am existent and as long as there are day and night.",
        "May Allah not decide this time of my visit to you both to be the last.",
        "May Allah never separate me from you both.",
        "O Allah, (please) make me live the same lifestyle that Muhammad and his offspring lived,",
        "make me die on the same faith on which they died,",
        "receive my soul while I am following their religion,",
        "include me with their group,",
        "and never separate me from them",
        "not for even a winking of any eye",
        "in this world and in the Hereafter.",
        "O Commander of the Faithful!",
        "O Abu-`Abdullah!",
        "I have come to you both to visit you,",
        "making both of you to be my means to Allah your and my Lord,",
        "turning my face to Him in your names,",
        "and seeking your intercession for me with Allah All-exalted to grant me this request of mine;",
        "so, intercede for me,",
        "since you both enjoy with Allah a praiseworthy position,",
        "an admissible status,",
        "a lofty standing, and a means (of nearness to Him).",
        "I will now leave you both,",
        "expecting my request to be granted,",
        "settled, and made successful by Allah",
        "on account of your intercession for me with Allah in that;",
        "so, do not let me down",
        "and do not make me leave with disappointment and loss;",
        "rather, make me leave with achievement,",
        "prosperity, success, and response (of my prayers)",
        "by having all my requests granted.",
        "And (please) intercede for me with Allah recurrently.",
        "I now leave on ‘whatever is willed by Allah shall come to pass’",
        "and ‘there is neither might nor power except with Allah’,",
        "relegating all my affairs to Allah,",
        "referring all my power to Allah,",
        "depending upon Allah,",
        "and repeating, ‘Allah is only sufficient to me,’",
        "and ‘May Allah respond to him who prays Him.’",
        "Other than Allah",
        "and other than you all, O my masters, I have nothing to put my hope in.",
        "Only that which my Lord wills shall come to pass,",
        "and whatever He does not will shall never be.",
        "There is neither might nor power except with Allah.",
        "I entrust you both with Allah.",
        "May Allah never decide this time of my visit to you both to be the last.",
        "May I now leave, O my master, O Commander of the faithful",
        "and you O Abu-`Abdullah, O my master.",
        "My greetings to you both are as continuous",
        "as night and day.",
        "May my greetings reach you both (all the time)",
        "and my salutation never be screened from reaching you both,",
        "Allah willing.",
        "I also beseech Him in your names to determine and do that,",
        "for He is verily the owner of praise and the owner of glory.",
        "I am now leaving you both, O my masters,",
        "repenting to and praising Allah,",
        "and thanking Him and hoping Him to respond to me;",
        "I neither despair nor lose hope,",
        "and I intend to come back, return, revisit you both,",
        "while I have never desired to leave you or to abandon visiting you;",
        "rather, I shall return and come back, if Allah wills.",
        "There is neither might nor power except with Allah.",
        "O my masters, I do desire for both of you and for visiting you",
        "although the people of this world (may) abandon you both or abandon visiting you.",
        "May Allah never make me fail to attain what I have hoped and desired in visiting you both.",
        "Verily, He is All-nigh, All-responding."
    ]
}