{
    "id": "dua-asharaat",
    "title": "Dua Asharaat",
    "language": "en",
    "text": [
        "INFO: Introduction",
        "DESC: Recited on Friday afternoons & Arafa Day",
        "DESC: The Supplication of the Tens; some paragraphs of the supplication are repeated ten times each.version from Shaykh al-Tusi’s Misbah al-Mutahajjid.",
        "DESC: It is advisable to say this supplication each morning and evening. Yet, its best time is Friday afternoon:",
        "INFO: Dua",
        "In the Name of Allah; the All-beneficent, the All-merciful.",
        "All Glory be to Allah,",
        "all praise be to Allah,",
        "there is no god save Allah,",
        "Allah is the Greatest,",
        "there is neither power nor might save with Allah, the Most High, the All-magnificent.",
        "Glory be to Allah in hours of the night and at the two ends of the day.",
        "Glory be to Allah in the morning and the evening hours.",
        "Glory be to Allah in the early hours of night and morning.",
        "Glory be to Allah when you enter the night and when you enter the morning.",
        "Unto Him be praise in the heavens, the earth,",
        "at the sun's decline, and in the noonday.",
        "He brings forth the living from the dead,",
        "brings forth the dead from the living,",
        "revives the earth after its death,",
        "and even so will you be brought forth.",
        "Glorified be Your Lord, the Lord of Majesty, from that which they attribute (to Him).",
        "Peace be upon the Messengers.",
        "All praise be to Allah, the Lord of the Worlds.",
        "Glory be to the Lord of Kingdom and Realm.",
        "Glory be to the Lord of Majesty and Magnificence.",
        "Glory be to the Lord of Greatness and Magnitude;",
        "the True Sovereign, the Guardian, and the Holy.",
        "Glory be to Allah, the Sovereign, the Ever-living Who never dies.",
        "Glory be to Allah, the Ever-living, the Holy.",
        "Glory be to the Self-Existent, the Eternal.",
        "Glory be to the Eternal, the Self-Existent.",
        "Glory be to my Lord, the Most Great.",
        "Glory be to my Lord, the Most High.",
        "Glory be to the Ever-living, the Self-Existent.",
        "Glory be to the Exalted, the Most High.",
        "Glory be to Him, and Exalted be Him.",
        "Glorified (is He), Holy (is He),",
        "Our Lord, and the Lord of the angels and the Spirit.",
        "Glory be to the Eternal Who never forgets.",
        "Glory be to the All-knowing Who does not need teaching.",
        "Glory be to the Creator of all seen and unseen beings.",
        "Glory be to Him Who comprehends all visions,",
        "but visions cannot comprehend Him,",
        "and He is the Knower of subtleties, the Aware.",
        "O Allah, I begin my day covered with grace and favor from You",
        "as well as blessing and good health.",
        "So, (please) bless Muhammad and his Household,",
        "make perfect Your grace and favor for me",
        "as well as Your blessings and good health,",
        "through redemption from Hellfire,",
        "grant me thanksgiving to You, enjoyment of wellbeing from You,",
        "Your grace, and Your honor permanently so long as You decide to keep me alive.",
        "O Allah, only by Your Light have I been guided,",
        "only by Your grace have I been opulent,",
        "and only by Your grace have I lived in eves and morns.",
        "O Allah, I ask You to witness for me, and You are surely sufficient as a witness,",
        "and I also choose as witnesses Your angels, Prophets, Messengers,",
        "the bearers of Your Throne, the inhabitants of Your heavens and earth,",
        "and all Your creatures,",
        "that You are Allah, there is no god save You,",
        "One and Only Lord, having no partner,",
        "and that Muhammad, peace be upon him and his Household, is Your servant and Messenger,",
        "and that You have power over all things;",
        "You grant life and cause to die and You cause to die and grant life;",
        "and I witness that Paradise is true,",
        "Hellfire is true,",
        "Resurrection is true,",
        "the Hour is coming, there is no doubt about it,",
        "and Allah shall raise up those who are in graves.",
        "I also witness that `Ali the son of Abu-Talib is truly the commander of the faithful, indeed,",
        "the Imams from his offspring are the guides, leaders, and well-guided,",
        "neither straying off nor misleading,",
        "and they are Your chosen representatives,",
        "Your triumphant party,",
        "Your choice, the most favorable of all Your creatures,",
        "the superior ones whom You have selected for Your religion,",
        "decided on from among Your beings,",
        "chosen from among Your servants,",
        "and made Claims against all beings.",
        "May Your consent, peace, mercy, and blessings be upon them.",
        "O Allah, (please do) certify this witness for me with You",
        "so that You shall give it back to me on the Resurrection Day while You are pleased with me.",
        "Verily, You have power over all that which You will.",
        "O Allah, to You be praise the first of which ascends while its end is infinite.",
        "O Allah, to You be praise due to which the heavens humbles itself to You",
        "and the earth as well as all those on it glorify You.",
        "O Allah, to You be praise—eternal, endless,",
        "having neither cessation nor exhaustion,",
        "fitting You, and being dedicated to You,",
        "about me, on (Your favors to) me, with me,",
        "along with me, before me, after me,",
        "in front of me, over me, beneath me,",
        "when I die, remain totally alone, and will be then terminated.",
        "To You be all praise when I shall be resurrected and raised up (from grave).",
        "O my Lord, O Allah, to You be all praise",
        "and all thanks in all forms of praising You",
        "for all Your favors",
        "until (this) praise achieves the pleasure and satisfaction of You, O our Lord.",
        "O Allah, to You be all praise for each and every food, drink,",
        "power, grip,",
        "extension, and for each place of a single hair.",
        "O Allah, to You be all praise that is as eternal as You are.",
        "To You be all praise that never ends save Your knowledge (about it).",
        "To You be all praise that has no limit save when You will.",
        "To You be all praise the one and only reward of its sayer is nothing save Your pleasure.",
        "To You be all praise for You act forbearingly though You know.",
        "To You be all praise for You pardon though You have power (not to do).",
        "To You be all praise and You are the source of praise.",
        "To You be all praise and You are the inheritor of praise.",
        "To You be all praise and You are the fashioner of praise.",
        "To You be all praise and You are the utmost of praise.",
        "To You be all praise and You are the author of praise.",
        "To You be all praise and You are the object of praise.",
        "To You be all praise and You are the lord of praise.",
        "To You be all praise and You are the ultimate objective of praise.",
        "To You be all praise and You are truthful in promise, fulfiller of pledge,",
        "mighty in power, and subsistingly glorious.",
        "To You be all praise and You are the highest in ranks, the responsive to prayers,",
        "the descender of sings (or Verses) from above seven skies,",
        "the grantor of outstanding blessings,",
        "the bringer forth of light from utter darkness,",
        "the bringer forth of those who are in darkness to light,",
        "the changer of evil deeds into good deeds,",
        "and the maker of good deeds raise to high ranks.",
        "O Allah, to You be all praise and You are the Forgiver of the faults, the Acceptor of repentance,",
        "severe to punish, and Lord of bounty.",
        "There is no god save You; to You shall be the return.",
        "O Allah, to You be all praise in the night when it draws a veil.",
        "To You be all praise in the day when it shines in brightness.",
        "To You be all praise in the Hereafter and the former life.",
        "To You be all praise as many as the numbers of all stars and angels in the heavens.",
        "To You be all praise as much as dust and as many as pebbles and seeds.",
        "To You be all praise as many as all that which is in the air.",
        "To You be all praise as many as all that which is in the interior of the earth.",
        "To You be all praise as much as the weight of sea water.",
        "To You be all praise as many as leaves of trees.",
        "To You be all praise as many as all that which exists on the earth surface.",
        "To You be all praise as much as that which has been counted by Your Book.",
        "To You be all praise as much as all that which is comprehended by Your Knowledge.",
        "To You be all praise as many as the numbers of men, jinn,",
        "pests, birds, animals, and beasts—",
        "praise that is abundant, pleasant,",
        "and as blessed as You, our Lord, please and gratify",
        "so much so that it befits the majesty of Your Face and the dignity of Your splendor.",
        "INFO: Repeat 10 times each:",
        "There is no god save Allah; One and Only and having no partner. To Him is the Kingdom and to Him is (all) praise. He is the Knower of subtleties, the Aware.",
        "There is no god save Allah; One and Only and having no partner. To Him is the Kingdom and to Him is (all) praise. He gives life and causes to die and causes to die and gives life, while He is ever-living and never dies. In His Hand is the entire goodness and He has power over all things.",
        "I pray the forgiveness of Allah; there is no god save Him, the Ever-living, the Self-subsistent, and I repent to Him.",
        "O Allah, O Allah!",
        "O All-beneficent, O All-beneficent!",
        "O All-merciful, O All-merciful!",
        "O Fashioner of the heavens and the earth!",
        "O Lord of Majesty and Dignity!",
        "O All-compassionate! O Grantor (of graces)!",
        "O Ever-living! O Self-Subsistent!",
        "O Ever-living! There is no god save You!",
        "O Allah! O He save Whom there is no god!",
        "In the Name of Allah, the All-beneficent, the All-merciful.",
        "O Allah, bless Muhammad and the Household of Muhammad.",
        "O Allah, do to me that which You are worthy to do.",
        "(please do) Respond, respond.",
        "Say: He, Allah, is One.",
        "INFO: You should then say the following:",
        "O Allah, do with me that which You are worthy to do",
        "but do not do to me that which I deserve,",
        "for You are worthy to be feared and worthy to forgive,",
        "while I am the one of sins and faults.",
        "So, have mercy upon me, O my Lord,",
        "and You are the most merciful of all those who show mercy.",
        "INFO: Then repeat 10 times:",
        "There is neither power nor might save with Allah.",
        "I trust in the Ever-living (Lord) Who never dies.",
        "All praise be to Allah, Who begets no son,",
        "and has no partner in His dominion",
        "nor needs He any to protect Him from humiliation:",
        "yea, magnify Him for His greatness and glory!"
    ]
}