{
    "id": "eid-al-ghadeer",
    "title": "Eid al-Ghadeer",
    "language": "en",
    "text": [
        "O Allah, I beseech You in the name of Muhammad, Your Prophet,",
        "in the name of `Ali, Your Representative (wali),",
        "and in the name of the stature and standing that You have given exclusively to them rather than Your other creatures,",
        "to send blessings to Muhammad and `Ali",
        "and begin with both of them in any immediate item of goodness.",
        "O Allah, (please do) send blessings to Muhammad and the Household of Muhammad;",
        "the Imams, the leaders,",
        "the promulgators (to You), the masters,",
        "the shining stars,",
        "the splendid signs,",
        "the governors of the servants (of You),",
        "the pillars of the countries,",
        "the (like of the) she-camel that was sent by You,",
        "and the ark that saves (from sinking in straying off from the right path)",
        "and runs peacefully in the depths of oceans.",
        "O Allah, (please do) send blessings to Muhammad and the Household of Muhammad;",
        "the keepers of Your knowledge,",
        "the pillars of the professing of Your Oneness,",
        "the supports of Your religion,",
        "the cores of Your honoring,",
        "the choicest among Your creatures,",
        "the best of Your beings,",
        "the pious, the pure,",
        "the outstanding, the virtuous,",
        "and the door that is decided as trial for people—",
        "he who comes through it shall be saved",
        "but he who rejects it shall fail indeed.",
        "O Allah, (please do) send blessings to Muhammad and the Household of Muhammad;",
        "the People of the Reminder whom You have ordered us to ask (when we do not know),",
        "the near relatives (of the Holy Prophet) whom You have ordered us to love,",
        "whose rights You have made incumbent (upon us),",
        "and whom You have decided Paradise as the reward of whoever follows their patterns.",
        "O Allah, (please do) send blessings to Muhammad and the Household of Muhammad",
        "as they instructed (us) to obey You,",
        "warned (us) against disobeying You,",
        "and led Your servants to Your Oneness.",
        "O Allah, I beseech You in the name of Muhammad;",
        "Your Prophet, Your superior servant,",
        "Your choice, Your trusted one,",
        "Your messenger to Your creatures;",
        "and (I beseech You) in the name of the Commander of the Believers (Amir al-Mu'minin),",
        "the chief of the religion,",
        "the leader of the white-faced and marked on the foreheads,",
        "the faithful, the loyal,",
        "the greatest veracious,",
        "the distinguisher between the right and the wrong,",
        "the witness for You,",
        "the guide to You,",
        "the expounder of what You have commanded,",
        "the striver in Your way,",
        "and who never listened to any word of blame for Your sake;",
        "(I beseech You) to send blessings to Muhammad and the Household of Muhammad,",
        "to include me on this day",
        "on which You established the pledge to Your Representative in the necks of Your servants",
        "and You thus perfected the religion for them,",
        "(to include me) with those who recognize the actual sanctity of him",
        "and those who acknowledge his precedence,",
        "and to include me with those whom You decide to release from Hellfire.",
        "(Please) do not let those who envy the bounties (that You confer upon certain persons) rejoice at my misfortunes.",
        "O Allah, as You have made this day Your greatest feast day,",
        "You have named it “the Day of the Promised Covenant” in the heavens,",
        "and You have named it “the Day of the Exacted Covenant and the Witnessed Crowd” in the earth,",
        "(please do) send blessings to Muhammad and the Household of Muhammad,",
        "give us delight of our eyes through him,",
        "reunify us through him,",
        "do not mislead us after You have guided us to the right path,",
        "and make us of those who thank Your bounties.",
        "O most Merciful of all those who show mercy!",
        "All praise be to Allah Who has made us recognize the merit of this day,",
        "attracted our attentions to its sanctity,",
        "honored us on it,",
        "ennobled us through our recognition of it,",
        "and guided us through its light.",
        "O Messenger of Allah!",
        "O Commander of the Believers!",
        "Upon you, your household,",
        "and your followers be the most excellent peace",
        "so long as night and day endure.",
        "Through you both do I direct toward Allah, my Lord and Your Lord,",
        "(and I beseech Him) to respond to my requests,",
        "settle my needs,",
        "and make easy all my affairs.",
        "O Allah, I beseech You in the name of Muhammad and the Household of Muhammad",
        "to bless Muhammad and the Household of Muhammad",
        "and curse whoever denies the holiness of this day",
        "and denies its sanctity;",
        "thus, he hindered from Your way intending to extinguish Your light,",
        "but Allah will not consent save to perfect His light.",
        "O Allah, (please do) relieve misfortunes from the Household of Muhammad, Your Prophet",
        "and relieve the anguishes of them and of the believers through them.",
        "O Allah, (please do) fill the earth with justice through them",
        "just as it has been full with injustice and unfairness,",
        "and (please do) fulfill Your promise to them,",
        "for You surely do not break Your promises."
    ]
}