{
    "id": "eid-al-mubahila",
    "title": "Eid al-Mubahila",
    "language": "en",
    "text": [
        "O Allah, I ask You to give me from Your brilliance that beautifies,",
        "and all Your glories are radiantly brilliant.",
        "O Allah, I beseech You in the name of all Your glories.",
        "O Allah, I ask You to give me from Your majesty that gives grandeur,",
        "and all Your majestic powers are strongly sublime.",
        "O Allah, I beseech You in the name of all Your powers.",
        "O Allah, I ask You to give me from Your refined good that makes more handsome,",
        "and all Your refinements are gracefully beautiful.",
        "O Allah, I beseech You in the name of all Your beauties.",
        "O Allah, I am praying You as You have ordered me to do;",
        "so, please respond to me as You have promised.",
        "O Allah, I ask You to give me from Your greatness that makes great,",
        "and all Your powers are extensively important.",
        "O Allah, I beseech You in the name of all Your influences.",
        "O Allah, I beseech You to give me from Your light that enlightens,",
        "and all Your enlightenments are luminously bright.",
        "O Allah, I beseech You in the name of all Your lights.",
        "O Allah, I ask You to give me from Your mercy that gives much,",
        "and all Your kind leniencies are plenteously many.",
        "O Allah, I beseech You in the name of all Your compassions.",
        "O Allah, I am praying You as You have ordered me to do;",
        "so, please respond to me as You have promised.",
        "O Allah, I ask You to give me from Your perfection that brings to fullness,",
        "and all Your perfections are total and whole.",
        "O Allah, I beseech You in the name of all Your perfections.",
        "O Allah, I ask You to give me from Your Words that elaborate and conclude;",
        "and all Your words are complete and perfect.",
        "O Allah, I beseech You in the name of all Your Words.",
        "O Allah, I ask You to give me from Your Names that make great,",
        "and all Your Names are important.",
        "O Allah, I beseech You in the name of all Your Names.",
        "O Allah, I am praying You as You have ordered me to do;",
        "so, please respond to me as You have promised.",
        "O Allah, I beseech You to give me from Your authority that surpasses in honor and power,",
        "and all Your authorities are rare and supreme.",
        "O Allah, I beseech You in the name of all Your authorities.",
        "O Allah, I ask You to give me from Your Will that (simultaneously) takes effect,",
        "and all Your wills are (at once) executed.",
        "O Allah, I beseech You in the name of all Your wills.",
        "O Allah, I ask You to give me from Your that omnipotence which controls everything,",
        "and at all events Your omnipotence dominates.",
        "O Allah, I beseech You in the name of Your all-embracing omnipotence.",
        "O Allah, I am praying You as You have ordered me to do;",
        "so, please respond to me as You have promised.",
        "O Allah, I ask You to give me from Your Wisdom that pierces through and enforces,",
        "and Your Wisdom is altogether effective.",
        "O Allah, I beseech You in the name of Your Wisdom.",
        "O Allah, I ask You to give me from Your promise which always is fulfilled,",
        "and all Your promises are kept and fulfilled.",
        "O Allah, I beseech You in the name of all Your promises.",
        "O Allah, I ask You to give me from Your Channels which are most dear to You,",
        "and all that which is dear to You is most desirable.",
        "O Allah, I beseech You in the name of all Your Channels.",
        "O Allah, I am praying You as You have ordered me to do;",
        "so, please respond to me as You have promised.",
        "O Allah, I ask You to give me from Your distinctions that vie in glory,",
        "and all Your distinctions are noble.",
        "O Allah, I beseech You in the name of all Your distinctions.",
        "O Allah, I ask You to give me from Your sovereignty which lasts and continues forever,",
        "and for all times Your sovereignty is everlasting.",
        "O Allah, I beseech You in the name of Your absolute sovereignty.",
        "O Allah, I ask You to give me from Your kingdom that surpasses in glory and nobility,",
        "and in reality Your kingdom alone is the most celebrated and magnificent.",
        "O Allah, I beseech You in the name of Your unlimited kingdom.",
        "O Allah, I am praying You as You have ordered me to do;",
        "so, please respond to me as You have promised.",
        "O Allah, I ask You to give me from Your highness that is supreme",
        "and all Your highness is supreme.",
        "O Allah, I beseech You in the name of all of Your highness.",
        "O Allah, I ask You to give me from Your signs which are astonishing,",
        "and all Your signs are astonishing.",
        "O Allah, I beseech You in the name of all Your signs.",
        "O Allah, I ask You to give me from Your bounties which always move ahead, come in advance,",
        "and all Your bounties are eternal.",
        "O Allah, I beseech You in the name of all Your bounties.",
        "O Allah, I am praying You as You have ordered me to do;",
        "so, please respond to me as You have promised.",
        "O Allah, I ask You to give me whereby You exercises absolute authorities and power,",
        "I beseech You in the name of (Your) total omnipotence, and total authority.",
        "O Allah, I ask You to give me whereby You gives answer to my supplication whenever I turn to You.",
        "O Allah save Whom there is no god!",
        "I beseech You in the name of the brilliance of ‘there is no god save You’.",
        "O He save Whom there is no god,",
        "I beseech You in the name of the majesty of ‘there is no god save You’.",
        "O He save Whom there is no god,",
        "I beseech You in the name of ‘there is no god save You’.",
        "O Allah, I am praying You as You have ordered me to do;",
        "so, please respond to me as You have promised.",
        "O Allah, I beseech You to grant me from the most widespread of Your sustenance;",
        "and all Your sustenance is widespread.",
        "O Allah, I beseech You in the name of Your whole sustenance.",
        "O Allah, I beseech You to grant me from the most wholesome of Your bestowal;",
        "and Your entire bestowal is wholesome.",
        "O Allah, I beseech You in the name of Your entire bestowal.",
        "O Allah, I beseech You to grant me from Your most instant welfare;",
        "and Your entire welfare is instant.",
        "O Allah, I beseech You in the name of Your entire welfare.",
        "O Allah, I beseech You to grant me from the best of Your favors;",
        "and all Your favors are excellent.",
        "O Allah, I beseech You in the name of Your whole favor.",
        "O Allah, I am praying You as You have ordered me to do;",
        "so, please respond to me as You have promised.",
        "O Allah, send blessings to Muhammad and the Household of Muhammad",
        "and resurrect me carrying belief in You,",
        "giving credence to Your Messenger, peace be upon him and his Household,",
        "being loyal to `Ali ibn Abi-Talib,",
        "disclaiming his enemies,",
        "and accepting the leadership of the Imams from Muhammad’s Household,",
        "peace be upon them,",
        "for I am pleased with that, O my Lord.",
        "O Allah, send blessings to Muhammad,",
        "Your servant and Messenger, among the ancient ones,",
        "send blessings to Muhammad among the later ones,",
        "send blessings to Muhammad in the Highest Chiefs,",
        "and send blessings to Muhammad among the Missioned Prophets.",
        "O Allah, grant Muhammad [the right of] mediation,",
        "honor, precedence,",
        "and great rank.",
        "O Allah, send blessings to Muhammad and the Household of Muhammad,",
        "make me satisfied with the sustenance You have given me,",
        "bless me in what You have granted me,",
        "safeguard me during my absence [from home],",
        "and safeguard every absent one that is related to me.",
        "O Allah, send blessings to Muhammad and the Household of Muhammad,",
        "resurrect me carrying belief in You",
        "and giving credence to Your Messenger.",
        "O Allah, send blessings to Muhammad and the Household of Muhammad,",
        "and I beseech You for the best of goodness: Your pleasure and Paradise,",
        "and I pray for Your protecting me against the worst of evil: Your wrath and Hellfire.",
        "O Allah, send blessings to Muhammad and the Household of Muhammad",
        "and protect me against every misfortune,",
        "every tribulation,",
        "every punishment,",
        "every trial,",
        "every ordeal,",
        "every evil,",
        "every mishap,",
        "every misfortune,",
        "and every bane that has been caused to descend",
        "or will be caused to descend from the heavens to the earth,",
        "at this hour,",
        "at this night,",
        "on this day,",
        "in this month,",
        "and in this year.",
        "O Allah, send blessings to Muhammad and the Household of Muhammad",
        "and grant me part of every pleasure,",
        "every delight,",
        "every uprightness,",
        "every relief,",
        "every wellbeing,",
        "every safety,",
        "every honoring,",
        "every sustenance that is expansive,",
        "legally-gotten, and wholesome,",
        "every grace,",
        "and every affluence that has been caused to descend",
        "or will be caused to descend from the heavens to the earth,",
        "at this hour,",
        "at this night,",
        "on this day,",
        "in this month,",
        "and in this year.",
        "O Allah, if my sins",
        "have worn out my face in Your sight,",
        "intervened between You and me,",
        "and changed my state with You,",
        "so, I beseech You in the name of the Light of Your Face that is never extinguished,",
        "in the name of the face of Muhammad, Your chosen and most beloved of You,",
        "in the name of the face of `Ali, Your most pleased intimate servant,",
        "and in the name of Your saints whom You have selected [for Yourself]",
        "to send blessings to Muhammad and the Household of Muhammad",
        "and forgive me all of my past sins,",
        "and protect me [against sinning] in the rest of my life.",
        "I seek Your protection, O Allah,",
        "against that I may commit again any act of disobedience to You",
        "as long as You keep me alive so that You will take me up",
        "while I am obedient to You and You are pleased with me.",
        "I beseech You to seal my life with the most excellent of my deeds,",
        "decide Paradise to be my reward for that,",
        "and do to me that which befits You,",
        "O He Who is worthy to be feared and worthy to forgive!",
        "Send blessings to Muhammad and the Household of Muhammad",
        "and have mercy on me, in the name of Your mercy, O most Merciful of all those who show mercy."
    ]
}