{
    "id": "eid-al-ghadeer---eve",
    "title": "Eid al-Ghadeer - Eve",
    "language": "en",
    "text": [
        "DESC: Sayyed ibn Tawus reports the following supplication in Iqbal Amaal for the Night of Ghadir",
        "O” my God! You invited us to the path of obeying You, Your Prophet, his Trustee and his household",
        "– an invitation filled with light, illumination, joy and brightness.",
        "Then Your Prophet of Mercy invited us to follow his Trustee (Imam Ali) on the Day of Ghadir Khum",
        "and You granted us success in choosing the correct path and helped us accept his invitation.",
        "Thus we turned back to You and submitted our hearts to Your Prophet,",
        "and our souls to his Trustee and our intellects to what You invited us to.",
        "O’ Guider of the deviated! Please perfect Your Light for us.",
        "Please take away from our hearts, souls and tongues and thoughts any hatred, denial or flattery for Your Trusted One – the Commander of the Faithful Ali, and the father of the rest of the Divine Leaders",
        "Please increase our friendship, love, and affection for him and the Divine Leaders after him such that there is no cessation or end for it.",
        "Please let us be enemies of his enemies and friends with his friends with our sole intention of this being Your Obedience.",
        "O’ the Most Compassionate, Most Merciful",
        "O’ my God! Please place Your Punishment and Wrath on whoever is the enemy of Your Friend, denies his Divine Leadership",
        "rejects his Mastery whom You have reserved for the periods of sedition in all periods, times and eras",
        "as indeed You have Power over all things.",
        "O’ my God! I ask You for the sake of Your Prophet Muhammad and Your Friend Ali and Your Proofs – the Divine Leaders after him",
        "to establish my heart firmly on Your Religion and the love of Your Friends, and hatred of Your enemies",
        "along with the good of this world and the Hereafter",
        "for me, my wife, children and Muslim brethren",
        "as indeed You have Power over all things."
    ]
}