{
    "id": "eid-al-ghadeer---from-iqbal-amaal",
    "title": "Eid al-Ghadeer - from Iqbal Amaal",
    "language": "en",
    "text": [
        "INFO: After Ghusl and wearing clothes",
        "O' my God! This is the day on which You honored us with the Mastery of Your Friend, Ali (God’s blessing be upon him)",
        "made him the Commander of the Faithful",
        "ordered us to accept his Mastery and his orders",
        "and grab onto what brings us closer to You",
        "and accept his orders and admonitions that bring us close to You",
        "O my God! We accept Your Orders and Your Admonitions",
        "We hear and obey Your Prophet",
        "we submit and are satisfied",
        "We are the friends of Ali (God’s blessing be upon him) we make friends with his friends as You ordered",
        "and are the enemy of his enemies",
        "We disown whomever he disowns",
        "despise whoever he despises",
        "and like whomever he likes as You said",
        "We follow him after the Prophet (blessings of God be upon him and his family) as You ordered.",
        "INFO: For Almighty Allah’s protection against Satan",
        "DESC: From the Holy Prophet (saww) as cited by Sayyed ibn Tawus in Iqbal",
        "In the Name of God, Most Compassionate, Most Merciful",
        "In the Name of God – the best of the Names. In the Name of the Lord of the Hereafter and this world, Lord of the earth and the heavens.",
        "The Name with which the plots of the enemies will not be effective, with which all evil is fended off, and with which anyone who asks will be taken care of.",
        "O' my God! You are the Lord and Creator of all things. You are the Initiator and Provider for all creators",
        "You count all things and know about them. You destroy all the rebellious oppressors",
        "You help all who rely on You and help them. You are kind and merciful to all creatures",
        "There is none to oppose You. There is none to insist before You. There is none comparable to You",
        "You are Exalted and Great beyond all this",
        "O' my God! I seek protection in You and direct my attention to You. I depend upon You.",
        "O the best Protector, the Kindest Merciful, the Wisest Ruler and Most Knowlegeable Scholar!",
        "You protect whoever seeks Your Protection. You are merciful to whoever seeks Your Mercy",
        "You suffice whoever seeks sufficiency. You secure and guide whoever relies upon You",
        "O Lord! I hear and obey Your Orders",
        "O my God! I speak with Your Success, I trust in Your Sufficiency",
        "I bestow by Your Power, I seek sufficiency from You.",
        "O my God! Please suffice for me, save me, protect me, give me well-being, defend me, and take care of me",
        "My Lord! You are my Nourisher! In You I have placed my trust, and to You do I turn in repentance, and to You is (our) Final Goal",
        "And You have Power over all things.",
        "INFO: At noon",
        "DESC: Sit down with tranquility and say the following words",
        "Praise be to God! the Cherisher and Sustainer of the worlds",
        "He favored us in His Religion with victory over those who deny, and His enemies",
        "and gave us great blessings compared to many of those who are deviated",
        "He guided us by His Prophet Muhammad (blessings of God be upon him and his family)",
        "honored us by his Trustee and Caliph during his life and after his death – the Commander of the Faithful (God’s blessing be upon him)",
        "O' my God! Muhammad (blessings of God be upon him and his family) is our Prophet as You decreed.",
        "and Ali (God’s blessing be upon him) is our Master as You decided",
        "We are his followers and friends."
    ]
}