{
    "id": "h.-abal-fadhl-al-abbas-(as)---after-ziyarah-at-the-shrine",
    "title": "H. Abal-Fadhl al-Abbas (as) - after Ziyarah at the shrine",
    "language": "en",
    "text": [
        "DESC: Sayyid Ibn Tawus and Shaykh al-Mufid, as well as other scholars, says:",
        "INFO: You may turn to the side of the head and offer a 2 rakah prayer. Then you may say the following dua",
        "O Allah, (please) send blessings upon Muhammad and the Household of Muhammad",
        "and do not leave for me, in this honored place and glorified shrine, any sin that I did but that You forgive it,",
        "any care but that You relieve it,",
        "any illness but that You cure it,",
        "any defect buth that You cover up,",
        "any source of sustenance but that You expand it,",
        "any item of terror but that You pacify it,",
        "any disunity but that You reunify it,",
        "any absent one but that You guard it and approach (him to me),",
        "and any single need, among the many needs for this life as well as the life to come",
        "whose settlement achieves your gratification and my good,",
        "but that You grant it. O He Who is the most merciful of all the merciful ones!",
        "INFO: You may then return to the tomb, stop at the side of the legs, and say the following words:",
        "Peace be upon you, O Abu’l-Fadl al-`Abbas the son of the Commander of the Faithful.",
        "Peace be upon you, O son of the chief of the successors (of the Prophets).",
        "Peace be upon you, O son of the foremost to Islam,",
        "the first to believe,",
        "the best to have served the religion of Allah,",
        "and the most careful for Islam.",
        "I bear witness that you served Allah, His Messenger, and your brother sincerely.",
        "You were the most excellent self-sacrificing brother.",
        "So, Allah’s curse be on the group who killed you.",
        "Allah’s curse be on the group who wronged you.",
        "Allah’s curse be on the group who violated your sanctities",
        "and infringed the sanctity of Islam.",
        "You were the most excellent steadfast fighter,",
        "protector, supporter,",
        "and brother who defended his brother,",
        "responded to the obedience to his Lord,",
        "and worked desirably for gaining the abundant reward, which others refused,",
        "and the nice tribute.",
        "So, Allah may attach you to the rank of your fathers in the gardens of bliss.",
        "O Allah, I have done the pilgrimage to Your disciples out of my desire for (winning) your reward",
        "and my wish for Your forgiveness and Your abundant benevolence.",
        "So, I implore You to send Your blessings upon Muhammad and his immaculate Household",
        "and to make my sustenance flow copiously in their names,",
        "my living delightful in their names,",
        "my pilgrimage rewardable in their names,",
        "and my life pleasant in their names,",
        "to make me take to the conduct of the honored ones,",
        "to make me one of those who, as returning from the pilgrimage to the tombs of Your beloved ones,",
        "win success and prosperity",
        "and deserve forgiveness of sins,",
        "covering up of defects,",
        "and relief of disasters.",
        "You are surely worthy of being feared and worthy of forgiving.",
        "INFO: If you intend to take leave, you may approach the holy tomb and say the following words",
        "DESC: Abu-Hamzah al-Thumali and other scholars have mentioned this",
        "I entrust you with Allah, beseech Him to keep you under His guard,",
        "and invoke peace upon you.",
        "We have believed in Allah, in His Messenger, in His Book,",
        "and in that which he conveyed from Allah.",
        "O Allah, record our names with the witnesses.",
        "O Allah, do not decide this pilgrimage to the tomb of the son of Your Messenger’s brother to be the last one of mine.",
        "Peace be upon him (i.e. the Messenger) and upon his Household.",
        "Grant me opportunities to visit him so long as You keep me alive,",
        "join me to him and to his fathers in the gardens of Paradise,",
        "and introduce me to him, to Your Messenger, and to Your disciples.",
        "O Allah, send Your blessings to Muhammad and the Household of Muhammad",
        "and take me to You while I am abiding by the believing in You,",
        "giving credence to Your Messenger,",
        "being faithful to `Ali the son of Abu-Talib and the Imams from his progeny,",
        "and disavowing their enemy.",
        "My Lord, I have accepted such.",
        "Allah may send blessings upon Muhammad and the Household of Muhammad."
    ]
}