{
    "id": "imam-husayn-(as)---birthday,-3rd-shaban",
    "title": "Imam Husayn (as) - Birthday, 3rd Shaban",
    "language": "en",
    "text": [
        "O Allah, I beseech You in the name of the one born on this day,",
        "the promised with martyrdom before the beginning of his lifetime and before his birth,",
        "the heavens and all their inhabitants wept for him;",
        "and so did the earth and those living one it",
        "before his feet stepped on it,",
        "the mourned slain one,",
        "the master of the Family (of Prophethood),",
        "the one who shall be backed with victory on the Day of Return,",
        "the one whom has been awarded the favor of the Imams’ being from his offspring as recompense of his being slain,",
        "the one awarded the favor of the soil of his grave carrying cure,",
        "the one awarded the favor that he will be triumphing when he will be returned",
        "and the Prophet’s Successors from his offspring will be returned",
        "after the advent of their Rising Imam and after his occultation",
        "so that they shall take revenge,",
        "retaliate,",
        "please the Omnipotent Lord,",
        "and be the best supporters.",
        "May Allah’s blessings be perpetually upon them whenever night and day succeed each other.",
        "O Allah, I thus beg You in the name of them",
        "and implore You with the imploration of a sinful one who confesses of his sin,",
        "and who has done evil to himself",
        "due to his violations—the past and the present.",
        "He thus beseeches You for Your protection up to the place of his grave.",
        "O Allah, (please) send blessings to Muhammad and his Offspring,",
        "include us with his group (on the Resurrection Day),",
        "and allow us to dwell in the House of Honor with him",
        "and in the abode of residence.",
        "O Allah, as You have conferred upon us with the honor of our recognition of him, so (please) confer upon us with the honor of being near to him,",
        "bestow upon us with the bliss of accompanying him and enjoying a close rank to him,",
        "and include us with those who submit to him totally",
        "and those who invoke Your blessings upon him whenever they mention him,",
        "and upon all his Successors and Selected Ones,",
        "whom are defined by You as twelve persons,",
        "being the luminous stars,",
        "and the Arguments against all humankind.",
        "O Allah, and (please) grant us on this day the best of grants,",
        "make all our prayers on this day responded,",
        "just as You gifted al-Husayn to Muhammad, his grandfather,",
        "just as the angel Futrus sought refuge with his (i.e. al-Husayn) cradle,",
        "we are thus seeking refuge with his tomb after him (i.e. his martyrdom),",
        "as we are witnessing the soil of him and expecting his return.",
        "Respond to us, O Lord of the worlds."
    ]
}