{
    "id": "naad-e-ali",
    "title": "Naad e Ali",
    "language": "en",
    "text": [
        "INFO: Naad e Ali",
        "Call on Ali, (He) is able to bring about the extraordinary.",
        "You will find him an effective supporter in all calamities.",
        "(All) worries and sorrows will soon disappear .",
        "by Your greatness of O Allah, By Your Prophethood O Mohammed,",
        "By your Vicergency O Ali! O Ali! O Ali!",
        "INFO: Longer Version 1",
        "Call upon Ali, the manifestation of wonders, and find him a helper in difficulties.",
        "Every worry and sorrow—I direct my needs to Allah, and on Him I rely.",
        "Whenever I aim at a goal in Allah, His hand supports me.",
        "Oh Allah, I call upon You—every worry and sorrow will vanish by Your greatness.",
        "Oh Allah, through Your Prophethood, O Muhammad, through Your guardianship, O Ali, O Ali!",
        "Allah is the Greatest! I disassociate myself from the evil of Your enemies.",
        "Allah is my refuge. By the truth of “You alone we worship, and You alone we ask for help.”",
        "O Father of relief, help me! O Ali, rescue me!",
        "O Subduer of adversaries and Protector of the loyal, O manifestation of wonders!",
        "O Chosen Ali, O Subduer, You have subdued all with power.",
        "And power itself is subdued by Your overwhelming might, O Possessor of severe grasp.",
        "You are the Subduer, the Compeller, the Destroyer, the Avenger, the AllStrong.",
        "And I entrust my affairs to Allah; indeed, Allah sees His servants.",
        "Allah is sufficient for me, and He is the best Disposer of affairs, the best Master, and the best Helper.",
        "INFO: Longer Version 2",
        "Call upon Ali, the manifestation of wonders, and find him a helper in difficulties.",
        "To Allah belongs my need, and on Him I rely.",
        "Whenever I command and aim for my goal, I am under Allah's protection, and He protects me.",
        "I call upon You for every worry and sorrow, and it will vanish by Your greatness, O Allah.",
        "By Your Prophethood, O Muhammad, and by Your guardianship, O Ali, O Ali, O Ali!",
        "Rescue me, by the truth of Your subtle grace.",
        "Allah is the Greatest! I disassociate myself from the evil of Your enemies.",
        "Allah is my refuge; from You comes my help, and on You I depend.",
        "By the truth of “You alone we worship, and You alone we ask for help.”",
        "O Father of relief, help me! O Father of the two Hasans, rescue me!",
        "O Sword of Allah, rescue me! O Gate of Allah, rescue me!",
        "O Proof of Allah, rescue me! O Guardian of Allah, rescue me!",
        "By the truth of Your subtle grace, O Subduer, You have subdued all with power.",
        "And power itself is subdued by Your overwhelming might, O Subduer of enemies.",
        "O Manifestation of wonders, O Chosen Ali.",
        "You struck my oppressor with Allah’s arrow and Allah’s killing sword.",
        "I entrust my affairs to Allah; indeed, Allah sees His servants.",
        "And the rule belongs to one God; there is no deity but Him, the Most Merciful, the Most Compassionate.",
        "O Help of those who seek help, O Guide of the perplexed.",
        "O Security for the fearful, O Helper of the reliant.",
        "O Mercy for the needy, O God of the worlds, by Your mercy.",
        "And may Allah send blessings upon our master Muhammad and all his family.",
        "And all praise is due to Allah, the Lord of the worlds."
    ]
}