{
    "id": "after-salat",
    "title": "بعد الصلاة",
    "language": "ar",
    "text": [
        "INFO: Prophet Muhammad (saww)",
        "السَّلَامُ عَلَيْكَ يَا رَسُولَ اللَّهِ وَرَحْمَةُ اللَّهِ وَ بَرَكَاتُهُ، السَّلامُ عَلَيْكَ يَا مُحَمَّدُ بْنَ عَبْدِ اللَّهِ، السَّلَامُ عَلَيْكَ يَا خِيَرَةَ اللَّهِ، اَلسَّلا عَلَيْكَ يَا حَبِيبَ اللهِ السَّلَامُ عَلَيْكَ يَا صِفْوَةَ اللَّهِ السَّلَامُ عَلَيْكَ يَا أَمِينَ اللَّهِ، أَشْهَدُ أَنَّكَ رَسُولُ اللَّهِ، وَ أَشْهَدُ أَنَّكَ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ، وَأَشْهَدُ أَنَّكَ قَدْ نَصَحْتَ لِأُمَّتِكَ، وَ جَاهَدْتَ فِي سَبِيلِ رَبِّكَ، وَ عَبَدُتَهُ حَتَّى أَتَاكَ الْيَقِينُ ، فَجَزَاكَ اللَّهُ يَا رَسُولَ اللَّهِ أَفْضَلَ مَا جَزَى نَبِيًّا عَنْ أُمَّتِهِ، اَللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ أَفْضَلَ مَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَآلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ",
        "INFO: Imam Hussain (as)",
        "السَّلَامُ عَلَيْكَ يَا أَبَا عَبْدِ اللَّهِ السَّلَامُ عَلَيْكَ يَا ابْنَ رَسُولِ اللَّهِ السَّلَامُ عَلَيْكَ يَا ابْنَ أَمِيرِ الْمُؤْمِنِينَ السَّلَامُ عَلَيْكَ يَا ابْنَ فَاطِمَةَ الزَّهْرَاءِ السَّلَامُ عَلَيْكَ يَا أَبَا الْفَضْلِ الْعَبَّاسِ السَّلَامُ عَلَيْكُمْ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ",
        "INFO: Imam Ali Ridha (as)",
        "السَّلَامُ عَلَيْكَ يَا غَرِيبَ الْغُرَبَاءِ السَّلَامُ عَلَيْكَ يَا عَلِيًّا ابْنَ مُوسَىٰ الرِّضَا السَّلَامُ عَلَيْكُمْ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ",
        "INFO: Imam Mahdi (ajtfs)",
        "السَّلَامُ عَلَيْكَ يَا صَاحِبَ الْعَصْرِ وَالزَّمَانِ السَّلَامُ عَلَيْكَ يَا إِمَامَ الْإِنْسِ وَالْجَانِّ السَّلَامُ عَلَيْكَ يَا شَرِيكَ الْقُرْآنِ الْأَمَانَ، الْأَمَانَ، الْأَمَانَ السَّلَامُ عَلَيْكُمْ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ اللَّهُمَّ صَلِّ عَلَىٰ مُحَمَّدٍ وَآلِ مُحَمَّدٍ",
        "INFO: Ibn Babawayh (i.e. Shaykh al-Saduq) mentions one should say the following litany immediately after reciting Tasbih al-Zahra':",
        "اَللَّهُمَّ أَنْتَ ٱلسَّلاَمُ",
        "وَمِنْكَ ٱلسَّلاَمُ",
        "وَلَكَ ٱلسَّلاَمُ",
        "وَإِلَيْكَ يَعُودُ ٱلسَّلاَمُ",
        "سُبْحَانَ رَبِّكَ رَبِّ ٱلْعِزَّةِ عَمَّا يَصِفُونَ",
        "وَسَلاَمٌ عَلَىٰ ٱلْمُرْسَلِينَ",
        "وَٱلْحَمْدُ لِلَّهِ رَبِّ ٱلْعَالَمِينَ",
        "اَلسَّلاَمُ عَلَيْكَ اَيُّهَا ٱلنَّبِيُّ",
        "وَرَحْمَةُ ٱللَّهِ وَبَرَكَاتُهُ",
        "اَلسَّلاَمُ عَلَىٰ ٱلأَئِمَّةِ ٱلْهَادِينَ ٱلْمَهْدِيِّينَ",
        "اَلسَّلاَمُ عَلَىٰ جَمِيعِ أَنْبِيَاءِ ٱللَّهِ وَرُسُلِهِ وَمَلاَئِكَتِهِ",
        "اَلسَّلاَمُ عَلَيْنَا وَعَلَىٰ عِبَادِ ٱللَّهِ ٱلصَّالِحِينَ",
        "اَلسَّلاَمُ عَلَىٰ عَلِيٍّ أَميرِ ٱلْمُؤْمِنينَ",
        "اَلسَّلاَمُ عَلَىٰ ٱلْحَسَنِ وَٱلْحُسَيْنِ",
        "سَيِّدَيْ شَبَابِ أَهْلِ ٱلْجَنَّةِ أَجْمَعينَ",
        "اَلسَّلاَمُ عَلَىٰ عَلِيِّ بْنِ ٱلْحُسَيْنِ زَيْنِ ٱلْعَابِدِينَ",
        "اَلسَّلاَمُ عَلَىٰ مُحَمَّدِ بْنِ عَلِيٍّ بَاقِرِ عِلْمِ ٱلنَّبِيِّينَ",
        "اَلسَّلاَمُ عَلَىٰ جَعْفَرِ بْنِ مُحَمَّدٍ ٱلصَّادِقِ",
        "اَلسَّلاَمُ عَلَىٰ مُوسَىٰ بْنِ جَعْفَرٍ ٱلْكَاظِمِ",
        "اَلسَّلاَمُ عَلَىٰ عَلِيِّ بْنِ مُوسَىٰ ٱلرِّضَا",
        "اَلسَّلاَمُ عَلَىٰ مُحَمَّدِ بْنِ عَلِيٍّ ٱلْجَوَادِ",
        "اَلسَّلاَمُ عَلَىٰ عَلِيِّ بْنِ مُحَمَّدٍ ٱلْهَادِي",
        "اَلسَّلاَمُ عَلَىٰ ٱلْحَسَنِ بْنِ عَلِيٍّ ٱلزَّكِيِّ ٱلْعَسْكَرِيِّ",
        "اَلسَّلاَمُ عَلَىٰ ٱلْحُجَّةِ بْنِ ٱلْحَسَنِ ٱلْقَائِمِ ٱلْمَهْدِيِّ",
        "صَلَوَاتُ اللّهِ عَلَيْهِمْ أَجْمَعينَ",
        "INFO: After saying this litany, one may pray to Almighty Allah to grant him all his personal desires"
    ]
}