{
    "id": "imam-ali-(as)---at-najaf-shrine-2",
    "language": "ar",
    "text": [
        "DESC: Sayyid `Abd al-Karim ibn Tawus has reported the following from Safwan al-Jammal:",
        "DESC: During my journey with him to al-Kufah for meeting Abu-Ja`far al-Mansur the `Abbasid ruler, Imam Ja`far al-Sadiq (as) asked me to make our camels kneel down at a certain place, saying, “This is the tomb of my grandfather, the Commander of the Faithful.” As I made the camels kneel down there, he rode off, bathed himself, changed his clothes, took off his shoes, and ordered me to imitate him in everything. He then directed towards the hillock of Najaf (al-dhakwah), saying, “If you walk in short steps and nod your head to the ground, you shall be given one hundred thousand rewards for each step, one hundred thousand sins shall be erased from your sins, you shall be elevated one hundred thousand ranks, one hundred thousand of your requests shall be granted, and you shall be granted the rewards of all veracious individuals who died and all martyrs whom were slain.”",
        "DESC: Imam al-Sadiq (as) then walked with tranquility and gravity, and I followed him, pronouncing statements of glorification and sanctification of Almighty Allah and confession of His Oneness until we reached the hillocks there. He stopped there, looked to the right and the left, sketched something on the ground with his stick, and asked me to look for the signs of the tomb. As I did, I could notice the traces of the tomb of Imam `Ali (as). Imam al-Sadiq (as) immediately shed tears down his face and said these words",
        "إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ",
        "اَلسَّلاَمُ عَلَيْكَ أَيُّهَا ﭐلْوَصِيُّ ﭐلْبَرُّ ﭐلتَّقِيُّ",
        "اَلسَّلاَمُ عَلَيْكَ أَيُّهَا ﭐلنَّبَأُ ﭐلْعَظِيمُ",
        "اَلسَّلاَمُ عَلَيْكَ أَيُّهَا ﭐلصِّدِّيقُ ﭐلرَّشِيدُ",
        "اَلسَّلاَمُ عَلَيْكَ أَيُّهَا ﭐلْبَرُّ ﭐلزَّكِيُّ",
        "اَلسَّلاَمُ عَلَيْكَ يَا وَصِيَّ رَسُولِ رَبِّ ﭐلْعَالَمِينَ",
        "اَلسَّلاَمُ عَلَيْكَ يَا خِيَرَةَ ﭐللَّهِ عَلَىٰ ﭐلْخَلْقِ أَجْمَعِينَ",
        "أَشْهَدُ أَنَّكَ حَبيبُ ﭐللَّهِ وَخَاصَّةُ ﭐللَّهِ وَخَالِصَتُهُ",
        "اَلسَّلاَمُ عَلَيْكَ يَا وَلِيَّ ﭐللَّهِ وَمَوْضِعَ سِرِّهِ",
        "وَعَيْبَةَ عِلْمِهِ وَخَازِنَ وَحْيِهِ",
        "DESC: Imam al-Sadiq (as) then threw himself on the tomb and said these words",
        "بِأَبِي أَنْتَ وَأُمِّي يَا أَمِيرَ ﭐلْمُؤْمِنِينَ",
        "بِأَبِي أَنْتَ وَأُمِّي يَا حُجَّةَ ﭐلْخِصَامِ",
        "بِأَبِي أَنْتَ وَأُمِّي يَا بَابَ ﭐلْمَقَامِ",
        "بِأَبِي أَنْتَ وَأُمِّي يَا نُورَ ﭐللَّهِ ﭐلتَّامَّ",
        "أَشْهَدُ أَنَّكَ قَدْ بَلَّغْتَ عَنِ ﭐللَّهِ",
        "وَعَنْ رَسُولِ ﭐللَّهِ",
        "صَلَّىٰ ﭐللَّهُ عَلَيْهِ وَآلِهِ مَا حُمِّلْتَ",
        "وَرَعَيْتَ مَا ﭐسْتُحْفِظْتَ",
        "وَحَفِظْتَ مَا ﭐسْتُوْدِعْتَ",
        "وَحَلَّلْتَ حَلاَلَ ﭐللَّهِ",
        "وَحَرَّمْتَ حَرَامَ ﭐللَّهِ",
        "وَأَقَمْتَ أَحْكَامَ ﭐللَّهِ",
        "وَلَمْ تَتَعَدَّ حُدُودَ ﭐللَّهِ",
        "وَعَبَدْتَ ﭐللَّهَ مُخْلِصاً",
        "حَتَّىٰ أَتَاكَ ﭐلْيَقينُ",
        "صَلَّىٰ ﭐللَّهُ عَلَيْكَ",
        "وَعَلَىٰ ﭐلأَئِمَّةِ مِنْ بَعْدِكَ",
        "DESC: Imam al-Sadiq (as) then stood up and offered a number of units of prayer at the side of the Imam’s head. He then said to me (i.e. Safwan), “Whoever visits Amir al-Mu'minin with this form of Ziyarah and then offers the like of this prayer shall return home while all his sins are forgiven, all his efforts are accepted, and will have the rewards of all the angels who visit this tomb recorded for him.” I asked, “Do you mean the reward of all the angels who visit this tomb?”",
        "DESC: The Imam (as) answered, “Yes, I do. Each night, this tomb is visited by seventy thousand tribes of angels.”",
        "DESC: “How many is a tribe of angels?” asked I.",
        "DESC: “Each tribe consists of one hundred thousand angels,” answered the Imam (as).",
        "DESC: The Imam (as) then left the place walking back but his face was still to the grave direction, uttering the following words:",
        "يَا جَدَّاهُ يَا سَيِّدَاهُ",
        "يَا طَيِّبَاهُ يَا طَاهِرَاهُ",
        "لاََ جَعَلَهُ ﭐللَّهُ آخِرَ ﭐلْعَهْدِ مِنْكَ",
        "وَرَزَقَنِي ﭐلْعَوْدَ إِلَيْكَ",
        "وَﭐلْمَقَامَ فِي حَرَمِكَ",
        "وَﭐلْكَوْنَ مَعَكَ",
        "وَمَعَ ﭐلأَبْرَارِ مِنْ وُلْدِكَ",
        "صَلَّىٰ ﭐللَّهُ عَلَيْكَ",
        "وَعلَىٰ ﭐلْمَلاَئِكَةِ ﭐلْمُحْدِقِينَ بِكَ",
        "DESC: I then said to him, “O master! May I inform our acquaintances in al-Kufah about this and lead them to this tomb?” The Imam (as) answered in the affirmative and gave me a sum of money to construct the tomb."
    ],
    "title": "Imam Ali (as) - at Najaf Shrine 2"
}