{
    "id": "lady-ummul-baneen-(sa)---3",
    "title": "السيدة أم البنين (س)",
    "language": "ar",
    "text": [
        "أَشهَدُ أَن لا إلهَ إلا الله وَحدَهُ لا شَرِيكَ لَهُ، وَأَشهَدُ أنَّ مُحَمَّدَاً عَبدُهُ وَرَسُولُهُ، السَّلامُ عَلَيكَ يَا رَسُولَ الله، السَّلامُ عَلَيكَ يَا أَمِيرَ الُمؤمِنين، السَّلامُ عَلَيكِ يَا فَاطِمَةَ الزَّهرَاءِ سَيِّدَةِ نِسَاءِ العَالَمِين، السَّلامُ عَلَى الحَسَنِ وَالحُسَينِ سَيِّدي شَبَابِ أَهلِ الجَنَّة.",
        "السَّلامُ عَلَيكِ يَا زَوجَةَ وَصِيِّ رَسَولِ الله، السَّلامُ عَلَيكِ يَا عَزِيزَةَ الزَّهرَاءِ عَلَيهَا السَّلام، السَّلامُ عَلَيكِ يَا أُمَّ البُدُورِ السَّوَاطِع فَاطِمَةَ بِنت حزَام الكلابيّة، المُلَقَّبةُ بِأُمّ البَنِين وَبَاب الحَوَائِج،",
        "أُشهِدُ اللهَ وَرَسُولهُ أَنَّكِ جَاهَدتِ في سَبِيلِ اللهِ، إِذ ضَحّيتِ بِأَولَادَكِ دُونَ الحُسَين بنَ بِنتِ رَسُولِ الله، وَعَبَدتِ اللهَ مُخلِصَةً لَهُ الدِّين بِولائكِ لِلأَئِمَّةِ المَعصُومِين عَلَيهمُ السَّلام، وَصَبَرتِ عَلَى تِلكَ الرَزيَّةِ العَظِيمَةِ، وَاحتَسَبتِ ذَلِكَ عِندَ الله رَبّ العَالَمين، وَآزَرتِ الإمَامَ عَليَّاً في المِحَنِ وَالشَّدَائِدِ وَالمَصَائِب، وَكُنتِ في قِمَّةِ الطَّاعَةِ وَالوَفَاء، وَأنَّكِ أَحسَنتِ الكَفَالَة وَأَدَّيتِ الأَمَانَة الكُبرى في حِفظِ وَديعَتَي الزَّهرَاء البَتُول الحَسَنِ وَالحُسَينِ",
        "وَبَالَغتِ وَآثَرتِ وَرَعَيتِ حُجَجَ اللهِ المَيَامِين، وَرَغبتِ في صِلَةِ أَبنَاء رَسُولِ رَبِّ العَالَمين، عَارِفَةً بِحَقِّهِم، مُؤمِنَةً بِصِدقِهِم، مُشفِقَةً عَلَيهِم، مُؤثِرَةً هَوَاهُم وَحُبَّهُم عَلَى أَولَادكِ السُّعَدَاء.",
        "فَسَلامُ اللهِ عَلَيكِ يَا سَيِّدَتي يَا أُمَّ البَنِين مَا دَجَى الَّليلُ وَغَسَق، وَأَضَاءَ النَّهَارُ وَأَشرَق، وَسَقَاكِ الله مِن رَحِيقٍ مَختُومٍ، يَومَ لا يَنفَعُ مَالٌ وَلابَنُون، فَصِرتِ قدوَةً لِلمُؤمِنَاتِ الصَّالِحَاتِ، لأَنَّكِ كَرِيمَة الخَلائِق، عَالِمَةً مُعَلَّمَةً، نَقيَّةً زَكِيَّةً، فَرَضِيَ اللهُ عَنكِ وَأَرضَاكِ، وَلَقَد أَعطَاكِ اللهُ مِن الكَرَامَات البَاهِرَات، حَتَّى أَصبَحتِ بِطَاعَتكِ لله وَلِوَصيِّ الأَوصِيَاء وَحُبّك لِسَيِّدَة النِّسَاء الزَّهرَاءِ، وَفِدَائكِ أَولادكِ الأَربَعَة لِسَيِّدِ الشُّهَدَاء بَابَاً لِلحَوَائِج،",
        "فاشفَعِي لِي عِندَ الله بِغُفرَانِ ذُنُوبِي وَكَشفِ ضُرِّي وَقَضَاءِ حَوَائِجِي، فَإنَّ لَكِ عِندَ اللهِ شَأنَاً وَجَاهَاً مَحمُودَاً، وَالسَّلامُ عَلَى أَولَادكِ الشُّهَدَاء، العَبَّاس قَمَرُ بَنِي هَاشِم وبَاب الحَوَائِج، وَعَبد الله وَعُثمَان وَجَعفَر، الَّذِينَ استُشهِدُوا في نُصرَةِ الحُسَينِ بِكَربَلاء، وَالسَّلامُ عَلَى ابنَتكِ الدُّرَّة الزَّاهِرَة الطَّاهِرَة الرَّضيَّة خَدِيجَة، فَجَزَاكِ اللهُ وَجزَاهُم الله جَنَّاتٍ تَجرِي مِن تَحتِهَا الأَنهَارُ خَالِدِينَ فيهَا، اللهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ."
    ]
}