{
    "id": "lady-fatima-bintul-asad---mother-of-imam-ali-(as)",
    "language": "ar",
    "text": [
        "اَلسَّلاَمُُ عَلَى نَبِيِّ اللهِ السَّلاَمُ عَلَى رَسُولِ اللهِ",
        "اَلسَّلاَمُ عَلَى مُحَمَّدٍ سَيِّدِ الْمُرْسَلِينَ",
        "اَلسَّلاَمُُ عَلَى مُحَمَّدٍ سَيِّدِ الْأَوَّلِينَ",
        "اَلسَّلاَمُ عَلَى مُحَمَّدٍ سَيِّدِ الْآخِرِينَ",
        "اَلسَّلاَمُُ عَلَى مَنْ بَعَثَهُ اللهُ رَحْمَةً لِلْعَالَمِينَ",
        "اَلسَّلاَمُُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَ رَحْمَةُ اللهِ وَ بَرَكَاتُهُ",
        "اَلسَّلاَمُُ عَلَى فَاطِمَةَ بِنْتِ أَسَدٍ الْهَاشِمِيَّةِ",
        "اَلسَّلاَمُ عَلَيْكِ أَيَّتُهَا الصِّدِّيقَةُ الْمَرْضِيَّةُ",
        "اَلسَّلاَمُ عَلَيْكِ أَيَّتُهَا التَّقِيَّةُ النَّقِيَّةُ",
        "اَلسَّلاَمُُ عَلَيْكِ أَيَّتُهَا الْكَرِيمَةُ الرَّضِيَّةُ (الْمَرْضِيَّةُ) ا",
        "اَلسَّلاَم عَلَيْكِ يَا كَافِلَةَ مُحَمَّدٍ خَاتَمِ النَّبِيِّينَ",
        "اَلسَّلاَمُُ عَلَيْكِ يَا وَالِدَةَ سَيِّدِ الْوَصِيِّينَ",
        "السَّلاَمُ عَلَيْكِ يَا مَنْ ظَهَرَتْ شَفَقَتُهَا عَلَى رَسُولِ اللهِ خَاتَمِ النَّبِيِّينَ",
        "اَلسَّلاَمُُ عَلَيْكِ يَا مَنْ تَرْبِيَتُهَا لِوَلِيِّ اللهِ الْأَمِينِ",
        "اَلسَّلاَمُُ عَلَيْكِ وَ عَلَى رُوحِكِ وَ بَدَنِكِ الطَّاهِرِ",
        "اَلسَّلاَمُُ عَلَيْكِ وَ عَلَى وَلَدِكِ وَ رَحْمَةُ اللهِ وَ بَرَكَاتُهُ",
        "أَشْهَدُ أَنَّكِ أَحْسَنْتِ الْكَفَالَةَ وَ أَدَّيْتِ الْأَمَانَةَ",
        "وَ اجْتَهَدْتِ فِي مَرْضَاةِ اللهِ",
        "وَ بَالَغْتِ فِي حِفْظِ رَسُولِ اللهِ",
        "عَارِفَةً بِحَقِّهِ مُؤْمِنَةً بِصِدْقِهِ مُعْتَرِفَةً بِنُبُوَّتِهِ",
        "مُسْتَبْصِرَةً بِنِعْمَتِهِ كَافِلَةً بِتَرْبِيَتِهِ",
        "مُشْفِقَةً عَلَى نَفْسِهِ وَاقِفَةً عَلَى خِدْمَتِهِ",
        "(مُخْتَارَةً رِضَاهُ (مُؤْثِرَةً هَوَاهُ",
        "وَ أَشْهَدُ أَنَّكِ مَضَيْتِ عَلَى الْإِيمَانِ",
        "وَ التَّمَسُّكِ بِأَشْرَفِ الْأَدْيَانِ رَاضِيَةً مَرْضِيَّةً",
        "طَاهِرَةً زَكِيَّةً تَقِيَّةً نَقِيَّةً فَرَضِيَ اللهُ عَنْكِ",
        "وَ أَرْضَاكِ وَ جَعَلَ الْجَنَّةَ مَنْزِلَكِ وَ مَأْوَاكِ",
        "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ",
        "وَ انْفَعْنِي بِزِيَارَتِهَا وَ ثَبِّتْنِي عَلَى مَحَبَّتِهَا",
        "وَ لاَ تَحْرِمْنِي شَفَاعَتَهَا وَ شَفَاعَةَ الْأَئِمَّةِ مِنْ ذُرِّيَّتِهَا",
        "وَ ارْزُقْنِي مُرَافَقَتَهَا وَ احْشُرْنِي مَعَهَا وَ مَعَ أَوْلاَدِهَا الطَّاهِرِينَ",
        "اللَّهُمَّ لاَ تَجْعَلْهُ آخِرَ الْعَهْدِ مِنْ زِيَارَتِي إِيَّاهَا",
        "وَ ارْزُقْنِي الْعَوْدَ إِلَيْهَا أَبَداً مَا أَبْقَيْتَنِي",
        "وَ إِذَا تَوَفَّيْتَنِي فَاحْشُرْنِي فِي زُمْرَتِهَا",
        "وَ أَدْخِلْنِي فِي شَفَاعَتِهَا بِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ",
        "اللَّهُمَّ بِحَقِّهَا عِنْدَكَ وَ مَنْزِلَتِهَا لَدَيْكَ اغْفِرْ لِي",
        "وَ لِوَالِدَيَّ وَ لِجَمِيعِ الْمُؤْمِنِينَ وَ الْمُؤْمِنَاتِ",
        "وَ آتِنَا فِي الدُّنْيَا حَسَنَةً وَ فِي الْآخِرَةِ حَسَنَةً وَ قِنَا بِرَحْمَتِكَ عَذَابَ النَّارِ"
    ]
}