{
    "id": "prophet-muhammad-(saww)---at-shrine",
    "language": "ar",
    "text": [
        "INFO: Visiting the Shrine of the Holy Prophet (saw)",
        "DESC: When you arrive in the holy city of al-Madinah, you may bathe yourself, preparing yourself for the ziyarah. When you intend to enter The Holy Prophet's Mosque, you should stop at the door of the mosque and ask for permission to enter there. You may enter from the Gate of Archangel Gabriel (Bab Jibra'il) preceding the right foot to the left.",
        "INFO: You may then repeat one hundred times",
        "اَللَّهُ اكْبَرُ",
        "INFO: You may then offer the two unit prayer of Greeting the Mosque (tahiyyat al-masjid). After that, you may walk to the holy chamber that includes the tomb of the Holy Prophet. There, you may touch it with your hand, kiss it, and say the following",
        "السَّلاَمُ عَلَيْكَ يَا رَسُولَ ٱللَّهِ",
        "السَّلاَمُ عَلَيْكَ يَا نَبِيَّ ٱللَّهِ",
        "السَّلاَمُ عَلَيْكَ يَا مُحَمَّدُ بْنَ عَبْدِ ٱللَّهِ",
        "السَّلاَمُ عَلَيْكَ يَا خَاتَمَ ٱلنَّبِيِّينَ",
        "اشْهَدُ انَّكَ قَدْ بَلَّغْتَ ٱلرِّسَالَةَ",
        "وَاقَمْتَ ٱلصَّلاةَ",
        "وَآتَيْتَ ٱلزَّكَاةَ",
        "وَامَرْتَ بِٱلمَعْرُوفِ",
        "وَنَهَيْتَ عَنِ ٱلمُنْكَرِ",
        "وَعَبَدْتَ ٱللَّهَ مُخْلِصاً حَتَّىٰ اتَاكَ ٱليَقِينُ",
        "فَصَلَوَاتُ ٱللَّهِ عَلَيْكَ وَرَحْمَتُهُ",
        "وَعَلَىٰ اهْلِ بَيْتِكَ ٱلطَّاهِرِينَ",
        "INFO: You may then stand near the fore pillar on the right hand side of the tomb with the minbar to your right, facing the kiblah, and this is where the Holy Prophet's head rests. You may then say the following",
        "اشْهَدُ انْ لاَ إِلٰهَ إِلاَّ ٱللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ",
        "وَاشْهَدُ انَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ",
        "وَاشْهَدُ انَّكَ رَسُولُ ٱللَّهِ",
        "وَانَّكَ مُحَمَّدُ بْنُ عَبْدِ ٱللَّهِ",
        "وَاشْهَدُ انَّكَ قَدْ بَلَّغْتَ رِسَالاَتِ رَبِّكَ",
        "وَنَصَحْتَ لاِمَّتِكَ",
        "وَجَاهَدْتَ فِي سَبِيلِ ٱللَّهِ",
        "وَعَبَدْتَ ٱللَّهَ حَتَّىٰ اتَاكَ اليَقِينُ",
        "بِٱلْحِكْمَةِ وَٱلْمَوْعِظَةِ ٱلْحَسَنَةِ",
        "وَادَّيْتَ ٱلَّذِي عَلَيْكَ مِنَ ٱلْحَقِّ",
        "وَانَّكَ قَدْ رَؤُفْتَ بِٱلْمُؤْمِنِينَ",
        "وَغَلُظْتَ عَلَىٰ ٱلكَافِرِينَ",
        "فَبَلَّغَ ٱللَّهُ بِكَ افْضَلَ شَرَفِ مَحَلِّ ٱلْمُكَرَّمِينَ",
        "الْحَمْدُ لِلَّهِ ٱلَّذِي ٱسْتَنْقَذَنَا بِكَ مِنْ ٱلشِّرْكِ وَٱلضَّلالَةِ",
        "اَللَّهُمَّ فَٱجْعَلْ صَلَوَاتِكَ وَصَلَوَاتِ مَلائِكَتِكَ ٱلْمُقَرَّبِينَ",
        "وَانْبِيَائِكَ ٱلْمُرْسَلِينَ",
        "وَعِبَادِكَ ٱلصَّالِحِينَ",
        "وَاهْلِ ٱلسَّمَاوَاتِ وَٱلارَضِينَ",
        "وَمَنْ سَبَّحَ لَكَ يَا رَبَّ ٱلعَالَمِينَ",
        "مِنَ ٱلاوَّلِينَ وَٱلآخِرِينَ",
        "عَلَىٰ مُحَمَّدٍ عَبْدِكَ وَرَسُولِكَ",
        "وَنَبِيِّكَ وَامِينِكَ",
        "وَنَجِيِّكَ وَحَبِيبِكَ",
        "وَصَفِيِّكَ وَخَاصَّتِكَ",
        "وَصَفْوَتِكَ وَخِيَرَتِكَ مِنْ خَلْقِكَ",
        "اَللَّهُمَّ اعْطِهِ ٱلدَّرَجَةَ ٱلرَّفِيعَةَ",
        "وَآتِهِ ٱلوَسِيلَةَ مِنَ ٱلْجَنَّةِ",
        "وَٱبْعَثْهُ مَقَاماً مَحْمُوداً يَغْبِطُهُ بِهِ ٱلاوَّلُونَ وَٱلآخِرُونَ",
        "اَللَّهُمَّ إِنَّكَ قُلْتَ:",
        "«وَلَوْ انَّهُمْ إِذْ ظَلَمُوا انْفُسَهُمْ جَاؤُوكَ فَٱسْتَغْفَرُوٱ ٱللَّهَ",
        "وَٱسْتَغْفَرَ لَهُمُ ٱلرَّسُولُ",
        "لَوَجَدُوٱ ٱللَّهَ تَوَّاباً رَحِيماً.»",
        "وَإِنِّي اتَيْتُكَ مُسْتَغْفِراً تَائِباً مِنْ ذُنُوبِي",
        "وَإِنِّي اتَوَجَّهُ بِكَ إِلَىٰ ٱللَّهِ رَبِّي وَرَبِّكَ لِيَغْفِرَ لِي ذُنُوبِي",
        "DESC: If you have a certain request to pray Almighty Allah for granting it, you may stand before the holy tomb and make it between your shoulders, face the direction of kiblah, raise your hands, and pray for the settlement of your need, for it is predictable that your need will be settled, Allah willing.",
        "INFO: Ibn Qawlawayh, through a considerable chain of authority, has reported Muhammad ibn Mas`ud as saying that he, once, saw Imam Ja`far al-Sadiq (as) coming near the tomb of the Holy Prophet(s), putting his hand on it, and saying these words:",
        "اسْالُ ٱللَّهَ ٱلَّذِي ٱجْتَبَاكَ وَٱخْتَارَكَ",
        "وَهَدَاكَ وَهَدَىٰ بِكَ",
        "انْ يُصَلِّيَ عَلَيْكَ",
        "INFO: The Imam (as) then recited this holy verse",
        "«إِنَّ ٱللَّهَ وَمَلائِكَتَهُ يُصَلُّونَ عَلَىٰ ٱلنَّبِيِّ",
        "يَا ايُّهَا ٱلَّذِينَ آمَنُوٱ صَلُّوٱ عَلَيْهِ وَسَلِّمُوٱ تَسْلِيماً.»",
        "DESC: In Misbah al-Mutahajjid, Shaykh al-Tusi says: When you finish praying near the tomb (of the Holy Prophet), you may come to the minbar, pass your hand over it, hold the two lower pommels, and then rub your face and eyes, for this brings about eye healing. You may then offer prayers there, praise and thank Almighty Allah, and ask for the settlement of your needs. In this respect, the Holy Prophet (s) is reported to have said, “The area between my tomb and my minbar is one of the gardens of Paradise. My minbar is situated at one of the gates of Paradise.”",
        "DESC: You may then come near the standing-place of the Holy Prophet (maqam al-nabi) and offer as many prayers as possible therein. You may also offer as many prayers as possible in the Holy Prophet's Mosque, for the reward of one prayer herein is equal to the reward of one thousand prayers (offered at other places). Whenever you enter or leave the Mosque, you may invoke Almighty Allah's blessings upon the Holy Prophet. You may also offer prayers at the House of Lady Fatimah (as).",
        "INFO: You may also visit the standing-place of Archangel Gabriel (maqam jibra'il), which lies under the waterspout. At this very place, Archangel Gabriel used to stay after he would ask permission of the Holy Prophet (s). At this place, you may say the following:",
        "اسْالُكَ ايْ جَوَادُ",
        "ايْ كَرِيمُ",
        "ايْ قَرِيبُ",
        "ايْ بَعِيدُ",
        "انْ تَرُدَّ عَلَيَّ نِعْمَتَكَ",
        "INFO: Farewell ziarat",
        "السَّلاَمُ عَلَيْكَ يَا رَسُولَ اللَّهِ أَسْتَوْدِعُكَ اللَّهَ وَ أَسْتَرْعِيكَ وَ أَقْرَأُ عَلَيْكَ السَّلاَمَ‏ آمَنْتُ بِاللَّهِ وَ بِمَا جِئْتَ بِهِ وَ دَلَلْتَ عَلَيْهِ اللَّهُمَّ لاَ تَجْعَلْهُ آخِرَ الْعَهْدِ مِنِّي لِزِيَارَةِ قَبْرِ نَبِيِّكَ‏ فَإِنْ تَوَفَّيْتَنِي قَبْلَ ذَلِكَ فَإِنِّي أَشْهَدُ فِي مَمَاتِي عَلَى مَا شَهِدْتُ عَلَيْهِ فِي حَيَاتِي أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ‏ وَ أَنَّ مُحَمَّداً عَبْدُكَ وَ رَسُولُكَ صَلَّى اللَّهُ عَلَيْهِ وَ آلِهِ‏ صَلَّى اللَّهُ عَلَيْكَ السَّلاَمُ عَلَيْكَ لاَ جَعَلَهُ اللَّهُ آخِرَ تَسْلِيمِي عَلَيْك"
    ]
}