{
    "id": "syeda-fatima-zahra-(sa)---in-medina",
    "language": "ar",
    "text": [
        "اَلسَّلاَمُ عَلَیْكِ یَا بِنْتَ رَسُوْلِ اللّٰہِ",
        "اَلسَّلاَمُ عَلَیْكِ یَا بِنْتَ خَلِیْلِ اللّٰہِ",
        "اَلسَّلاَمُ عَلَیْكِ یَا بِنْتَ نَبِیِّ اللّٰہِ",
        "اَلسَّلاَمُ عَلَیْكِ یَا بِنْتَ حَبِیْبِ اللّٰہِ",
        "اَلسَّلاَمُ عَلَیْكِ یَا بِنْتَ صَفِیِّ اللّٰہِ",
        "اَلسَّلاَمُ عَلَیْكِ یَا بِنْتَ اَمِیْنِ اللّٰہِ",
        "اَلسَّلاَمُ عَلَیْكِ یَا بِنْتَ خَیْرِ خَلْقِ اللّٰہِ",
        "اَلسَّلاَمُ عَلَیْكِ یَا بِنْتَ اَفْضَلِ اَنْبِیَآئِ اللّٰہِ وَ رُسُلِہٖ وَ مَلَآئِكَتِہٖ",
        "اَلسَّلاَمُ عَلَیْكِ یَا بِنْتَ خَیْرِ الْبَرِیَّۃِ",
        "اَلسَّلاَمُ عَلَیْكِ یَا سَیِّدَۃَ نِسَآئِ الْعَالَمِیْنَ",
        "اَلسَّلاَمُ عَلَیْكِ یَا زَوْجَۃَ وَلِیِّ اللّٰہِ",
        "وَ خَیْرِ الْخَلْقِ بَعْدَ رَسُوْلِ اللّٰہِ",
        "اَلسَّلاَمُ عَلَیْكِ یَا اُمَّ الْحَسَنِ وَ الْحُسَیْنِ",
        "سَیِّدَیْ شَبَابِ اَھْلِ الْجَنَّۃِ",
        "اَلسَّلاَمُ عَلَیْكِ اَیَّتُہَا الشَّہِیْدَۃُ الصِّدِّیْقَۃُ",
        "اَلسَّلاَمُ عَلَیْكِ اَیَّتُہَا الرَّضِیَّۃُ الْمَرْضِیَّۃُ",
        "اَلسَّلاَمُ عَلَیْكِ اَیَّتُہَا الْفَاضِلَۃُ الزَّكِیَّۃُ",
        "اَلسَّلاَمُ عَلَیْكِ اَیَّتُہَا الْحَوْرَآئُ الْاِنْسِیَّۃُ",
        "اَلسَّلاَمُ عَلَیْكِ یَا فَاطِمَۃُ بِنْتَ رَسُوْلِ اللّٰہِ",
        "وَ رَحْمَۃُ اللّٰہِ وَ بَرَكَاتُہٗ",
        "صَلَّی اللّٰہُ عَلَیْكِ وَ عَلٰی رُوْحِكِ وَ بَدَنِكِ",
        "اَشْہَدُ اَنَّكِ مَضَیْتِ عَلٰی بَیِّنَۃٍ مِنْ رَبِّكِ",
        "وَ اَنَّ مَنْ سَرَّكِ فَقَدْ سَرَّ رَسُوْلَ اللّٰہِ",
        "وَ مَنْ جَفَاكِ فَقَدْ جَفَا رَسُوْلَ اللّٰہِ",
        "وَ مَنْ قَطَعَكِ فَقَدْ قَطَعَ رَسُوْلَ اللّٰہِ",
        "لِاَنَّكِ بَضْعَۃٌ مِنْہُ وَ رُوْحُہُ الَّتِیْ بَیْنَ جَنْبَیْہِ",
        "كَمَا قَالَ عَلَیْہِ اَفْضَلُ سَلاَمِ اللّٰہِ وَ اَفْضَلُ صَلَوَاتِہٖ",
        "اُشْہِدُ اللّٰہَ وَ رَسُوْلَہٗ اَنِّیْ رَاضٍ عَمَّنْ رَضِیْتِ عَنْہُ",
        "سَاخِطٌ عَمَّنْ سَخِطْتِ عَلَیْہِ",
        "مُتَبَرِّئٌ مِمَّنْ تَبَرَّاْتِ مِنْہُ مُوَالٍ",
        "لِمَنْ وَالَیْتِ مُعَادٍ لِمَنْ عَادَیْتِ",
        "مُبْغِضٌ لِمَنْ اَبْغَضْتِ مُحِبٌّ لِمَنْ اَحْبَبْتِ",
        "وَ كَفٰی بِاللّٰہِ شَہِیْدًا وَ حَسِیْبًا وَ جَازِیًا وَ مُثِیْبًا۔",
        "INFO: Then say",
        "اَللّٰہُمَّ صَلِّ وَ سَلِّمْ عَلٰی عَبْدِكَ وَ رَسُوْلِكَ",
        "مُحَمَّدِ بْنِ عَبْدِ اللّٰہِ خَاتَمِ النَّبِیِّیْنَ",
        "وَ خَیْرِ الْخَلْقِ اَجْمَعِیْنَ",
        "وَ صَلِّ عَلٰی وَصِیِّہٖ عَلِیِّ بْنِ اَبِیْ طَالِبٍ",
        "اَمِیْرِ الْمُؤْمِنِیْنَ وَ اِمَامِ الْمُسْلِمِیْنَ",
        "وَ خَیْرِ الْوَصِیِّیْنَ",
        "وَ صَلِّ عَلٰی فَاطِمَۃَ بِنْتِ مُحَمَّدٍ",
        "سَیِّدَۃِ نِسَآئِ الْعَالَمِیْنَ",
        "وَ صَلِّ عَلٰی سَیِّدَیْ شَبَابِ اَھْلِ الْجَنَّۃِ",
        "اَلْحَسَنِ وَ الْحُسَیْنِ",
        "وَ صَلِّ عَلٰی زَیْنِ الْعَابِدِیْنَ عَلِیِّ بْنِ الْحُسَیْنِ",
        "وَ صَلِّ عَلٰی مُحَمَّدِ بْنِ عَلِیٍّ بَاقِرِ عِلْمِ الْنَّبِیِّیْنَ",
        "وَ صَلِّ عَلَی الصَّادِقِ عَنِ اللّٰہِ جَعْفَرِ بْنِ مُحَمَّدٍ",
        "وَ صَلِّ عَلٰی كَاظِمِ الْغَیْظِ فِیْ اللّٰہِ مُوْسَی بْنِ جَعْفَرٍ",
        "وَ صَلِّ عَلَی الرِّضَا عَلِیِّ بْنِ مُوْسٰی",
        "وَ صَلِّ عَلَی التَّقِیِّ مَحَمَّدِ بْنِ عَلِیٍّ",
        "وَ صَلِّ عَلَی النَّقِیِّ عَلِیِّ بْنِ مَحَمَّدٍ",
        "وَ صَلِّ عَلَی الزَّكِیِّ الْحَسَنِ بْنِ عَلِیٍّ",
        "وَ صَلِّ عَلَی الْحُجَّۃِ الْقَآئِمِ بْنِ الْحَسَنِ بْنِ عَلِیٍّ",
        "اَللّٰہُمَّ اَحْیِ بِہِ الْعَدْلَ وَ اَمِتْ بِہِ الْجَوْرَ",
        "وَ زَیِّنْ بِبَقَآئِہِ الْاَرْضَ وَ اَظْہِرْ بِہٖ دِیْنَكَ",
        "وَ سُنَّۃَ نَبِیِّكَ حَتّٰی لاَ یَسْتَخْفِیَ بِشَیْئٍ مِنَ الْحَقِّ",
        "مَخَافَۃَ اَحَدٍ مِنَ الْخَلْقِ وَ اجْعَلْنَا مِنْ اَشْیَآعِہٖ",
        "وَ اَتْبَآعِہٖ وَ الْمَقْبُوْلِیْنَ فِیْ زُمْرَۃِ اَوْلِیَآئِہٖ",
        "یَا اَرْحَمَ الرَّاحِمِیْنَ",
        "اَللّٰہُمَّ صَلِّ عَلٰی مُحَمَّدٍ وَ اَھْلِ بَیْتِہٖ",
        "اَلَّذِیْنَ اَذْہَبْتَ عَنْہُمُ الرِّجْسَ وَ طَہَّرْتَہُمْ تَطْہِیْرًا۔"
    ]
}