{
    "id": "ashura-day",
    "title": "Ashura Day",
    "language": "en",
    "text": [
        "INFO: Instructions",
        "DESC: • Focus on the great tragedy that took place on this day.",
        "DESC: • Avoid attending to your business, employment matters, laughing and unnecessary discussions.",
        "DESC: • The Shi'ah should not eat or drink anything on this day (until late afternoon). This is not a fast and thus should not be kept with the intention of fasting.",
        "INFO: Recitations",
        "DESC: • Recite [Surah al-Tawhid] 100 times",
        "DESC: • Recite Salawáat as many times possible",
        "DESC: • Say la'an as many times as possible",
        "O Allah condemn and lay a curse upon the killers of Husayn (as), his family and friends",
        "Would that we were with you So that we could also share the great accomplishment with you",
        "INFO: Salah",
        "DESC: Offer salah of Ashura anytime between Fajr and Dhuhr",
        "INFO: Ziyarah / Dua",
        "DESC: • Recite Ziyarah Ashura and Dua Alqama",
        "DESC: • Recite Ziyarah Nahiya",
        "DESC: • Recite Ziyarah of Ta`ziyah (Condolence) after Asr",
        "DESC: • Sayyid Ibn Tawus has mentioned the Dua Asharaat to be said on this day",
        "INFO: Amaal imitating Imam Hussain (as)",
        "DESC: Remember the time Imam Hussain (as) had the bloodied body of his 6 month old infant son Ali-Asghar in his arms. He hesitated while walking towards the tents to hand the infants body over to the mother!",
        "DESC: Take a few steps forward and then retrace your steps to where you began 7 times.",
        "DESC: Say the following while you are moving forward and backward seven times:",
        "Verily we are Allah’s and verily unto Him we return. We are happy with His will and carry out His command",
        "DESC: Then go back to your place where you are standing and recite this dua:",
        "O Allah! Condemn and punish the licentious profligates who make the life of Thy Messenger miserable; and waged was against Thy close friends, and worshipped others, (but ) not Thee, deemed lawful (that which) Thou had forbidden, bring a curse upon their leaders, followers, on those who were in them, secretly or distinctly were hand in glove with them, or condoning their (mis) deeds. A great many curses",
        "O my Allah, bid to bring joy and happiness quickly for “Aali Muhammad”, (the children of Muhammad), bestow Thy blessings on him and on them, save them from the dangerous clutches of the undercover two-timers, and the obstinate disbelievers; open for them the doors of “the beginning”, a facility to put in practice gentleness, kindness and fairplay; create favorable conditions for them to make life full of love and thought, cheerful, free of care, as early as possible, on Thy authority let them have full control over Thy enemies, to help, rescue and defend (mank",
        "INFO: Raise your hands, having in mind the enemies of Ahl al-Bayt (as), and say this dua",
        "O my Allah! Indeed a great many among the people declared war, laid traps and intrigued against the careful and gentle guardians who observed and fulfilled the duty.",
        "The ungratefuls (the said opponents) renounced the faith and did not, in fact, believe in the “Kalimah”; attached themselves to the trend setters of disorder and tyranny; disowned and gave up the Book and the (Divine) rule of life; swerved from and angled off the two strings which according to Thy commandment, (they) should have held fast and stuck close by; undermined and twisted the truth; Went, away from the real purpose, in the opposite direction ; encouraged partisanship; Altered and falsified the Book; refused to believe in the evident proof and rightful claim, whenever confronted face to face; chose falsehood, whenever came across; lost their way and corrupted Thy laws, Islam; led people astray; killed the children of Thy Prophet, Thy liberal highminded servants, bearers of Thy knowledge, inheritors of Thy wisdom and revelation, the Book",
        "O my Allah, upset and overturn the plan and movement of Thy enemies, (who are also) the enemies of Thy Messenger and the children of Thy Messenger.",
        "O my Allah, put a stop to the spread of their sphere of influence; make their equipment and men unserviceable, their expression confused and contradictory; break up their support; crack up their strategy; lay hold upon them, hit and cut off by Thy one sharp strike; throw them down, frightened by Thy hard unnerving barrier, bury them under the swallowing mud of disasters; let them be mean and contemptible under the yoke of despise-able penance; bring them to book and let them have the taste of a hard and sharp retribution; fester them with definite and exemplary punishment, as Thou wipes out Thy enemies; it is beyond the shadow of doubt that Thou cracks down upon the criminals.",
        "O my Allah, the way of life approved by Thee has been tossed aside; Thy code of law has been suspended; and the descendents of the Prophet, in this world, had been tormented.",
        "O my Allah, Therefore give all Thy attention and care to signify truth, and the upholders of truth; restrain and prevent falsehood, and the camp-followers of false-hood, and take us to safety as a favour; guide us to true faith; make available for us, as soon as possible, happiness and bliss, bring everything in to good order through the inspiring presence of Thy representatives; make us desire and love them , make them receive us with open arms.",
        "O my Allah, bring to nothing those who celebrate the day the choicest (grand) son of Thy Prophet was martyred, in cheerful amusement; laugh and enjoy in utter delight and indulge in wanton boisterous merriment; catch hold of and punish each one of the remaining, just as Thou cracked down on the early (culprits); make twice as much the penalty,",
        "O my Allah, and punishment, a warning example, (while convicting the tyrants who took liberties with and abused the children of Thy Prophet; give the earth blow to their henchmen, put an end to their headmen, wipe out their patrons and their groups altogether.",
        "O my Allah, multiply Thy blessings generously, Thy mercy liberally, Thy favours like a windfall, (thou bestows) upon the children of Thy Prophet, who Thy enemies tried to ignore, frighten and corner, the children who are the blooming pride of the fragrant strongly grown and fertile tree. Let people subscribe to and uphold,O my Allah, their expressed refined (thoughts), and get the better of the antagonists in debate and disputations through their arguments, put the dark clouds of trouble, distress nothingness and ignorance, to flight, through (on account of) them, make firm and strong the hearts and minds of their followers (to know things for certain and give correct answers), to belong to Thy party, obedient to Thee; to love them; to support them ; stand by them, signify them; they exercised self-control whenever they put up with damage and injury in Thy cause; bring in, for them, the days, people will see them and find them among themselves to pronounce the profession of true faith, a blissful and happy time; Be quick in providing relief and joy, after a long period of suffering (to them and us), on account of their presence; bring on their worthy, decent and refined sphere of influence; and support them as Thou has given a guarantee in this connection in Thy revealed Book; Thou said, (and Thy words are always true): Allah has promised such of you as believe and do good deed that He will surely appoint them successors in the earth, as He appointed successors those before them, and that He will surely establish for them Their religion which He has chosen for them, and surely He will give them in exchange safety after their fear. Thy (shall) ascribe nothing as partner unto Me",
        "O my Allah! Therefore disperse the dark clouds hanging over them, no one has power to keep safe from pair and distress save He, O Unique ! O Single ! O Everliving ! O Self-subsisting!",
        "I, O my Allah, Thy bondman, cautions and (always) aware of Thy just requital, turn to Thee with a request, standing before Thee, to seek the favour of taking refuge with Thee, in Thy courtyard, fully aware of the fact that there is no way to run away from Thee except unto Thee.",
        "O my Allah, accede to my request, take notice of my positive statement and heartfelt secret avowal, O my Allah, and let me be the one whose conduct satisfies Thee, (whose) pious life devoted to Thee receives Thy approval, (whom) Thou brings to a place of safety through Thy mercy; verily Thou art rare, dear and beloved (because of ) Thy kindness.",
        "O my Allah, send blessings, in the beginning and at the end, on Muhammad and on the children of Muhammad; keep at peace at all times, Muhammad and the children of Muhammad, let Thy love and tenderness always envelop Muhammad and the children of Muhammad, more thoroughly and decisively than Thou had blessed, kept at peace and loved Thy Prophets, Messengers, Angels and the bearers of Thy Arsh, in the name of and for the sake of “LAA ILAAHA ILLAA ANTA”.",
        "O my Allah, let there be no separation (ever) between me and Muhammad and the children of Muhammad, Thy blessings be on him and them; let me be one among the friends and followers of Muhammad, Ali, Fatimah, Hasan and Husayn, and their pure and select descendants; give me the insight to cling to their friendship, and be always ready to walk with them, and make use of their life style; Verily Thou art liberal, Generous and Kind,",
        "DESC: Now go into prostration (Sijdah), keep either side of your face on the earth, one after the other, and say:",
        "O He who decrees that which He wills, does that which He wants. It is Thou who possesses and exercises absolute power; therefore (all) praise is for Thee (only); (Thou alone art) the praiseworthy, the thankworthy.",
        "O my Master, let them have a life full of love and peace, and let us share the harmony and bliss with them, because Thou has given a guarantee to put them on the highest pedestal of love, honour and wisdom, after the severest trial and tribulation, to do too much for them , exceeding all bounds, after they had put up with the worldly minimum (in Thy cause), to make them distinct and evident after (Thy enemies) kept them in obscurity, O the Most Truthful ! O the Most Merciful!",
        "I beseech Thee, O my Lord, and Master, humble and weak before Thee, to throw wide open doors of Thy generosity and kindness to let my hope (of fulfillment of heart’s desires) come true, and get and gather what I want in surplus; and make valid my deeds, whether insignificant looking or weighty, prolong my days until I am satisfied with being an eye-witness, and give testimony, and be among those who are called upon, so run to obey them, love them and support them (the descendents of the Holy Prophet); Make me see that very soon, close at hand, in good health sound mind and with believing heart. Verily Thou art able to do all things",
        "DESC: Raise your head, look towards the sky and say:",
        "In Thee do I seek refuge that I should be among those who hope not for Thy “Days”, so make me full well and be there, O my Master, through Thy mercy, in that time.",
        "INFO: Narrations",
        "DESC: Imām Muhammad ibn Alī al-Bāqir (as) said: \"On Ashura Day, before noon, he should go to a desert or an elevated portion of his house and recite salutations to Imam Husain (as), curse his killers excessively and pray two Rakats prayers. Then he should mourn and lament over Imam Husain (as), order everyone in his house to lament him, hold a gathering in his house narrating Imam Husain’s tragedies and become restless on the tragedies of the Imam (as), meet one another weeping and consoling one another over the Imam’s tragedies. If they do so, I guarantee that the Almighty Allāh will record all of those rewards for him. [References: Kamiluz Ziyaraat, Chapter 71, Tradition 7, page 162]",
        "DESC: Imām Alī ibn Mūsā al-Rezā (as) said: “Whoever avoids attending to his worldly affairs on the tenth of Muharram, Allāh will fulfill all the wishes and desires of this world as well as the hereafter. Whoever considers this day to be a day of mourning, sorrow and weeping for himself, Allāh the Glorified will make the day of Qiyāmah to be a day of rejoicing for him and his eyes will be cooled in Paradise on account of us.",
        "DESC: And whoever considers the tenth of Muharram to be a day of prosperity and buys something for his house (considering it a good omen), then Allāh will not give him affluence in that thing. And on the day of Qiyāmah he will be made to arise along with Yazid, Ubaydullāh bin Ziyād and Umar ibn Sa'ad (may Allāh's curse be on all of them) and will be thrown into the lowest abyss of hell.”"
    ]
}