{
    "id": "ashura-day",
    "title": "Ashura Day",
    "language": "en",
    "text": [
        "INFO: Instructions",
        "DESC: • Focus on the great tragedy that took place on this day.",
        "DESC: • Avoid attending to your business, employment matters, laughing and unnecessary discussions.",
        "DESC: • The Shi'ah should not eat or drink anything on this day (until late afternoon). This is not a fast and thus should not be kept with the intention of fasting.",
        "INFO: Recitations",
        "DESC: • Recite [Surah al-Tawhid] 100 times",
        "DESC: • Recite Salawáat as many times possible",
        "DESC: • Say la'an as many times as possible",
        "O Allah condemn and lay a curse upon the killers of Husayn (as), his family and friends",
        "Would that we were with you So that we could also share the great accomplishment with you",
        "INFO: Salah",
        "DESC: Offer salah of Ashura anytime between Fajr and Dhuhr",
        "INFO: Ziyarah / Dua",
        "DESC: • Recite Ziyarah Ashura and Dua Alqama",
        "DESC: • Recite Ziyarah Nahiya",
        "DESC: • Recite Ziyarah of Ta`ziyah (Condolence) after Asr",
        "DESC: • Sayyid Ibn Tawus has mentioned the Dua Asharaat to be said on this day",
        "INFO: Amaal imitating Imam Hussain (as)",
        "DESC: Remember the time Imam Hussain (as) had the bloodied body of his 6 month old infant son Ali-Asghar in his arms. He hesitated while walking towards the tents to hand the infants body over to the mother!",
        "DESC: Take a few steps forward and then retrace your steps to where you began 7 times.",
        "DESC: Say the following while you are moving forward and backward seven times:",
        "Verily we are Allah’s and verily unto Him we return. We are happy with His will and carry out His command",
        "DESC: Then go back to your place where you are standing and recite this dua:",
        "O Allah! Condemn and punish the licentious profligates who make the life of Thy Messenger miserable; and waged was against Thy close friends, and worshipped others, (but ) not Thee, deemed lawful (that which) Thou had forbidden, bring a curse upon their leaders, followers, on those who were in them, secretly or distinctly were hand in glove with them, or condoning their (mis) deeds. A great many curses",
        "O my Allah, bid to bring joy and happiness quickly for “Aali Muhammad”, (the children of Muhammad), bestow Thy blessings on him and on them, save them from the dangerous clutches of the undercover two-timers, and the obstinate disbelievers; open for them the doors of “the beginning”, a facility to put in practice gentleness, kindness and fairplay; create favorable conditions for them to make life full of love and thought, cheerful, free of care, as early as possible, on Thy authority let them have full control over Thy enemies, to help, rescue and defend (mank",
        "INFO: Raise your hands, having in mind the enemies of Ahl al-Bayt (as), and say this dua",
        "DESC: xxx (will add soon)",
        "INFO: Narrations",
        "DESC: Imām Muhammad ibn Alī al-Bāqir (as) said: \"On Ashura Day, before noon, he should go to a desert or an elevated portion of his house and recite salutations to Imam Husain (as), curse his killers excessively and pray two Rakats prayers. Then he should mourn and lament over Imam Husain (as), order everyone in his house to lament him, hold a gathering in his house narrating Imam Husain’s tragedies and become restless on the tragedies of the Imam (as), meet one another weeping and consoling one another over the Imam’s tragedies. If they do so, I guarantee that the Almighty Allāh will record all of those rewards for him. [References: Kamiluz Ziyaraat, Chapter 71, Tradition 7, page 162]",
        "DESC: Imām Alī ibn Mūsā al-Rezā (as) said: “Whoever avoids attending to his worldly affairs on the tenth of Muharram, Allāh will fulfill all the wishes and desires of this world as well as the hereafter. Whoever considers this day to be a day of mourning, sorrow and weeping for himself, Allāh the Glorified will make the day of Qiyāmah to be a day of rejoicing for him and his eyes will be cooled in Paradise on account of us.",
        "DESC: And whoever considers the tenth of Muharram to be a day of prosperity and buys something for his house (considering it a good omen), then Allāh will not give him affluence in that thing. And on the day of Qiyāmah he will be made to arise along with Yazid, Ubaydullāh bin Ziyād and Umar ibn Sa'ad (may Allāh's curse be on all of them) and will be thrown into the lowest abyss of hell.”"
    ]
}