{
    "id": "ashura-day",
    "title": "Ashura Day",
    "language": "transliteration",
    "text": [
        "INFO: Instructions",
        "DESC: • Focus on the great tragedy that took place on this day.",
        "DESC: • Avoid attending to your business, employment matters, laughing and unnecessary discussions.",
        "DESC: • The Shi'ah should not eat or drink anything on this day (until late afternoon). This is not a fast and thus should not be kept with the intention of fasting.",
        "INFO: Recitations",
        "DESC: • Recite [Surah al-Tawhid](Quran:112) 100 times",
        "DESC: • Recite Salawáat as many times possible",
        "DESC: • Say la'an as many times as possible",
        "allahummal A'n qatalatal husayn wa awlaadihee wa ashaabihee'",
        "Yaa Laytanee Kuntu Maakum Fa afoozo maakum Fawzan Azeema",
        "INFO: Salah",
        "DESC: Offer salah of Ashura anytime between Fajr and Dhuhr",
        "INFO: Ziyarah / Dua",
        "DESC: • Recite Ziyarah Ashura and Dua Alqama",
        "DESC: • Recite Ziyarah Nahiya",
        "DESC: • Recite Ziyarah of Ta`ziyah (Condolence) after Asr",
        "DESC: • Sayyid Ibn Tawus has mentioned the Dua Asharaat to be said on this day",
        "INFO: Amaal imitating Imam Hussain (as)",
        "DESC: Remember the time Imam Hussain (as) had the bloodied body of his 6 month old infant son Ali-Asghar in his arms. He hesitated while walking towards the tents to hand the infants body over to the mother!",
        "DESC: Take a few steps forward and then retrace your steps to where you began 7 times.",
        "DESC: Say the following while you are moving forward and backward seven times:",
        "a lillaahi wa innaa ilayhi raaji-o 'ona riz”an bi-qaz”aaa-iheewa tasleeman li-amrihee",
        "DESC: Then go back to your place where you are standing and recite this dua:",
        "Allaahumma a'd'd'ibil fajaratal lad'eena shaaqqoo rasoolaka wa h'aaraboo awliyaaa-ika wa a'badoo ghayraka was-tah'alloo muh'aaramaka wal-a'nil qaadata wal atbaa-a' wa man kaana minhum fa-khabbawa awz”a-a'ma-a'hum aw raz”iya bi-fia'-lihim laa'- nan katheeraa",
        "Allaahumma wa a'jjil faraja aali muh'ammad waj-a'l s'alawaatika a'layhi wa a'layhim was-tanqid'hum min aydil munaafiqeenal muz”illeena wal kafaratil jaahi'ideena waftah' lahum fath'an yaseeraa wa atih' lahum rawh'an wa farajan qareebaa waj-a'l lahum min ladunka a'laa a'duwwika wa a'duwwihim sut'aanan nas'eeraa",
        "INFO: Raise your hands, having in mind the enemies of Ahl al-Bayt (as), and say this dua",
        "Allaahumma inna kaseeram menal ummate naasebatil mustahfezeena menal a-immate",
        "wa kafarat bil-kalemate wa a'kafat a'lal qaadatiz zalamate wa hajaratil ketaaba was-sunnata wa a'dalat a'nil hablaynil lazayne amarta be-taa-a'tehemaa wat-tamassoke behemaa fa-amaatatil haqqa wa haadat a'nil qasde wa mala-atil ahzaaba wa harrafatil ketaaba wa kafarat bilhaqqe lammaa jaa-ahaa wa tamassakat bilbaatele lammaa a'tarazahaa wa zayya-a't haqqaka wa azallat khalqaka wa qatalat awlaada Nabiyyeka wa kheyarata e'baadeka wa hamalata i'lmeka wa warasata hikmateka wa wahyek",
        "Allaahumma fazalzil aqdaama a-a'daaa-eka wa a-a'daaa-e Rasooleka wa Ahle Bayte rasoolek",
        "Allaahumma wa akhrib deyaarahum waflul selaahahum wa khaalif bayna kalematehim wa futta fee a-a'zaadehim wa awhin kaydahum waz-ribhum besayfekal qaate-e' warmehim behajarekad daameghe wa tummahum bilbalaaa-e tamman, wa qummahum bil-a'zaabe qamman, wa a'zzibhum a'zaaban nukran, wa khuzhum bis-seneena wal mosalaatil latee ahlakta behaa a-a'daaa-aka innaka zoo nikmatim menal mujremeena",
        "Allaahumma inna sunnataka zaaa-e-a'tun wa ahkaamaka mo-a'ttalahun wa i'trata Nabiyyeka fil arze haaa-emaa",
        "Allaahumma fa-a-i'nil haqqa wa ahlahu wa aqmai'l baatela wa ahlahu wa munna a'laynaa bin-najaate wahdenaa elal eemaane wa a'jjil farajanaa wan-zimho befaraje awleyaaa-eka waj-a'lhum lanaa wuddan waj-a'lnaa lahum wafdan",
        "Allaahumma wa ahlik man ja-a'la yawma qatlibne Nabiyyeka wa kheyarateka e'edan wastahala behi farajan wa marahan wa khuz aakherahum kamaa a-khazta awwalahum wa zaa-e'fi",
        "Allaahummal a'zaaba wat-tankeela a'laa zaalemee Ahle Bayte Nabiyyeka wa Ahlak ashyaa-a'hum wa qaadatahum wa abre homaatahum wa jamaa-a'tahum",
        "Allaahumma wa zaa-if salawaateka wa rahmateka wa barakaateka 'alaa 'itrati nabiyyikal-'itratiz-zaa-i'atil-khaa-ifati mustazallati baqiyyatim minash-shajaratit-tayyibati zaakiyatim-mubaarakati wa a'li",
        "Allaahumma kalimatahum wa aflij hujjatahum wak-shifil-balaa-a wal-laawaa-a wa hanaadisa al-abaateeli wal-'amaa 'anhum wa thabbit qulooba shee'atihim wa hizbika 'alaa taa'atika wa wilaayatihim wa nusratihim wa muwaalaatihim wa a'inhum wam-nahhumus-sabra 'alal-adhaa feeka waj-'alhum ayyaamam mash-hoodatan wa awqaatan mah-moodatan mas-'oodah",
        "Tūshiku fīhā farajahum wa tūjibu fīhā tamkīnahum wa nasrahum kamā ḍaminta li-awliyā'ika fī kitābika al-munzali fa'innaka qulta wa qawluka al-ḥaqqu wa'ada Allāhu alladhīna āmanū minkum wa 'amiluṣ-ṣāliḥāti layastakhlifannahum fil-arḍi kamā stakhlafa alladhīna min qablihim wa layumakkinanna lahum dīnahum alladhī irtaḍā lahum wa layubaddilannahum mim ba'di khawfihim amnan ya'budūnanī lā yushrikūna bī shay'ā.",
        "Allaahumma fakshif ghummatahum yaa mal laa yamleko kashfiz zurre illaa howa yaa waahedo yaa ahado yaa hayyo yaa qayyoomo",
        "wa anaa yaa elaahi a'bdokal khaaa-efo minka war-raaje-o' elaykas saa-elo lakal muqbelo a'laykal laaje-o elaa fenaaa-ekal a'alemo be-annahu laa mal-ja-a minka illaa elayka",
        "Allaahumma fataqabbal do-a'aa-ee was-ma' yaa elaahee a'laaneyatee wa najwaaya waj-a'lnee mimman razeeta a'malahu wa qabilta nosokahu wa najjaytahu be-rahmateka innaka antal a'zeezul kareemo",
        "Allaahumma wa salle awwalan wa aakheran a'laa Mohammadiwn wa aale Mohammadin war-ham Mohammadawn wa aala Mohammadin be-akmale wa afzale maa sallayta wa baarakta wa tarahhamta a'laa ambeyaaa-eka wa Rosoleka wa malaaa-ekateka wa hamalate a'rsheka be-laa elaaha illaa anta",
        "Allaahumma laa tofarriq baynee wa bayna Mohammadiwn wa aale Mohammadin salawaatoka a'layhe wa a'layhim waj-a'lnee yaa mawlaaya min shee-a'te Mohammadiwn wa A'liyyin wa Faatemata wal-Hasane wal-Husaine wa zurriyyatehemat taaheratil muntajabate wa hab leyat tamassoka behablehim war-rezaa be-sabeelehim wal-akhza betareeqatehim innaka jawaadun kareemun",
        "DESC: Now go into prostration (Sijdah), keep either side of your face on the earth, one after the other, and say:",
        "Yaa man yahkomo maa yashaaa-o wa yaf-a'lo maa yureedo anta hakamta falakal hamdo mahmoodan mashkooran",
        "fa-a'jjil yaa mawlaaya farajahum wa farajanaa behim fa-innaka zaminta i'zaazahum ba-a'daz zillate wa takseerahum ba-a'dal qillate wa izhaarahum ba-a'dal khomooli yaa as-daas saadeqeena wa yaa arhamar raahemeen",
        "fa-as-eloka yaa elaahi wa sayyedee motazarre-a'n elayka be-joodeka wa karmeka basta amalee wa tajaawaza a'nnee wa qaboola qaleele a'malee wa kaseerehi waz-zeeyadata fee ayyaamee wa tablenghee zaalekal mash-hada wa an taj-a'lanee mimman yod-aa fayujeebu elaa taa-a'tehim wa mowaadaatehim wa nasrehim wa tureenee zaaleka qareeban saree-a'n fee a'aafeyaten innaka a'laa kolli shay-en qadeerun",
        "DESC: Raise your head, look towards the sky and say:",
        "A-o'ozo beka an akoona menal lazeena laa yarjoona ayyaamaka fa-a-i'znee yaa elaahee be-rahmateka min zaaleka",
        "INFO: Narrations",
        "DESC: Imām Muhammad ibn Alī al-Bāqir (as) said: \"On Ashura Day, before noon, he should go to a desert or an elevated portion of his house and recite salutations to Imam Husain (as), curse his killers excessively and pray two Rakats prayers. Then he should mourn and lament over Imam Husain (as), order everyone in his house to lament him, hold a gathering in his house narrating Imam Husain's tragedies and become restless on the tragedies of the Imam (as), meet one another weeping and consoling one another over the Imam's tragedies. If they do so, I guarantee that the Almighty Allāh will record all of those rewards for him. [References: Kamiluz Ziyaraat, Chapter 71, Tradition 7, page 162]",
        "DESC: Imām Alī ibn Mūsā al-Rezā (as) said: “Whoever avoids attending to his worldly affairs on the tenth of Muharram, Allāh will fulfill all the wishes and desires of this world as well as the hereafter. Whoever considers this day to be a day of mourning, sorrow and weeping for himself, Allāh the Glorified will make the day of Qiyāmah to be a day of rejoicing for him and his eyes will be cooled in Paradise on account of us.",
        "DESC: And whoever considers the tenth of Muharram to be a day of prosperity and buys something for his house (considering it a good omen), then Allāh will not give him affluence in that thing. And on the day of Qiyāmah he will be made to arise along with Yazid, Ubaydullāh bin Ziyād and Umar ibn Sa'ad (may Allāh's curse be on all of them) and will be thrown into the lowest abyss of hell.”"
    ]
}