{
    "id": "fadak",
    "title": "Fadak",
    "language": "en",
    "text": [
        "INFO: Introduction",
        "DESC: • Fadak was a fertile farm of date-palms outside Madinah. The Holy Prophet (saww) gifted it to his daughter Fatimah al-Zahra (sa) but after he passed away, it was taken from her as the general property of Muslims. Fatimah al-Zahra (sa) went to the Prophet’s mosque and delivered a sermon in which she demanded what was rightfully hers. This momentous sermon came to be known as the Sermon of Fadak.",
        "DESC: • When Sayyidah Zahra was informed that Abū Bakr ibn Abi Quhafah had confiscated Fadak, she put on her veil and cloak, and accompanied by some servants and women of the Bani Hashim, came to the Prophet’s mosque and facing Abū Bakr and the Muslims who were present, recited a powerful sermon.",
        "DESC: • Sayyidah Zahra had worn a long dress (and was thus placing her feet upon her dress) and her way of walking was similar to that of the Prophet. When she entered the Masjid, Abū Bakr was seated with a group of the Muhajirin, Anṣar and others and a curtain was put up for her and she stood behind it.",
        "DESC: • When she had finished the first part of her sermon, Abu Bakr responded to what she had said. She then confuted his response using evidence from the Qurʾan.",
        "INFO: Sermon",
        "Glory be to Allah for His great blessings, and gratitude to Him for that which He has inspired, and praise be to Him for what He has brought to pass. From the all-encompassing blessings that He grants to the ever-expansive grace that He bestows and all the bounties that He continuously confers. Its magnitude is greater than can be enumerated, its extent is beyond measure and its limit is beyond comprehension. He has invited the people to express their gratitude in order to seek its increase and continuity, called upon them to praise Him by augmenting it and followed up by bidding them to ask for more of its like [in the Hereafter].",
        "I bear witness that there is no god but Allah, alone, having no partners - a statement the inner meaning of which has been defined as sincerity, its means have been instilled in the hearts and its meaning gleams in the minds. He cannot be perceived by sight, described by words or depicted by imaginations. He originated everything from nothing that existed before, and created everything without following any previous model. He fashioned everything with His power and made it all with His will, without any need for bringing it into being or any possible benefit that could come from forming it; only the affirmation of His wisdom, the proclamation of His obedience, the manifestation of His power, the servility of His subjects and the exaltation of His call. Then He placed reward in obedience and punishment in disobedience to Him, in order to turn His servants away from His chastisement and urge them towards His Paradise.",
        "I bear witness that my father, Muhammad, is His servant and Prophet. He chose him even before sending him [with the Message], named him before picking him [for prophethood] and selected him before appointing him [as a Messenger] - at a time when the creation was hidden in the unknown, covered by the curtain of uncertainty and close to the edge of non- existence - out of the knowledge of Allah, the Most High, about the final outcome of every matter, the complete awareness of events that will transpire and cognizance of the end of all affairs. Allah sent him in order to complete His mission, establish His order and execute His mercy. He found the people divided in their beliefs, secluded around their sacred fires, worshipping their idols and denying Allah, despite having intrinsic knowledge about Him. So, through my father Muhammad (S), Allah illuminated their darkness, removed the ambivalence from their hearts and illumined the obscurity of their sight. He rose among the people with guidance, saved them from perversion, removed their [spiritual] blindness, led them to the right faith and called them towards the straight path. Then Allah took him back with kindness and election, affinity and preference.",
        "Thus Muhammad (S) is now in ease and comfort, [free] from the hardships of this world, surrounded by the blameless angels and the pleasure of the Forgiving Lord, in the company of the Almighty King. May Allah bless my father, His Prophet, the custodian of His revelation, His chosen servant, the one whom He selected from all His creatures and whom He is most pleased with. Peace, blessings and mercy of Allah be upon him.",
        "DESC: 💠 Then she turned to the people who were present in the gathering and said:",
        "You are the servants of Allah, the recipients of His commandments and prohibitions, the bearers of His religion and revelation and the trustees of Allah over your souls. You are the propagators of His message to all people. His true proxy is present among you, as the legacy that he (the Prophet) bequeathed and left behind with you, giving it authority over you - the Articulate Book of Allah, the True Qurʾan, the Radiant Light, the Effulgent Illumination - with proofs that are manifest and mysteries that are evident. Its apparent message is clear and those who follow it are envied. Those who adhere to it are led to Allah’s pleasure and those who heed to it are saved. Through it the enlightened proofs of Allah, His explicative verdicts, His forewarned prohibitions, His unambiguous statements, His sufficient evidence, His mandated virtues, His bestowed leniency and His ordained laws, are attained.",
        "Allah made faith (Iman) as a means to purify yourselves from polytheism, prayer (Salat) a means of freeing yourselves from arrogance, the poor-rate (Zakat) a means of cleansing the soul and increasing sustenance, fasting (Siyam) a means of establishing sincerity, pilgrimage (Hajj) a means of upraising the religion, justice a means for maintaining harmony of the hearts, obedience to us (the Ahl al-Bayt) a means of maintaining order in the community, our leadership (Imamah) as a security from disunity, holy struggle (Jihad) as a glory for Islam, patience as an aid in making one deserving of recompense, enjoining good (amr bil-maʿruf) as a reformation for the masses, honoring parents a means of protection from [divine] wrath, keeping ties with family a means of increasing your numbers, sanctioned retaliation (Qisas) a means of preventing bloodshed, fulfilling promises a means of earning forgiveness, honesty in weighing and measurement a means of avoiding diminution, forbidding the drinking of wine a means of becoming free of filth, eschewing defamation as a screen against imprecation and shunning theft a means of maintaining virtue. He prohibited polytheism in order to make His Lordship exclusive, “so observe your duty to Allah with the dutifulness due to Him, and do not die except as Muslims.” (3:102). “Obey Allah in that which He has commanded and forbidden, ‘for indeed only those who possess knowledge fear Allah.’” (35:28).",
        "DESC: 💠 Then she continued:",
        "O People, know that I am Fatimah and my father is Muhammad (S). I say again to you, and what I am saying is not false and what I am doing is not in transgression. “There has certainly come to you a messenger from among yourselves; grievous to him is your distress; he is full of concern for you, and compassionate and merciful to the believers.” (9:128). So if you honor him and know him, you will realize that he is my father and not the father of anyone amongst your women. He is the bother of my cousin [and husband], and not of any of your men. How excellent it is to be related to him. He propagated the message, warned the people openly, and turned against the ways of the polytheists, breaking their backs and strangling their throats. He called [them] to the way of his Lord. “with wisdom and good advice.” (16:125). He broke the idols and struck the heads, until they were defeated and forced to flee. Then night gave way to day and the pure truth shone forth. The leader of faith spoke and the camel-frothings of the devils were silenced. The servants of hypocrisy perished and the knots of disbelief and schism were undone.",
        "You uttered the words of faith in the presence of the bright-faced and empty-of-stomach, while you were on “the brink of a fiery pit.” (3:103). A mere draught for the drinker and opportunity for the lustful [were you]. A flickering flame and a treading ground for others [were you]. You would drink from polluted water and eat dried animal skins and leaves. Abased and spurned, you feared being dispossessed by those around you.",
        "Then Allah, the Almighty, rescued you through Muhammad (S), after all these calamities and after suffering at the hands of barbarians, the wolfish Arabs, and the rebellious People of the Book. “Whenever they ignited the flame of war, Allah extinguished it.” (5:64). Whenever the horn of Satan33 appeared or the polytheist’s maw opened [in defiance], he would dispatch his brother [Ali (as)] into its midst and he would not return until he had trampled on its ear with the soles of his feet and put out its blaze with his sword.",
        "He strove for the sake of Allah and struggled in the way of Allah. He was close to the Prophet of Allah, a leader among the friends of Allah, always prepared and diligent, sincere, earnest and hardworking - never fearing the reproach of any reproacher. Meanwhile, you were living lives of ease and comfort; relaxed, unperturbed and secure, awaiting the reversal of our fortunes, keenly waiting for news [of our failures], retreating during conflict and fleeing from battle.",
        "So when Allah chose to take His Prophet to the abode of His Prophets and the dwelling of His sincere servants, the thorny tree of hypocrisy appeared amongst you and the robe of religion became ragged. The misguided, who were previously silent, began to speak, the unknown few arose, and the liars came forward, braying [like camels] as they strutted, wagging their tails in your courtyards. Satan raised his head from his hiding place and called out to you. He found you responsive to his call and attentive to his deception. Then he enticed you and found you easy to arouse; he exasperated you and found you easy to anger. So you branded camels that were not yours and proceeded to other than your own watering holes. This, while the era [of the Prophet] had only just ended, the gash was still wide and the wound still fresh. The Prophet had yet to be buried when you made haste, claiming that you were afraid of dissension; “Lo, they have fallen into dissension! And indeed Hell surrounds the unbelievers.” (Q9:49). Far be it! What is wrong with you? And where are you heading to while the Book of Allah is in your midst? Its affairs are distinct, its rulings manifest, its signs radiant, its prohibitions evident and its commands are clear. Yet you have cast it behind your backs. Do you wish to turn away from it out of aversion? Or do you wish to judge by another [book]? “Evil would be the exchange for the wrongdoers!” (18:50). “And whoever seeks a religion other than Islam, then it will not be accepted from him and he will be among the losers in the Hereafter.” (3:85)",
        "Then you only waited for as long as it took the feral [camel] to calm down and accept a rider taking control of its reins before reigniting its flames and kindling its embers.34 You have responded to the cries of the misguiding Satan and have attempted to extinguish the lights of the splendent religion and suppress the teachings of the pure Prophet. You secretly drank the milk while pretending to sip the froth35 and stalked his family and children, hiding in the trees and trenches,36 yet we endure patiently with you through what feels like the stabbing of daggers and the piercing of [our] sides with spearheads. And now you claim that we have no inheritance! “Do they seek the judgment of [the age of] ignorance? And who is a better judge than Allah for the people who have certainty?” (5:50). Do you know not? Indeed, it is as obvious as the midday sun that I am his daughter! O Muslims, will I be denied my inheritance?!",
        "O Son of Abu Quhafah, is it in the Book of Allah that you may inherit from your father yet I cannot inherit from mine? “You have certainly come up with a strange thing!” (from 19:27). Have you purposely abandoned the Book of Allah and cast it behind your backs? When it says: “And Sulayman inherited from Dawud” (27:16) and when relating the story of Yahya ibn Zakariyya, where he (Zakariyya) said: “So grant me from Yourself an heir who will inherit from me and inherit from the family of Yaʿqub” (19:5-6) and it further states: “…but blood relatives are more entitled [to inherit] from one another in the Book of Allah” (8:75). And: “Allah enjoins you concerning your children: for the male shall be the like of the share of two females” (4:11). And: “…if he leaves behind any property, he should make a bequest for his parents and relatives in kindness, an obligation for the Godwary” (2:180). yet you claim that I have no entitlement and inherit nothing from my father?!",
        "Has Allah revealed a special verse [of the Qurʾan] for you from which He excluded my father? Or do you say that people of two separate faiths cannot inherit from one another? Are my father and I not upon the same faith? Or is it that you have greater knowledge of the particular and general injunctions of the Qurʾan than my father and cousin? So take hold of its reins, muzzled and saddled, for it will surely meet you on the day you are assembled; and Allah is the best judge and Muhammad the best leader. The [final] rendezvous is on the Day of Resurrection, and when it comes, the falsifiers will be the losers and your remorse will be of no benefit. “For every tiding there is an appointed term” (6:67). “Soon you will know whom a disgraceful punishment will overtake and on whom a lasting punishment will descend.” (11:39)",
        "Then addressing the Ansar, she said: O people of understanding, supporters of faith and defenders of Islam, what is [the cause of] this negligence in defending my rights and laxity before the injustice being done to me? Did my father, the Prophet of Allah (S), not say: “A man is honored through his offspring”? How quickly have you changed, and how hastily have you have betrayed us, while you possess the ability to assist me and the strength to support me in what I seek and pursue.",
        "Do you say: “Muhammad (S) has died”? This is indeed a grave matter whose damage is extensive, its breach is vast and its weavings have been rent apart. The world has become dark by his absence; the sun and moon have been eclipsed and the stars scattered because of his loss, hopes have been dashed, mountains have crumbled, sanctities have been violated and all that is sacred has been disregarded upon his death. This is, by Allah, a great tribulation and a dire calamity, no tribulation can be compared to it and no adversity is as grievous. The Book of Allah – glory be to Him – announced it in your courtyards, in your evenings and mornings, calling and crying out, recited and chanted, that the Prophets of Allah and His Messengers who came before were not able to overcome the definitive verdict and the inescapable decree [of death]. “And Muhammad is but a messenger, other messengers have passed away before him. If he dies or is slain, will you turn back on your heels? Anyone who turns back on his heels will not harm Allah in the least, and soon Allah will reward the grateful.” (3:144)",
        "Far be it, O Children of Qaylah! Will I be deprived of my patrimony while you watch and listen to me? And [while you] are seated and gathered here? You are involved in the claim and are aware of it, and you are numerous and well equipped, you possess means and strength, and own weapons and shields. The case has reached you, yet you do not respond. You hear the cry, yet you do not assist me. Yet you are known for your bravery and have a reputation for being good and righteous; you are an elite group and the best of those who were selected. You fought the [pagan] Arabs and bore pains and hardships. You clashed with the nations and battled the champions. We have not ceased, or is it you, who have ceased? You always complied; we ordered and you obeyed. Until, through us, Islam was established and the milk of prosperity began to flow, the breach of polytheism was subdued, the ebullition of falsehood subsided, the fires of disbelief were stifled, the call to rebellion was silenced and the religious order was founded.",
        "So why have you become confused after your clear stance? Why have you become secretive after your proclamation? Why have you retreated after being at the forefront? And why have you opted for polytheism after believing [in Allah]? “Will you not make war on a people who broke their pledges and resolved to expel the Messenger, while they attacked you first? Do you fear them? But Allah is worthier of being feared by you, should you be faithful.” (9:13). Lo, I see you now inclined to a life of ease, having distanced yourselves from the one who is more worthy of giving and withholding.37 You have withdrawn into comfort and have escaped from hardship to abundance. You have thus spit out what you had retained and vomited out what you had swallowed. “If you are ungrateful, you and those on earth all together, most surely Allah is Self-sufficient, Praised.” (14:8).",
        "I have said what I had to say, being fully aware of your intention to forsake me and of the betrayal that has sprung in your hearts. But this was the unbosoming of the soul, the outburst of anger, the inability to further endure, the expression of the heart and the advancing of proof. So, take its reins and saddle it, with its sore back and suppurating hooves, ever disgraceful, branded with the wrath of Allah and eternal dishonor, leading to “the fire, set ablaze by Allah, that roars over the hearts” (104:6-7), for what you are doing is witnessed by Allah, “and they who act unjustly shall know to what final place of turning they shall turn back.” (26:227). I am the daughter of “a warner unto you, before a severe chastisement” (34:46). So act, we too shall act, “and wait, we too shall wait.” (11:122)",
        "DESC: 💠 After having heard this, Abu Bakr said:",
        "O daughter of the Messenger of Allah! Your father was indeed affectionate, generous, gracious and merciful to the believers, and the disbelievers shall face painful chastisement and severe retribution. If we look at his relationships, we find that he was your father to the exclusion of other women, and the brother of your husband to the exclusion of all [his] other close companions. He preferred him over every close friend and he, on his part, assisted him in every important matter. None love you save the felicitous and none despise you save the wretched. You are the pure progeny of the Messenger of Allah, the best of the chosen ones, our guides towards virtue and our path to Paradise. And you, O best of all women and daughter of the best of Prophets, are true in your words and foremost in the prodigiousness of your intellect. You will not be denied your right nor will your truth be contested.",
        "By Allah, I have never opposed the opinion of the Messenger of Allah, and have never done anything but by his permission. The herald does not lie to his people; I take Allah as my witness, and He suffices as a witness, that I heard the Messenger of Allah (S) say: “We, the company of Prophets, neither bequeath gold nor silver, nor houses nor land; we only bequeath the Book, wisdom, knowledge and prophethood, and whatever we possess of [revenue generating] property, it is for the ruler who comes after us to dispense with according to his own judgment.” And we have already spent what you are asking for, to procure horses and weapons that the Muslims may use in battle, to fight against the unbelievers and quash the insurgency of rebels. This was done by the consensus of all the Muslims; I did not make this decision alone and I never enforced my opinion on anyone. This is my state and my wealth, it is at your disposal and I place it before you. Nothing will be withheld from you and nothing will be kept from you. You are the noblewoman of your father’s nation and a pure [maternal] tree for your children. Your merits cannot be disputed, and your honorable lineage and roots cannot be disparaged. Your command with respect to what I possess shall be enforced. Do you think I should act against the will of your father (SAWW) in this matter?",
        "DESC: 💠 She replied:",
        "Praise be to Allah! My father, the Messenger of Allah (S), never turned away from the Book of Allah, nor did he oppose its injunctions. Rather, he followed its directives and abided by its lofty teachings. Do you add on to your treachery by ascribing falsehood to him? And this [plot] after his death is similar to the pernicious plots that were staged against him during his lifetime. Here is the Book of Allah, a just adjudicator and a decisive articulator, [clearly] saying: “[An heir] who may inherit from me and inherit from the House of Yaʿqub” (19:6) and “Sulayman inherited from Dawud…” (27:16). And the Almighty clarified how the shares are to be allotted and legislated the laws of [filial] obligation and inheritance, prescribing the proper share of males and females, thereby removing the excuse of the falsifiers and eliminating suspicions and doubts in those left behind. No, “but your souls have made the matter seem decorous for you; yet patience is beautiful, and Allah is the one whose help is sought against what you allege.” (12:18)",
        "DESC: 💠 Abu Bakr replied:",
        "Allah spoke the truth and so did his Prophet. And his daughter has also spoken the truth. You are indeed a source of wisdom, a fountainhead of guidance and mercy, a pillar of faith and a wellspring of proof. I do not repudiate your apposite speech, nor do I reject what you say. These Muslims in front of us are the ones who compelled me to accept what I have accepted and it is by their unanimity that I took what I did; neither by coercion, nor obstinacy, nor self-importance and they are all witnesses to this.",
        "DESC: 💠 Fatimah (sa) then turned to the people and said:",
        "O people who hasten towards false speech! O those who are complacent with the ugly action that will bring ruin! “Do they not reflect on the Qurʾan or are there locks on the hearts?” (47:24). No, rather your hearts have become rusted by the evil that you have done. Thus your hearing and sight have been taken away and you have gravely misinterpreted it (the Qurʾan); how wrongly you have referred to it, and how evil is your construal from it. By Allah, you will surely find its burden heavy and its consequence dire, when the veil is lifted and the great adversity that follows becomes evident to you, and there will appear to you from your Lord what you never reckoned, “it is then that those who stood by falsehood will be the losers.” (40:78)",
        "DESC: 💠 Finally, she turned to face the grave of the Holy Prophet (S) and recited the following couplets:",
        "After you [passed away], reports and chaos followed,",
        "Had you been present, tribulations would not abound",
        "We miss you just as parched land misses its rain,",
        "And your nation is confused, see how they have turned around",
        "Every family has relatives but the position",
        "before God, is for those with the greatest proximity [to you]",
        "People manifested against us what was hidden in their hearts,",
        "As soon as you departed and the barrier of dust separated us from you",
        "They frowned at us and insulted us",
        "when you were gone, and all the land was usurped",
        "You were a full moon and an illuminating light",
        "from the Almighty, upon you was the book revealed",
        "Jibraʾil would comfort us with the verses he brought,",
        "But now you are not here and all goodness has disappeared",
        "O how I wish death would have come to us before you,",
        "When you passed and were, by the dune, from us covered",
        "INFO: Narrators",
        "DESC: 💠 First Level (tabaqah)",
        "DESC: • Abdullah ibn Abbas (d. 68 AH) • Aishah bint Abi Bakr (d. 58 AH) • al-Husayn ibn Ali ibn Abi Talib (as) (d. 61 AH) • Zaynab bint Ali ibn Abi Talib (as) (d. 62 AH)",
        "DESC: 💠 Second Level",
        "DESC: • al-Hasan ibn al-Hasan ibn Ali ibn Abi Talib (d. 97 AH) • Ali ibn al-Husayn Zayn al-Abidin (d. 95 AH) • ʿIkrimah ibn Abdillah ibn Musa ibn Abbas (d. 104 AH) • Urwah ibn Zubayr ibn Awam (d. 93 AH) • Zaynab bint al-Husayn (as), the wife of Hasan ibn al-Hasan",
        "DESC: 💠 Third Level",
        "DESC: • Abd al-Rahman ibn Kathir al-Hashimi (d. 120 AH) • Atiyyah ibn Saʿd ibn Junadah al-Awfi (d. 111 AH) • Jabir ibn Yazid al-Juʿfi (d. 128 AH) • Muhammad ibn Ali al-Baqir (as) (d. 114 AH) • Muhammad ibn Muslim ibn Ubaydillah al-Zuhari (d. 124 AH) • Salih ibn Kaysan (d. 140 AH) • Zayd ibn Ali ibn al-Husayn al-Shahid (d. 121 AH)",
        "DESC: 💠 Fourth Level",
        "DESC: • Aban ibn Taghlib (d. 141 AH) • Abdullah ibn Hasan ibn al-Hasan (d. 145 AH) • Abdullah ibn Muhammad al-Alawi (d. 145 AH) • al-Hasan ibn Salih ibn Hayy (d. 168 AH) • al-Sharqi ibn al-Qutami (d. 158 AH) • Amr ibn Shimr ibn Yazid al-Juʿfi (d. after 160 AH) • Awanah ibn al-Hakam ibn Ayadh (d. 158 AH) • Harb ibn Maymun al-Ansari (d. ~ 160 AH) • Jaʿfar ibn Muhammad al-Sadiq (as) (d. 148 AH) • Muhammad ibn Ishaq ibn Yasar (d. 151 AH) • Muhammad ibn Saʾib al-Kalbi (d. 146 AH)",
        "DESC: 💠 Fifth Level",
        "DESC: • Aban ibn Uthman al-Ahmar (d. 182 AH) • Abdullah ibn Yusuf • al-Husayn ibn Ulwan al-Kalbi (d. 2nd Century AH) • al-Husayn ibn Zayd ibn Ali (d. 190 AH) • Ali ibn Hassan ibn Kathir al-Hashimi • Muhammad ibn Amr ibn Uthman al-Juʿfi (d. 2nd Century AH) • Musa ibn Isa ibn Muhammad al-Abbas al-Hashimi (d. 183 AH) • Naʾil ibn Najih al-Basri • Ubaydullah ibn Musa al-Amri (d. 175 AH)",
        "DESC: 💠 Sixth Level",
        "DESC: • Abdullah ibn al-Ḍahhak (d. 206 AH) • Ahmad ibn Muhammad ibn Abi Nasr al-Bazanti (d. 221 AH) • al-Abbas ibn Bakkar al-Ḍabbi (d. 222 AH) • Hisham ibn Muhammad (d. 206 AH) • Ismaʿil ibn Mihran (d. 220 AH) • Muhammad ibn Abi Umayr (d. 217 AH) • Muhammad ibn al-Husayn al-Qasabani (d. 221 AH) • Muhammad ibn Sulayman • Muhammad ibn Umarah • Muhammad ibn Ziyad al-Ziyadi (d. 3rd Century AH) • Ubaydullah ibn Muhammad (d. 228 AH) • Ubaydullah ibn Musa al-Absi (d. 221 AH)",
        "DESC: 💠 Seventh Level",
        "DESC: • Abd al-Jalil al-Baqilani • al-Hasan ibn Musa al-Khashshab (d. 260 AH) • Jaʿfar ibn Muhammad (d. 260 AH) • Jaʿfar ibn Muhammad ibn Umarah • Mufadhdhal ibn Ibrahim al-Ashʿari • Muhammad ibn Aslam (d. 270 AH) • Muhammad ibn Khalid al-Barqi • Uthman ibn ʿImran al-Ujayfi • Yahya ibn al-Husayn ibn Zayd (d. 237 AH) • Zayd ibn Ali ibn al-Husayn ibn Zayd (d. 270 AH)",
        "DESC: 💠 Eighth Level",
        "DESC: • Abdullah ibn Muhammad ibn Sulayman • Ahmad ibn Abi Abdillah al-Barqi (d. 274 AH) • Ahmad ibn Abi Tahir, better known as Ibn Tayfur (d. 280 AH) • Ahmad ibn Muhammad ibn Muhammad ibn Saʿid al-Zayyat • Ahmad ibn Ubayd ibn Nasih (d. 273 AH) • Muhammad ibn Mufadhdhal ibn Ibrahim al-Ashʿari • Muhammad ibn Qasim al-Saymami (d. 282 AH) • Muhammad ibn Zakariyya al-Basri (d. 298 AH) • Sulayman ibn Ibrahim (d. 288 AH)",
        "DESC: 💠 Ninth Level",
        "DESC: • Ahmad ibn Abd al-Aziz al-Jawhari (d. 323 AH) • Ahmad ibn Abdillah ibn Qudhaʿah al-Safwani (d. 4th Century AH) • Ahmad ibn Muhammad al-Makki (d. 322 AH) • Ahmad ibn Muhammad ibn Yazid (d. 307 AH) • Ali ibn al-Husayn al-Saʿd Abadi • Muhammad ibn Ahmad ibn Muhammad al-Katib (d. 322 AH) • Muhammad ibn Musa ibn al-Mutawakkil (d. after 310 AH)",
        "DESC: 💠 Tenth Level",
        "DESC: • Abd al-Aziz ibn Yahya al-Jaludi (d. 332 AH) • Abdullah ibn Ahmad ibn Tayfur (d. 352 AH) • Abdullah ibn Ishaq (d. 329 AH) • Ahmad ibn Muhammad ibn Saʿid al-Hamadani, better known as Ibn Uqdah (d. 332 AH) • Ali ibn al-Husayn better known as Abu al-Faraj Isfahani (d. 356 AH) • Ali ibn Harun ibn Ali ibn Yahya (d. 352 AH) • Hatim ibn Abi Hatim al-Qazwini (d. 305 AH) • Muhammad ibn Ahmad al-Safwani (d. 352 AH)",
        "DESC: 💠 Eleventh Level",
        "DESC: • Ali ibn al-Husayn al-Shaykh al-Saduq (d. 381 AH) • Harun ibn Musa ibn Ahmad al-Shaybani al-Talaʿukbari (d. 385 AH) • Khadijah bint Muhammad ibn Ahmad (Umm al-Fadhl) • Muhammad ibn Abdullah al-Shaybani (d. 387 AH) • Muhammad ibn ʿImran ibn Musa, better known as al-Katib al-Baghdadi (d. 384 AH)",
        "DESC: 💠 Conclusion",
        "DESC: With over 25 chains of transmission and 90 narrators, there is little room to doubt the historicity of al-Sayyidah Fatimah’s sermon in which she presented her case for the rightful ownership of Fadak. Only the specific contents of the sermon, in terms of wording and expression, may be debated. Different versions exist, but the differences are minor and do not in any way impugn the sermon itself."
    ]
}